<!DOCTYPE HTML>
<html lang="en" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>Вступ | Рoзуміння ECMAScript 6</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="../gitbook/style.css">
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="../manuscript/01-Block-Bindings.html" />
    
    
    <link rel="prev" href="../index.html" />
    

        <link href="http://understandinges6.denysdovhan.com/rss.xml" title="Рoзуміння ECMAScript 6" rel="alternate"type="application/rss+xml">
    </head>
    <body>
        
        
    <div class="book"
        data-level="1"
        data-chapter-title="Вступ"
        data-filepath="manuscript/00-Introduction.md"
        data-basepath=".."
        data-revision="Wed Mar 23 2016 18:25:24 GMT+0000 (UTC)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="../index.html">
                
                        <i class="fa fa-check"></i>
                        
                        Рoзуміння ECMAScript 6
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="1" data-path="manuscript/00-Introduction.html">
            
                
                    <a href="../manuscript/00-Introduction.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        Вступ
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="manuscript/01-Block-Bindings.html">
            
                
                    <a href="../manuscript/01-Block-Bindings.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        Блочне зв’язування
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3" >
            
            <span><b>3.</b> Рядки та регулярні вирази</span>
            
            
        </li>
    
        <li class="chapter " data-level="4" >
            
            <span><b>4.</b> Функції</span>
            
            
        </li>
    
        <li class="chapter " data-level="5" >
            
            <span><b>5.</b> Об’єкти</span>
            
            
        </li>
    
        <li class="chapter " data-level="6" >
            
            <span><b>6.</b> Деструктурування</span>
            
            
        </li>
    
        <li class="chapter " data-level="7" >
            
            <span><b>7.</b> Символи</span>
            
            
        </li>
    
        <li class="chapter " data-level="8" >
            
            <span><b>8.</b> Sets та Maps</span>
            
            
        </li>
    
        <li class="chapter " data-level="9" >
            
            <span><b>9.</b> Ітератори та генератори</span>
            
            
        </li>
    
        <li class="chapter " data-level="10" >
            
            <span><b>10.</b> Класи</span>
            
            
        </li>
    
        <li class="chapter " data-level="11" >
            
            <span><b>11.</b> Масиви</span>
            
            
        </li>
    
        <li class="chapter " data-level="12" >
            
            <span><b>12.</b> Проміси</span>
            
            
        </li>
    
        <li class="chapter " data-level="13" >
            
            <span><b>13.</b> Рефлексія</span>
            
            
        </li>
    
        <li class="chapter " data-level="14" >
            
            <span><b>14.</b> Проксі</span>
            
            
        </li>
    
        <li class="chapter " data-level="15" >
            
            <span><b>15.</b> Модулі</span>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../" >Рoзуміння ECMAScript 6</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x432;&#x441;&#x442;&#x443;&#x43F;">&#x412;&#x441;&#x442;&#x443;&#x43F;</h1>
<p>&#x41E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x44F;&#x434;&#x440;&#x430; &#x43C;&#x43E;&#x432;&#x438; JavaScript &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456; &#x443; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x456; &#x43F;&#x456;&#x434; &#x43D;&#x430;&#x437;&#x432;&#x43E;&#x44E; ECMA-262. &#x41C;&#x43E;&#x432;&#x430;, &#x44F;&#x43A;&#x443; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x446;&#x435;&#x439; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;, &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; ECMAScript, &#x437; &#x44F;&#x43A;&#x43E;&#x457; JavaScript &#x443; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445; &#x442;&#x430; &#x43E;&#x442;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x456; Node.js &#x454; &#x43D;&#x430;&#x434;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x43E;&#x44E;. &#x423; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441;, &#x43A;&#x43E;&#x43B;&#x438; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438; &#x442;&#x430; Node.js &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x442;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;, &#x44F;&#x434;&#x440;&#x43E; &#x43C;&#x43E;&#x432;&#x438; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A;&#x438;&#x43C;, &#x44F;&#x43A;&#x438;&#x43C; &#x432;&#x43E;&#x43D;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x435; &#x443; ECMAScript, &#x442;&#x43E;&#x43C;&#x443; &#x440;&#x43E;&#x437;&#x432;&#x438;&#x442;&#x43E;&#x43A; ECMA-262 &#x454; &#x436;&#x438;&#x442;&#x442;&#x454;&#x432;&#x43E; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#x443;&#x441;&#x43F;&#x456;&#x445;&#x443; JavaScript &#x432; &#x446;&#x456;&#x43B;&#x43E;&#x43C;&#x443;.</p>
<p>&#x423; 2007 &#x440;&#x43E;&#x446;&#x456; JavaScript &#x43E;&#x43F;&#x438;&#x43D;&#x438;&#x432;&#x441;&#x44F; &#x43D;&#x430; &#x440;&#x43E;&#x437;&#x434;&#x43E;&#x440;&#x456;&#x436;&#x436;&#x456;. &#x41F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456;&#x441;&#x442;&#x44C; Ajax &#x43F;&#x43E;&#x440;&#x43E;&#x434;&#x438;&#x43B;&#x430; &#x43D;&#x43E;&#x432;&#x443; &#x435;&#x43F;&#x43E;&#x445;&#x443; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x456;&#x447;&#x43D;&#x438;&#x445; &#x432;&#x435;&#x431;&#x2013;&#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x456;&#x432; &#x443; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441;, &#x43A;&#x43E;&#x43B;&#x438; JavaScript &#x43D;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x432;&#x441;&#x44F; &#x437;&#x456; &#x441;&#x432;&#x43E;&#x454;&#x457; &#x442;&#x440;&#x435;&#x442;&#x44C;&#x43E;&#x457; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x446;&#x456;&#x457; ECMA-262, &#x43E;&#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x457; &#x443; 1999 &#x440;&#x43E;&#x446;&#x456;. TC-39, &#x43A;&#x43E;&#x43C;&#x456;&#x442;&#x435;&#x442; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x437;&#x430; &#x440;&#x43E;&#x437;&#x432;&#x438;&#x442;&#x43E;&#x43A; ECMAScript, &#x437;&#x456;&#x431;&#x440;&#x430;&#x432; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; ECMAScript 4. ECMAScript 4 &#x431;&#x443;&#x432; &#x432;&#x441;&#x435;&#x43E;&#x445;&#x43E;&#x43F;&#x43B;&#x44E;&#x44E;&#x447;&#x438;&#x43C;, &#x432;&#x43D;&#x43E;&#x441;&#x44F;&#x447;&#x438; &#x443; &#x43C;&#x43E;&#x432;&#x443; &#x44F;&#x43A; &#x43C;&#x430;&#x43B;&#x435;&#x43D;&#x44C;&#x43A;&#x456; &#x442;&#x430;&#x43A; &#x456; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438;. &#x41D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x43B;&#x438; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;, &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;, &#x43A;&#x43B;&#x430;&#x441;&#x438;, &#x43A;&#x43B;&#x430;&#x441;&#x438;&#x447;&#x43D;&#x435; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x456; &#x442;&#x438;&#x43F;&#x438; &#x442;&#x430; &#x456;&#x43D;&#x448;&#x435;.</p>
<p>&#x417;&#x43C;&#x456;&#x43D;&#x438;, &#x449;&#x43E; &#x43E;&#x445;&#x43E;&#x43F;&#x43B;&#x44E;&#x432;&#x430;&#x43B;&#x438; ECMAScript 4 &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43B;&#x438; &#x440;&#x43E;&#x437;&#x43A;&#x43E;&#x43B; &#x443; TC-39: &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x443;&#x447;&#x430;&#x441;&#x43D;&#x438;&#x43A;&#x438; &#x432;&#x432;&#x430;&#x436;&#x430;&#x43B;&#x438;, &#x449;&#x43E; &#x447;&#x435;&#x442;&#x432;&#x435;&#x440;&#x442;&#x430; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x446;&#x456;&#x44F; &#x43D;&#x430;&#x434;&#x442;&#x43E; &#x440;&#x430;&#x434;&#x438;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x430;. &#x413;&#x440;&#x443;&#x43F;&#x430; &#x43B;&#x456;&#x434;&#x435;&#x440;&#x456;&#x432; &#x437; Yahoo, Google, &#x442;&#x430; Microsoft &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x43F;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x443; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456;&#x439; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; ECMAScript, &#x44F;&#x43A;&#x443; &#x441;&#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43B;&#x438; ECMAScript 3.1. &#x412;&#x435;&#x440;&#x441;&#x456;&#x44F; &#xAB;3.1&#xBB; &#x43C;&#x430;&#x43B;&#x430; &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43E;&#x432;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x443; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x43E;&#x43C;&#x443; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x456;.</p>
<p>ECMAScript 3.1 &#x432;&#x432;&#x43E;&#x434;&#x438;&#x432; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x438;&#x445; &#x437;&#x43C;&#x456;&#x43D;, &#x430;&#x43B;&#x435; &#x43D;&#x435; &#x444;&#x43E;&#x43A;&#x443;&#x441;&#x443;&#x432;&#x430;&#x432;&#x441;&#x44F; &#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x445; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x456;&#x432;, &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456;&#x439; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x446;&#x456; JSON, &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x434;&#x43E; &#x432;&#x436;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x425;&#x43E;&#x447;&#x430; &#x441;&#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x431;&#x443;&#x43B;&#x438; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x438; &#x443;&#x437;&#x433;&#x43E;&#x434;&#x438;&#x442;&#x438; ECMAScript 3.1 &#x442;&#x430; ECMAScript 4, &#x437;&#x440;&#x435;&#x448;&#x442;&#x43E;&#x44E; &#x446;&#x435; &#x43D;&#x435; &#x432;&#x434;&#x430;&#x43B;&#x43E;&#x441;&#x44C;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x442;&#x430;&#x431;&#x43E;&#x440;&#x438; &#x43C;&#x430;&#x43B;&#x438; &#x432;&#x43A;&#x440;&#x430;&#x439; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x43F;&#x43E;&#x433;&#x43B;&#x44F;&#x434;&#x438; &#x43D;&#x430; &#x442;&#x435;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x43D;&#x430;&#x43F;&#x440;&#x44F;&#x43C;&#x43A;&#x443; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x430; &#x440;&#x43E;&#x437;&#x432;&#x438;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43C;&#x43E;&#x432;&#x430;.</p>
<p>&#x423; 2008, &#x411;&#x440;&#x435;&#x43D;&#x434;&#x430;&#x43D; &#x410;&#x439;&#x43A;, &#x442;&#x432;&#x43E;&#x440;&#x435;&#x446;&#x44C; JavaScript, &#x430;&#x43D;&#x43E;&#x43D;&#x441;&#x443;&#x432;&#x430;&#x432;, &#x449;&#x43E; TC-39 &#x437;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x457; &#x437;&#x443;&#x441;&#x438;&#x43B;&#x43B;&#x44F; &#x43D;&#x430; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x438;&#x437;&#x430;&#x446;&#x456;&#x457; ECMAScript 3.1. &#x412;&#x43E;&#x43D;&#x438; &#x432;&#x438;&#x440;&#x456;&#x448;&#x438;&#x43B;&#x438;, &#x449;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x43C;&#x430;&#x436;&#x43E;&#x440;&#x43D;&#x456; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x456; &#x442;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438; ECMAScript 4 &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x43D;&#x43E;&#x432;&#x430; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F; ECMAScript &#x431;&#x443;&#x434;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x44E;, &#x456; &#x432;&#x441;&#x456; &#x447;&#x43B;&#x435;&#x43D;&#x438; &#x43A;&#x43E;&#x43C;&#x456;&#x442;&#x435;&#x442;&#x443; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x437;&#x456;&#x431;&#x440;&#x430;&#x442;&#x438; &#x43D;&#x430;&#x439;&#x43A;&#x440;&#x430;&#x449;&#x435; &#x437; ECMAScript 3.1 &#x442;&#x430; 4 &#x440;&#x430;&#x437;&#x43E;&#x43C; &#x2014; &#x446;&#x456; &#x437;&#x443;&#x441;&#x438;&#x43B;&#x43B;&#x44F; &#x431;&#x443;&#x43B;&#x438; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x456; ECMAScript Harmony.</p>
<p>&#x417;&#x440;&#x435;&#x448;&#x442;&#x43E;&#x44E;, ECMAScript 3.1 &#x431;&#x443;&#x432; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43F;&#x2019;&#x44F;&#x442;&#x43E;&#x44E; &#x432;&#x435;&#x440;&#x441;&#x456;&#x454;&#x44E; ECMA-262, &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43E;&#x44E; &#x44F;&#x43A; ECMAScript 5. &#x41A;&#x43E;&#x43C;&#x456;&#x442;&#x435;&#x442; &#x443;&#x445;&#x432;&#x430;&#x43B;&#x438;&#x432; &#x440;&#x456;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x432;&#x438;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x438; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442; ECMAScript 4, &#x449;&#x43E;&#x431; &#x443;&#x43D;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x43F;&#x43B;&#x443;&#x442;&#x430;&#x43D;&#x438;&#x43D;&#x438; &#x437;&#x456; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43E;&#x43C;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x430;&#x432; &#x442;&#x430;&#x43A;&#x435; &#x436; &#x456;&#x43C;&#x2019;&#x44F;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43F;&#x440;&#x438;&#x43F;&#x438;&#x43D;&#x438;&#x432; &#x441;&#x432;&#x43E;&#x454; &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x41F;&#x43E;&#x442;&#x456;&#x43C; &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x447;&#x430;&#x43B;&#x430;&#x441;&#x44C; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x430; &#x43D;&#x430;&#x434; ECMAScript Harmony, &#x430; ECMAScript 6 &#x441;&#x442;&#x430;&#x432; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43E;&#x43C;, &#x432;&#x438;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x438;&#x43C; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43D;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#xAB;&#x433;&#x430;&#x440;&#x43C;&#x43E;&#x43D;&#x456;&#x439;&#x43D;&#x43E;&#x43C;&#x443;&#xBB; &#x440;&#x443;&#x441;&#x43B;&#x456;.</p>
<p>ECMAScript 6 &#x434;&#x43E;&#x441;&#x44F;&#x433;&#x43D;&#x443;&#x432; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x442;&#x430;&#x442;&#x443;&#x441;&#x443; &#x443; 2015 &#x440;&#x43E;&#x446;&#x456; &#x442;&#x430; &#x431;&#x443;&#x432; &#x43E;&#x444;&#x456;&#x446;&#x456;&#x439;&#x43D;&#x43E; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x43C; &#xAB;ECMAScript 2015&#xBB; (&#x445;&#x43E;&#x447;&#x430; &#x446;&#x435;&#x439; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x434;&#x43E;&#x441;&#x456; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x454; &#x439;&#x43E;&#x433;&#x43E; ECMAScript 6, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x442;&#x430;&#x43A;&#x430; &#x43D;&#x430;&#x437;&#x432;&#x430; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x437;&#x432;&#x438;&#x447;&#x43D;&#x430; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C;). &#x41D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x430;&#x440;&#x456;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x43F;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x43D;&#x43E;&#x432;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x442;&#x430; &#x43F;&#x430;&#x442;&#x435;&#x440;&#x43D;&#x456;&#x432; &#x434;&#x43E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x438;&#x445; &#x437;&#x43C;&#x456;&#x43D; &#x43D;&#x43E;&#x432;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x432;&#x436;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x41D;&#x430;&#x439;&#x446;&#x456;&#x43A;&#x430;&#x432;&#x456;&#x448;&#x430; &#x440;&#x456;&#x447; &#x443; ECMAScript 6 &#x2014; &#x446;&#x435; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x441;&#x456; &#x446;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x441;&#x43F;&#x440;&#x44F;&#x43C;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438;, &#x437; &#x44F;&#x43A;&#x438;&#x43C;&#x438; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x437;&#x443;&#x441;&#x442;&#x440;&#x456;&#x447;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438;. &#x425;&#x43E;&#x447; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x435;&#x43D; &#x447;&#x430;&#x441; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E;&#x431; ECMAScript 6 &#x431;&#x443;&#x432; &#x430;&#x434;&#x430;&#x43F;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x442;&#x430; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x445;&#x43E;&#x447; &#x43D;&#x430; &#x43C;&#x456;&#x43D;&#x456;&#x43C;&#x443;&#x43C;, &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x44E;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438;, &#x437;&#x430;&#x442;&#x435; &#x43C;&#x438; &#x432;&#x436;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x43C;&#x43E; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x447;&#x43E;&#x433;&#x43E; &#x43D;&#x430;&#x432;&#x447;&#x438;&#x442;&#x438;&#x441;&#x44C;, &#x434;&#x456;&#x437;&#x43D;&#x430;&#x432;&#x448;&#x438;&#x441;&#x44C; &#x43F;&#x440;&#x43E; &#x442;&#x435;, &#x44F;&#x43A;&#x438;&#x43C; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x43C;&#x430;&#x439;&#x431;&#x443;&#x442;&#x43D;&#x454; JavaScript.</p>
<h2 id="&#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x456;&#x441;&#x442;&#x44C;-&#x437;-&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x43C;&#x438;-&#x442;&#x430;-nodejs">&#x421;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x437; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x43C;&#x438; &#x442;&#x430; Node.js</h2>
<p>&#x411;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x438;&#x449; JavaScript, &#x44F;&#x43A; &#x43E;&#x442; &#x432;&#x435;&#x431;&#x2013;&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438; &#x442;&#x430; Node.js, &#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x43D;&#x430;&#x434; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x454;&#x44E; ECMAScript 6. &#x426;&#x44F; &#x43A;&#x43D;&#x438;&#x433;&#x430; &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x43D;&#x430; &#x43C;&#x435;&#x442;&#x456; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457;, &#x43D;&#x430;&#x442;&#x43E;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x43E;&#x43D;&#x430; &#x441;&#x444;&#x43E;&#x43A;&#x443;&#x441;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x43D;&#x430; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x44E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x43E;&#x44E;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x446;&#x456;&#x43B;&#x43A;&#x43E;&#x43C; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x432;&#x430;&#x448;&#x43E;&#x433;&#x43E; &#x43E;&#x442;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F; JavaScript &#x43C;&#x43E;&#x436;&#x435; &#x43D;&#x435; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x442;&#x438; &#x442;&#x456;&#x439; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x446;&#x456;, &#x44F;&#x43A;&#x430; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x430; &#x443; &#x446;&#x456;&#x439; &#x43A;&#x43D;&#x438;&#x437;&#x456;.</p>
<h2 id="&#x434;&#x43B;&#x44F;-&#x43A;&#x43E;&#x433;&#x43E;-&#x446;&#x44F;-&#x43A;&#x43D;&#x438;&#x433;&#x430;">&#x414;&#x43B;&#x44F; &#x43A;&#x43E;&#x433;&#x43E; &#x446;&#x44F; &#x43A;&#x43D;&#x438;&#x433;&#x430;</h2>
<p>&#x426;&#x44F; &#x43A;&#x43D;&#x438;&#x433;&#x430; &#x454; &#x43A;&#x435;&#x440;&#x456;&#x432;&#x43D;&#x438;&#x446;&#x442;&#x432;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x442;&#x438;&#x445;, &#x445;&#x442;&#x43E; &#x432;&#x436;&#x435; &#x437;&#x43D;&#x430;&#x439;&#x43E;&#x43C;&#x438;&#x439; &#x437; JavaScript &#x442;&#x430; ECMAScript 5. &#x413;&#x43B;&#x438;&#x431;&#x43E;&#x43A;&#x456; &#x437;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x432;&#x438; &#x43D;&#x435; &#x454; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x443;&#x442;&#x44C; &#x443; &#x43D;&#x430;&#x433;&#x43E;&#x434;&#x456; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43C;&#x456;&#x436; ECMAScript 5 &#x442;&#x430; 6. &#x417;&#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x430;, &#x446;&#x44F; &#x43A;&#x43D;&#x438;&#x433;&#x430; &#x43D;&#x430;&#x446;&#x456;&#x43B;&#x435;&#x43D;&#x430; &#x43D;&#x430; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x442;&#x430; &#x432;&#x438;&#x441;&#x43E;&#x43A;&#x43E;&#x433;&#x43E; &#x440;&#x456;&#x432;&#x43D;&#x44F; (&#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x447;&#x438; Node.js &#x43E;&#x442;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F;), &#x44F;&#x43A;&#x456; &#x445;&#x43E;&#x447;&#x443;&#x442;&#x44C; &#x434;&#x456;&#x437;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43F;&#x440;&#x43E; &#x43C;&#x430;&#x439;&#x431;&#x443;&#x442;&#x43D;&#x454; &#x446;&#x456;&#x454;&#x457; &#x43C;&#x43E;&#x432;&#x438;.</p>
<p>&#x426;&#x44F; &#x43A;&#x43D;&#x438;&#x433;&#x430; &#x43D;&#x435; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x456;&#x432;&#x446;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x43F;&#x438;&#x441;&#x430;&#x43B;&#x438; &#x43D;&#x430; JavaScript. &#x412;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x435; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x435;, &#x491;&#x440;&#x443;&#x43D;&#x442;&#x43E;&#x432;&#x43D;&#x435; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x432;&#x438;, &#x449;&#x43E;&#x431; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x446;&#x456;&#x454;&#x44E; &#x43A;&#x43D;&#x438;&#x433;&#x43E;&#x44E;.</p>
<h2 id="&#x43E;&#x433;&#x43B;&#x44F;&#x434;">&#x41E;&#x433;&#x43B;&#x44F;&#x434;</h2>
<p><strong>&#x413;&#x43B;&#x430;&#x432;&#x430; 1: &#x411;&#x43B;&#x43E;&#x447;&#x43D;&#x435; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</strong> &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43F;&#x440;&#x43E; <code>let</code> &#x442;&#x430; <code>const</code> &#x2014; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x43A;&#x438; <code>var</code> &#x437; &#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x43E;&#x44E; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44E; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;.</p>
<p><strong>&#x413;&#x43B;&#x430;&#x432;&#x430; 2: &#x420;&#x44F;&#x434;&#x43A;&#x438; &#x442;&#x430; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438;</strong> &#x43E;&#x445;&#x43E;&#x43F;&#x43B;&#x44E;&#x454; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x430;&#x43D;&#x456;&#x43F;&#x443;&#x43B;&#x44F;&#x446;&#x456;&#x439; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x432;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x438;&#x445; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;.</p>
<p><strong>&#x413;&#x43B;&#x430;&#x432;&#x430; 3: &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;</strong> &#x440;&#x43E;&#x437;&#x431;&#x438;&#x440;&#x430;&#x454; &#x440;&#x456;&#x437;&#x43D;&#x43E;&#x43C;&#x430;&#x43D;&#x456;&#x442;&#x43D;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;&#x445;. &#x412;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x454; arrow-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x437;&#x430;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x432;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x442;&#x430; &#x456;&#x43D;&#x448;&#x435;.</p>
<p><strong>&#x413;&#x43B;&#x430;&#x432;&#x430; 4: &#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;</strong> &#x43F;&#x43E;&#x44F;&#x441;&#x43D;&#x44E;&#x454; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x443; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x456;, &#x43C;&#x43E;&#x434;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x442;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x422;&#x435;&#x43C;&#x430; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x454; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x443; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;&#x432; &#x442;&#x430; &#x43D;&#x43E;&#x432;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p><strong>&#x413;&#x43B;&#x430;&#x432;&#x430; 5: &#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</strong> &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x432; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x449;&#x43E; &#x434;&#x430;&#x454; &#x43D;&#x430;&#x43C; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x43A;&#x43E;&#x440;&#x43E;&#x442;&#x43A;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;.</p>
<p><strong>&#x413;&#x43B;&#x430;&#x432;&#x430; 6: &#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;</strong> &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x441; &#x432; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x446;&#x456;&#x44E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x2014; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;. &#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x2014; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x439; &#x442;&#x438;&#x43F;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435;&#x44F;&#x432;&#x43D;&#x438;&#x445; (&#x430;&#x43B;&#x435; &#x43D;&#x435; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445;) &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x442;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;.</p>
<p><strong>&#x413;&#x43B;&#x430;&#x432;&#x430; 7: Sets &#x442;&#x430; Maps</strong> &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43F;&#x440;&#x43E; &#x442;&#x43E;&#x43D;&#x43A;&#x43E;&#x449;&#x456; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x43D;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439;: <code>Set</code>, <code>WeakSet</code>, <code>Map</code>, &#x442;&#x430; <code>WeakMap</code>. &#x426;&#x456; &#x442;&#x438;&#x43F;&#x438; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x44E;&#x44E;&#x442;&#x44C; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x447;&#x438; &#x441;&#x435;&#x43C;&#x430;&#x43D;&#x442;&#x438;&#x43A;&#x443;, &#x434;&#x435;&#x434;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44E; &#x442;&#x430; &#x43A;&#x435;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x442;&#x44E;, &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x443; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; JavaScript.</p>
<p><strong>&#x413;&#x43B;&#x430;&#x432;&#x430; 8: &#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x442;&#x430; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;</strong> &#x43F;&#x43E;&#x44F;&#x441;&#x43D;&#x44E;&#x454; &#x44F;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x43C;&#x438;, &#x449;&#x43E; &#x434;&#x430;&#x44E;&#x442;&#x44C; &#x43D;&#x430;&#x43C; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43E;&#x43F;&#x435;&#x440;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x44F;&#x43C;&#x438; &#x434;&#x430;&#x43D;&#x43D;&#x438;&#x445; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C;, &#x44F;&#x43A;&#x438;&#x439; &#x431;&#x443;&#x432; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x443; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x445; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F;&#x445; JavaScript.</p>
<p><strong>&#x413;&#x43B;&#x430;&#x432;&#x430; 9: &#x41A;&#x43B;&#x430;&#x441;&#x438;</strong> &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x443; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x443; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x446;&#x456;&#x44E; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x443; JavaScript. &#x426;&#x435; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43B;&#x43E; &#x43F;&#x43B;&#x443;&#x442;&#x430;&#x43D;&#x438;&#x43D;&#x443; &#x443; &#x442;&#x438;&#x445;, &#x445;&#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434;&#x438;&#x432; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x412;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x443; JavaScript &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x43C;&#x43E;&#x432;&#x443; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x44E; &#x434;&#x43B;&#x44F; &#x43D;&#x43E;&#x432;&#x430;&#x447;&#x43A;&#x456;&#x432; &#x442;&#x430; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x432;&#x438;&#x440;&#x430;&#x437;&#x43D;&#x43E;&#x44E; &#x434;&#x43B;&#x44F; &#x435;&#x43D;&#x442;&#x443;&#x437;&#x456;&#x430;&#x441;&#x442;&#x456;&#x432;.</p>
<p><strong>&#x413;&#x43B;&#x430;&#x432;&#x430; 10: &#x41C;&#x430;&#x441;&#x438;&#x432;&#x438;</strong> &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43F;&#x440;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x438;, &#x44F;&#x43A;&#x456; &#x441;&#x442;&#x43E;&#x441;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x442;&#x430; &#x43D;&#x43E;&#x432;&#x456; &#x448;&#x43B;&#x44F;&#x445;&#x438; &#x457;&#x445; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x443; JavaScript.</p>
<p><strong>&#x413;&#x43B;&#x430;&#x432;&#x430; 11: &#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438;</strong> &#x43F;&#x43E;&#x44F;&#x441;&#x43D;&#x44E;&#x454; &#x43F;&#x440;&#x43E; &#x43D;&#x43E;&#x432;&#x443; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443; &#x43C;&#x43E;&#x432;&#x438; &#x2014; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438;. &#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x456; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x43C;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x43D;&#x430;&#x431;&#x443;&#x43B;&#x438; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x430;&#x432;&#x434;&#x44F;&#x43A;&#x438; &#x437;&#x440;&#x443;&#x447;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x442;&#x430; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x456;&#x439; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x446;&#x456; &#x456;&#x43D;&#x448;&#x438;&#x43C;&#x438; &#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x43C;&#x438;. ECMAScript 6 &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x442;&#x430; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x457;&#x445; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;.</p>
<p><strong>&#x413;&#x43B;&#x430;&#x432;&#x430; 12: &#x41F;&#x440;&#x43E;&#x43A;&#x441;&#x456; &#x442;&#x430; &#x420;&#x435;&#x444;&#x43B;&#x435;&#x43A;&#x441;&#x456;&#x44F;</strong> &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x435; API &#x440;&#x435;&#x444;&#x43B;&#x435;&#x43A;&#x441;&#x456;&#x457; &#x442;&#x430; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43F;&#x440;&#x43E;&#x43A;&#x441;&#x456;, &#x449;&#x43E; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x43D;&#x430;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x43F;&#x43B;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x436;&#x43D;&#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44E;, &#x44F;&#x43A;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x430; &#x43D;&#x430;&#x434; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C;. &#x41F;&#x440;&#x43E;&#x43A;&#x441;&#x456; &#x434;&#x430;&#x44E;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C; &#x431;&#x435;&#x437;&#x43F;&#x440;&#x435;&#x446;&#x435;&#x434;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x44C; &#x43D;&#x430;&#x434; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438;, &#x44F;&#x43A; &#x43E;&#x442; &#x43D;&#x435;&#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x43E;&#x432;&#x438;&#x445; &#x43F;&#x430;&#x442;&#x435;&#x440;&#x43D;&#x456;&#x432; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x434;&#x456;&#x457;.</p>
<p><strong>&#x413;&#x43B;&#x430;&#x432;&#x430; 13: &#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x456;</strong> &#x43E;&#x43F;&#x438;&#x441;&#x443;&#x454; &#x43E;&#x444;&#x456;&#x446;&#x456;&#x439;&#x43D;&#x438;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x434;&#x43B;&#x44F; JavaScript. &#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x43F;&#x43E;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x456; &#x441;&#x442;&#x430;&#x442;&#x438; &#x454;&#x434;&#x438;&#x43D;&#x43E;&#x44E; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x43E;&#x44E; &#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x430;&#x43C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;, &#x449;&#x43E; &#x432;&#x438;&#x43D;&#x438;&#x43A;&#x43B;&#x438; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456;&#x43C;&#x438; &#x440;&#x43E;&#x43A;&#x430;&#x43C;&#x438;.</p>
<h2 id="&#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x430;-&#x442;&#x430;-&#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x430;">&#x414;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x430; &#x442;&#x430; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x430;</h2>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x43F;&#x43E;&#x440;&#x430;&#x434;&#x438;&#x442;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x442;&#x430; &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x442;&#x438; pull requests &#x434;&#x43E; &#x446;&#x456;&#x454;&#x457; &#x43A;&#x43D;&#x438;&#x433;&#x438; &#x437;&#x430;&#x432;&#x456;&#x442;&#x430;&#x432;&#x448;&#x438; &#x441;&#x44E;&#x434;&#x438;:</p>
<ul>
<li><a href="https://github.com/denysdovhan/understandinges6ua" target="_blank">https://github.com/denysdovhan/understandinges6ua</a> (&#x41F;&#x435;&#x440;&#x435;&#x43A;&#x43B;&#x430;&#x434;)</li>
<li><a href="https://github.com/nzakas/understandinges6" target="_blank">https://github.com/nzakas/understandinges6</a> (&#x41E;&#x440;&#x438;&#x433;&#x456;&#x43D;&#x430;&#x43B;)</li>
</ul>
<p>&#x421;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x44C;-&#x447;&#x43E;&#x433;&#x43E; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E;, &#x431;&#x443;&#x434;&#x44C;-&#x43B;&#x430;&#x441;&#x43A;&#x430; &#x43D;&#x430;&#x434;&#x441;&#x438;&#x43B;&#x430;&#x439;&#x442;&#x435; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x44E;&#x434;&#x438;: <a href="http://groups.google.com/group/zakasbooks" target="_blank">http://groups.google.com/group/zakasbooks</a>.</p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="../index.html" class="navigation navigation-prev " aria-label="Previous page: Рoзуміння ECMAScript 6"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="../manuscript/01-Block-Bindings.html" class="navigation navigation-next " aria-label="Next page: Блочне зв’язування"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="../gitbook/app.js"></script>

    
    <script src="../gitbook/plugins/gitbook-plugin-edit-link/plugin.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-github/plugin.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-yametrika/plugin.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-ga/plugin.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-rss/plugin.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"edit-link":{"base":"https://github.com/denysdovhan/understandinges6ua/tree/master","label":"Редагувати"},"github":{"url":"https://github.com/denysdovhan/understandinges6ua"},"yametrika":{"number":"34703815"},"ga":{"token":"UA-40496885-6","configuration":"auto"},"rss":{"title":"Рoзуміння ECMAScript 6","description":"Український переклад книги «Understanding ES6».","author":"Denys Dovhan and Terry Sahaidak","site_url":"http://understandinges6.denysdovhan.com/","feed_url":"http://understandinges6.denysdovhan.com/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)","categories":["frontend","js","javascript","es6","es2015","ecmascript"]},"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        <script type='text/javascript'>(function (d, w, c) { (w[c] = w[c] || []).push(function() { try { w.yaCounter34703815 = new Ya.Metrika({id:34703815}); } catch(e) { } }); var n = d.getElementsByTagName('script')[0], s = d.createElement('script'), f = function () { n.parentNode.insertBefore(s, n); }; s.type = 'text/javascript'; s.async = true; s.src = (d.location.protocol == 'https:' ? 'https:' : 'http:') + '//mc.yandex.ru/metrika/watch.js'; if (w.opera == '[object Opera]') { d.addEventListener('DOMContentLoaded', f, false); } else { f(); } })(document, window, 'yandex_metrika_callbacks');</script><noscript><div><img src='//mc.yandex.ru/watch/34703815' style='position:absolute; left:-9999px;' alt=''/></div></noscript>
    </body>
    
</html>
