
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Глава 1: Блочне зв’язування · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="02-Strings-and-Regular-Expressions.html" />
    
    
    <link rel="prev" href="00-Introduction.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"LambdaBooks/understandinges6ua","types":["star"],"size":"small"};
    </script>

    <link href="http://understandinges6.denysdovhan.com/rss.xml" title="Рoзуміння ECMAScript 6" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Рoзуміння ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="01-Block-Bindings.html">
            
                <a href="01-Block-Bindings.html">
            
                    
                    Глава 1: Блочне зв’язування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02-Strings-and-Regular-Expressions.html">
            
                <a href="02-Strings-and-Regular-Expressions.html">
            
                    
                    Глава 2: Рядки та регулярні вирази
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03-Functions.html">
            
                <a href="03-Functions.html">
            
                    
                    Глава 3: Функції
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="04-Objects.html">
            
                <a href="04-Objects.html">
            
                    
                    Глава 4: Розширена функціональність об’єктів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="05-Destructuring.html">
            
                <a href="05-Destructuring.html">
            
                    
                    Глава 5: Деструктурування для легшого доступу до даних
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="06-Symbols.html">
            
                <a href="06-Symbols.html">
            
                    
                    Глава 6: Символи та їх властивості
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="07-Sets-And-Maps.html">
            
                <a href="07-Sets-And-Maps.html">
            
                    
                    Глава 7: Множини та мапи
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="08-Iterators-And-Generators.html">
            
                <a href="08-Iterators-And-Generators.html">
            
                    
                    Глава 8: Ітератори та генератори
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="09-Classes.html">
            
                <a href="09-Classes.html">
            
                    
                    Глава 9: Знайомство з класами у JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10-Arrays.html">
            
                <a href="10-Arrays.html">
            
                    
                    Глава 10: Покращені можливості масивів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11-Promises.html">
            
                <a href="11-Promises.html">
            
                    
                    Глава 11: Проміси та асинхронне програмування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12-Proxies-and-Reflection.html">
            
                <a href="12-Proxies-and-Reflection.html">
            
                    
                    Глава 12: Проксі та АРІ рефлексії
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13-Modules.html">
            
                <a href="13-Modules.html">
            
                    
                    Глава 13: Інкапсуляція коду через модулі
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="A-Other-Changes.html">
            
                <a href="A-Other-Changes.html">
            
                    
                    Додаток А: Дрібніші зміни у ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="B-ECMAScript-7.html">
            
                <a href="B-ECMAScript-7.html">
            
                    
                    Додаток Б: Розуміння ECMAScript 7 (2016)
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Глава 1: Блочне зв’язування</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x435;-&#x437;&#x432;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;">&#x411;&#x43B;&#x43E;&#x447;&#x43D;&#x435; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</h1>
<p>&#x422;&#x430;&#x43A; &#x441;&#x43A;&#x43B;&#x430;&#x43B;&#x43E;&#x441;&#x44C;, &#x449;&#x43E; &#x43E;&#x434;&#x43D;&#x430; &#x456;&#x437; &#x43D;&#x430;&#x439;&#x445;&#x438;&#x442;&#x440;&#x456;&#x448;&#x438;&#x445; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; JavaScript &#x2014; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431;, &#x44F;&#x43A;&#x438;&#x43C; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;. &#x423; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x441;&#x442;&#x456; &#x421;-&#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x438;&#x445; &#x43C;&#x43E;&#x432; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; (&#x430;&#x431;&#x43E; &#x457;&#x445; <em>&#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</em>) &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43C;, &#x434;&#x435; &#x457;&#x445; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x443;&#x44E;&#x442;&#x44C;. &#x41F;&#x440;&#x43E;&#x442;&#x435; &#x432; JavaScript &#x446;&#x435; &#x43D;&#x435; &#x437;&#x43E;&#x432;&#x441;&#x456;&#x43C; &#x442;&#x430;&#x43A;. &#x41C;&#x456;&#x441;&#x446;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x430;&#x448;&#x438;&#x445; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x438;&#x442;&#x44C; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x432;&#x438; &#x457;&#x445; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x441;&#x438;&#x43B;&#x438; &#x456; ECMAScript 6 &#x43D;&#x430;&#x434;&#x430;&#x454; &#x432;&#x430;&#x43C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;. &#x426;&#x44F; &#x433;&#x43B;&#x430;&#x432;&#x430; &#x456;&#x43B;&#x44E;&#x441;&#x442;&#x440;&#x443;&#x454; &#x447;&#x43E;&#x43C;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x438;&#x447;&#x43D;&#x435; <code>var</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x430;&#x43F;&#x43B;&#x443;&#x442;&#x430;&#x442;&#x438;, &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x435; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432; ECMAScript 6, &#x430; &#x442;&#x43E;&#x434;&#x456; &#x43F;&#x440;&#x43E;&#x43F;&#x43E;&#x43D;&#x443;&#x454; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x430;&#x446;&#x456;&#x457; &#x434;&#x43B;&#x44F; &#x457;&#x445; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;.</p>
<h2 id="var-&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;-&#x442;&#x430;-&#x432;&#x438;&#x440;&#x438;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;">var-&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x432;&#x438;&#x440;&#x438;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;</h2>
<p>&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>var</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;, &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x456;&#x449;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43E;&#x43A; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; (&#x430;&#x431;&#x43E; &#x432; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;, &#x44F;&#x43A;&#x449;&#x43E; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x431;&#x443;&#x43B;&#x43E;&#x441;&#x44C; &#x43F;&#x43E;&#x437;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E;) &#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x434;&#x435; &#x432;&#x43E;&#x43D;&#x43E; &#x432;&#x456;&#x434;&#x431;&#x443;&#x43B;&#x43E;&#x441;&#x44C; &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x2014; &#x446;&#x435; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <em>&#x432;&#x438;&#x440;&#x438;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;</em>. &#x429;&#x43E;&#x431; &#x43F;&#x440;&#x43E;&#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x432;&#x430;&#x442;&#x438; &#x446;&#x44E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435;&#x43C;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">getValue</span>(<span class="hljs-params">condition</span>) </span>{

    <span class="hljs-keyword">if</span> (condition) {
        <span class="hljs-keyword">var</span> value = <span class="hljs-string">&quot;blue&quot;</span>;

        <span class="hljs-comment">// &#x456;&#x43D;&#x448;&#x438;&#x439; &#x43A;&#x43E;&#x434;</span>

        <span class="hljs-keyword">return</span> value;
    } <span class="hljs-keyword">else</span> {

        <span class="hljs-comment">// &#x442;&#x443;&#x442; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; value &#x431;&#x443;&#x434;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; undefined</span>

        <span class="hljs-keyword">return</span> <span class="hljs-literal">null</span>;
    }

    <span class="hljs-comment">// &#x442;&#x443;&#x442; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; value &#x431;&#x443;&#x434;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; undefined</span>
}
</code></pre>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x437;&#x43D;&#x430;&#x439;&#x43E;&#x43C;&#x456; &#x437; JavaScript, &#x441;&#x43A;&#x43E;&#x440;&#x456;&#x448; &#x437;&#x430; &#x432;&#x441;&#x435; &#x432;&#x438; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x435;, &#x449;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>value</code> &#x431;&#x443;&#x434;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x430; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; <code>condition</code> &#x431;&#x443;&#x434;&#x435; &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; true. &#x41D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; <code>value</code> &#x431;&#x443;&#x434;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x430; &#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x446;&#x44C;&#x43E;&#x433;&#x43E;. &#x41F;&#x456;&#x434; &#x43A;&#x430;&#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x440;&#x443;&#x448;&#x456;&#x439; JavaScript &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; <code>getValue</code> &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x430; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">getValue</span>(<span class="hljs-params">condition</span>) </span>{

    <span class="hljs-keyword">var</span> value;

    <span class="hljs-keyword">if</span> (condition) {
        value = <span class="hljs-string">&quot;blue&quot;</span>;

        <span class="hljs-comment">// &#x456;&#x43D;&#x448;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x442;&#x443;&#x442;</span>

        <span class="hljs-keyword">return</span> value;
    } <span class="hljs-keyword">else</span> {

        <span class="hljs-keyword">return</span> <span class="hljs-literal">null</span>;
    }
}
</code></pre>
<p>&#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>value</code> &#x432;&#x438;&#x440;&#x438;&#x43D;&#x430;&#x454; &#x432;&#x433;&#x43E;&#x440;&#x456; &#x431;&#x43B;&#x43E;&#x43A;&#x443; &#x456; &#x432; &#x442;&#x43E;&#x43C;&#x443; &#x436; &#x43C;&#x456;&#x441;&#x446;&#x456; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44F;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>value</code> &#x432;&#x441;&#x435; &#x449;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x432; &#x431;&#x43B;&#x43E;&#x446;&#x456; <code>else</code>. &#x41F;&#x440;&#x43E;&#x442;&#x435;, &#x44F;&#x43A;&#x449;&#x43E; &#x437;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x43E; &#x43D;&#x435;&#x457;, &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x454;&#x43C;&#x43E; <code>undefined</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x430; &#x449;&#x435; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x430;.</p>
<p>&#x427;&#x430;&#x441;&#x442;&#x43E; &#x43D;&#x43E;&#x432;&#x430;&#x447;&#x43A;&#x430;&#x43C; &#x443; JavaScript &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x446;&#x456; &#x432;&#x430;&#x436;&#x43A;&#x43E; &#x437;&#x432;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E; &#x44F;&#x43A; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;, &#x456; &#x43D;&#x435;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x446;&#x456;&#x454;&#x457; &#x43D;&#x435;&#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x43E;&#x457; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x438; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x438; &#x434;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;. &#x417; &#x446;&#x456;&#x454;&#x457; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x438;, ECMAScript 6 &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x443; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;, &#x449;&#x43E;&#x431; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x438;&#x442;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x433;&#x43D;&#x443;&#x447;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x44C; &#x43D;&#x430;&#x434; &#x436;&#x438;&#x442;&#x442;&#x454;&#x432;&#x438;&#x43C; &#x446;&#x438;&#x43A;&#x43B;&#x43E;&#x43C; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;.</p>
<h2 id="&#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x435;-&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;">&#x411;&#x43B;&#x43E;&#x447;&#x43D;&#x435; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</h2>
<p>&#x411;&#x43B;&#x43E;&#x447;&#x43D;&#x438;&#x43C; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x44C; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; &#x43D;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x43F;&#x43E;&#x437;&#x430; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x44E; &#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x43E;&#x44E; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44E; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;. &#x411;&#x43B;&#x43E;&#x447;&#x43D;&#x430; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x438;&#x43D;&#x438;&#x43A;&#x430;&#x454;:</p>
<ol>
<li>&#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;;</li>
<li>&#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x431;&#x43B;&#x43E;&#x43A;&#x456;&#x432; (&#x43C;&#x456;&#x436; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438; <code>{</code> &#x442;&#x430; <code>}</code> ).</li>
</ol>
<p>&#x411;&#x430;&#x433;&#x430;&#x442;&#x43E; C-&#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x438;&#x445; &#x43C;&#x43E;&#x432; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x437;&#x430; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F;&#x43E;&#x43C; &#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x43E;&#x457; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x457;&#x457; &#x432; ECMAScript 6 &#x43D;&#x430;&#x434;&#x430;&#x454; &#x442;&#x430;&#x43A;&#x443; &#x436; &#x433;&#x43D;&#x443;&#x447;&#x43A;&#x456;&#x441;&#x442;&#x44C; (&#x456; &#x43E;&#x434;&#x43D;&#x43E;&#x440;&#x456;&#x434;&#x43D;&#x456;&#x441;&#x442;&#x44C;) &#x432; JavaScript.</p>
<h3 id="let-&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;">Let-&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</h3>
<p>&#x421;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; <code>let</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x456;&#x447;&#x438;&#x43C; &#x43D;&#x435; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; <code>var</code>. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; <code>var</code> &#x43D;&#x430; <code>let</code>, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x442;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x432;&#x438; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x438;&#x442;&#x435; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x431;&#x43B;&#x43E;&#x43A;&#x43E;&#x43C;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x430; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x430; (&#x43A;&#x440;&#x456;&#x43C; &#x442;&#x43E;&#x433;&#x43E; &#x454; &#x449;&#x435; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x445; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x43F;&#x440;&#x43E; &#x44F;&#x43A;&#x456; &#x43C;&#x438; &#x43F;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x43C;&#x43E; &#x437;&#x433;&#x43E;&#x434;&#x43E;&#x43C;). &#x422;&#x430;&#x43A; &#x44F;&#x43A; &#x437; <code>let</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x43F;&#x43E;&#x437;&#x430; &#x431;&#x43B;&#x43E;&#x43A;&#x43E;&#x43C;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x430; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x430;, &#x432;&#x430;&#x43C; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x437;&#x434;&#x456;&#x439;&#x441;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; <code>let</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x431;&#x43B;&#x43E;&#x43A;&#x443;, &#x449;&#x43E;&#x431; &#x432;&#x43E;&#x43D;&#x430; &#x431;&#x443;&#x43B;&#x430; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x443; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x456;&#x445; &#x431;&#x43B;&#x43E;&#x43A;&#x430;&#x445;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">getValue</span>(<span class="hljs-params">condition</span>) </span>{

    <span class="hljs-keyword">if</span> (condition) {
        <span class="hljs-keyword">let</span> value = <span class="hljs-string">&quot;blue&quot;</span>;

        <span class="hljs-comment">// &#x456;&#x43D;&#x448;&#x438;&#x439; &#x43A;&#x43E;&#x434;</span>

        <span class="hljs-keyword">return</span> value;
    } <span class="hljs-keyword">else</span> {

        <span class="hljs-comment">// value doesn&apos;t exist here</span>

        <span class="hljs-keyword">return</span> <span class="hljs-literal">null</span>;
    }

    <span class="hljs-comment">// value doesn&apos;t exist here</span>
}
</code></pre>
<p>&#x41F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x446;&#x456;&#x454;&#x457; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; <code>getValue</code> &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x441;&#x445;&#x43E;&#x436;&#x430; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x438; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x435; &#x432;&#x456;&#x434; &#x456;&#x43D;&#x448;&#x438;&#x445; C-&#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x438;&#x445; &#x43C;&#x43E;&#x432; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>value</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x430;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>let</code>, &#x430; &#x43D;&#x435; <code>var</code>, &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x432;&#x438;&#x440;&#x438;&#x43D;&#x430;&#x454; &#x43D;&#x430; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>value</code> &#x431;&#x443;&#x434;&#x435; &#x437;&#x43D;&#x438;&#x449;&#x435;&#x43D;&#x430; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x43B;&#x43E;&#x43A; <code>if</code>. &#x42F;&#x43A;&#x449;&#x43E; &#x436; <code>condition</code> &#x431;&#x443;&#x434;&#x435; false, <code>value</code> &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x430; &#x430;&#x431;&#x43E; &#x43F;&#x440;&#x43E;&#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x430;.</p>
<h3 id="&#x436;&#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E;-&#x43F;&#x435;&#x440;&#x435;&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;">&#x416;&#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;</h3>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x432;&#x436;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x432; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;, &#x442;&#x43E; <code>let</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x446;&#x435;&#x439; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;, &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;. &#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> count = <span class="hljs-number">30</span>;

<span class="hljs-comment">// &#x41F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443;</span>
<span class="hljs-keyword">let</span> count = <span class="hljs-number">40</span>;
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; <code>count</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x430; &#x434;&#x432;&#x456;&#x447;&#x456;: &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x443; &#x456;&#x437; <code>var</code>, &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x2014; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>let</code>. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>let</code> &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x438;, &#x44F;&#x43A;&#x456; &#x432;&#x436;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456; &#x432; &#x434;&#x430;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;, &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;. &#x41D;&#x430;&#x442;&#x43E;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43D;&#x456;&#x44F;&#x43A;&#x43E;&#x457; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;, &#x44F;&#x43A;&#x449;&#x43E; <code>let</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x456;&#x43C;&#x2019;&#x44F;&#x43C;, &#x44F;&#x43A; &#x456; &#x432; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;, &#x44F;&#x43A;&#x430; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;, &#x44F;&#x43A;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x439; &#x456;&#x43B;&#x44E;&#x441;&#x442;&#x440;&#x443;&#x454; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;:  </p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> count = <span class="hljs-number">30</span>;

<span class="hljs-comment">// &#x41D;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;</span>
<span class="hljs-keyword">if</span> (condition) {

    <span class="hljs-keyword">let</span> count = <span class="hljs-number">40</span>;

    <span class="hljs-comment">// &#x449;&#x435; &#x44F;&#x43A;&#x438;&#x439;&#x441;&#x44C; &#x43A;&#x43E;&#x434;</span>
}
</code></pre>
<p>&#x426;&#x435; <code>let</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; <code>count</code> &#x43B;&#x438;&#x448;&#x435; &#x443; <code>if</code> &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;, &#x430; &#x43D;&#x435; &#x432; &#x43D;&#x430;&#x432;&#x43A;&#x43E;&#x43B;&#x438;&#x448;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x431;&#x43B;&#x43E;&#x446;&#x456;. &#x412; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; <code>if</code> &#x431;&#x43B;&#x43E;&#x43A;&#x443; &#x43D;&#x43E;&#x432;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x454; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x443; <code>count</code>, &#x437;&#x430;&#x43F;&#x43E;&#x431;&#x456;&#x433;&#x430;&#x44E;&#x447;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x434;&#x43E; &#x43D;&#x435;&#x457;, &#x434;&#x43E;&#x43F;&#x43E;&#x43A;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x43F;&#x43E;&#x43A;&#x438;&#x43D;&#x435; &#x431;&#x43B;&#x43E;&#x43A;.</p>
<h3 id="const-&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;">const-&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</h3>
<p>&#x406;&#x43D;&#x448;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x432; ECMAScript 6 &#x2014; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; <code>const</code>. &#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x456;, &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>const</code>, &#x432;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; <em>&#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442;&#x430;&#x43C;&#x438;</em>, &#x442;&#x43E;&#x431;&#x442;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x435;&#x43D;&#x456; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;&#x43C; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x422;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x436;&#x43D;&#x430; <code>const</code> &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x430; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x456; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x430; &#x442;&#x430;&#x43A;, &#x44F;&#x43A; &#x446;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x432; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x41F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x430; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442;&#x430;</span>
<span class="hljs-keyword">const</span> maxItems = <span class="hljs-number">30</span>;

<span class="hljs-comment">// &#x41F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443;: &#x432;&#x456;&#x434;&#x441;&#x443;&#x442;&#x43D;&#x44F; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44F;</span>
<span class="hljs-keyword">const</span> name;
</code></pre>
<p>&#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>maxItems</code> &#x43F;&#x440;&#x43E;&#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x430;, &#x442;&#x43E;&#x43C;&#x443; <code>const</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x454; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x431;&#x435;&#x437; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;. &#x41D;&#x430;&#x442;&#x43E;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>name</code> &#x441;&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x454;&#x442;&#x435; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;, &#x44F;&#x43A;&#x430; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x430; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x430;.</p>
<h4 id="const-&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;-&#x43F;&#x440;&#x43E;&#x442;&#x438;-let-&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;">const-&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x442;&#x438; let-&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</h4>
<p>&#x41E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442;&#x438;, &#x442;&#x430;&#x43A; &#x44F;&#x43A; &#x456; <code>let</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x454; &#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x438;&#x43C;&#x438; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x437;&#x43D;&#x438;&#x449;&#x435;&#x43D;&#x43D;&#x456; &#x432;&#x456;&#x434;&#x440;&#x430;&#x437;&#x443; &#x436;, &#x44F;&#x43A; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x43A;&#x438;&#x43D;&#x435; &#x431;&#x43B;&#x43E;&#x43A;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x456;, &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x440;&#x438;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x456; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x432; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">if</span> (condition) {
    <span class="hljs-keyword">const</span> maxItems = <span class="hljs-number">5</span>;

    <span class="hljs-comment">// &#x449;&#x435; &#x44F;&#x43A;&#x438;&#x439;&#x441;&#x44C; &#x43A;&#x43E;&#x434;</span>
}

<span class="hljs-comment">// maxItems &#x442;&#x443;&#x442; &#x43D;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x44F;</span>
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442;&#x430; <code>maxItems</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x430; &#x432; <code>if</code> &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;. &#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x438;&#x442;&#x44C;&#x441;&#x44F;, <code>maxItems</code> &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x430; &#x456; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x43F;&#x43E;&#x437;&#x430; &#x431;&#x43B;&#x43E;&#x43A;&#x43E;&#x43C;.</p>
<p>&#x406;&#x43D;&#x448;&#x430; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x456;&#x441;&#x442;&#x44C; <code>let</code> &#x442;&#x430; <code>const</code> &#x2014; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;, &#x44F;&#x43A;&#x430; &#x432;&#x436;&#x435; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x430; &#x432; &#x446;&#x456;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;. &#x406; &#x43D;&#x435; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x447;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; &#x431;&#x443;&#x43B;&#x430; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>var</code> (&#x434;&#x43B;&#x44F; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x430;&#x431;&#x43E; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x43D;&#x430; &#x440;&#x456;&#x432;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;) &#x447;&#x438; <code>let</code> (&#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x43D;&#x430; &#x440;&#x456;&#x432;&#x43D;&#x456; &#x431;&#x43B;&#x43E;&#x43A;&#x443;). &#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435;&#x43C;&#x43E; &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> message = <span class="hljs-string">&quot;Hello!&quot;</span>;
<span class="hljs-keyword">let</span> age = <span class="hljs-number">25</span>;

<span class="hljs-comment">// &#x41E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x457; &#x456;&#x437; &#x446;&#x438;&#x445; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;</span>
<span class="hljs-keyword">const</span> message = <span class="hljs-string">&quot;Goodbye!&quot;</span>;
<span class="hljs-keyword">const</span> age = <span class="hljs-number">30</span>;
</code></pre>
<p>&#x41A;&#x43E;&#x436;&#x43D;&#x435; &#x456;&#x437; <code>const</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x44C; &#x431;&#x443;&#x434;&#x435; &#x432;&#x430;&#x43B;&#x456;&#x434;&#x43D;&#x438;&#x43C;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x440;&#x430;&#x445;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456; <code>var</code> &#x442;&#x430; <code>let</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;, &#x436;&#x43E;&#x434;&#x43D;&#x435; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x442;&#x430;&#x43A;, &#x44F;&#x43A; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x430;&#x43B;&#x43E;&#x441;&#x44C;.</p>
<p>&#x41D;&#x435;&#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x446;&#x456; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E;&#x441;&#x442;&#x456;, &#x454; &#x43E;&#x434;&#x43D;&#x430; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x456;&#x436; <code>let</code> &#x442;&#x430; <code>const</code>, &#x44F;&#x43A;&#x443; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x430;&#x442;&#x438;. &#x421;&#x43F;&#x440;&#x43E;&#x431;&#x430; &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; <code>const</code>-&#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; &#x456;&#x43D;&#x448;&#x456;&#x439; &#x432;&#x436;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456;&#x439; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x44F;&#x43A; &#x432; strict, &#x442;&#x430;&#x43A; &#x456; &#x432; non-strict &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;.</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> maxItems = <span class="hljs-number">5</span>;

maxItems = <span class="hljs-number">6</span>;      <span class="hljs-comment">// &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;</span>
</code></pre>
<p>&#x422;&#x430;&#x43A; &#x44F;&#x43A; &#x456; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442;&#x438; &#x432; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432;&#x430;&#x445;, &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; <code>maxItems</code> &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x456;&#x437;&#x43D;&#x456;&#x448;&#x435;. &#x41F;&#x440;&#x43E;&#x442;&#x435;, &#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442; &#x432; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432;&#x430;&#x445;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x434;&#x43E;&#x437;&#x43C;&#x456;&#x43D;&#x435;&#x43D;&#x435;, &#x44F;&#x43A;&#x449;&#x43E; &#x446;&#x435; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;.</p>
<h4 id="&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x456;&#x432;-&#x437;-const">&#x41E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x437; const</h4>
<p>&#x41E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x437; <code>const</code> &#x437;&#x430;&#x43F;&#x43E;&#x431;&#x456;&#x433;&#x430;&#x454; &#x432;&#x438;&#x434;&#x43E;&#x437;&#x43C;&#x456;&#x43D;&#x456; &#x437;&#x432;&apos;&#x44F;&#x437;&#x43A;&#x443;, &#x430; &#x43D;&#x435; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; <code>const</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x43D;&#x435; &#x437;&#x430;&#x43F;&#x43E;&#x431;&#x456;&#x433;&#x430;&#x454; &#x457;&#x445; &#x43C;&#x43E;&#x434;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">const</span> person = {
    name: <span class="hljs-string">&quot;Nicholas&quot;</span>
};

<span class="hljs-comment">// &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;</span>
person.name = <span class="hljs-string">&quot;Greg&quot;</span>;

<span class="hljs-comment">// &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;</span>
person = {
    name: <span class="hljs-string">&quot;Greg&quot;</span>
};
</code></pre>
<p>&#x422;&#x443;&#x442; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; <code>person</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x430; &#x456;&#x437; &#x43E;&#x434;&#x43D;&#x456;&#x454;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E;. &#x417;&#x43C;&#x456;&#x43D;&#x430; <code>person.name</code> &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>person</code>, &#x430; &#x43D;&#x435; &#x442;&#x435;, &#x43D;&#x430; &#x449;&#x43E; <code>person</code> &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;. &#x41A;&#x43E;&#x43B;&#x438; &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x454; &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; (&#x43D;&#x430;&#x43C;&#x430;&#x433;&#x430;&#x44E;&#x447;&#x438;&#x441;&#x44C; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;), &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;. &#x414;&#x443;&#x436;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x430;&#x43F;&#x43B;&#x443;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x432; &#x442;&#x43E;&#x43D;&#x43A;&#x43E;&#x449;&#x430;&#x445; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; <code>const</code> &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x456;&#x437; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438;. &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x430;&#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x430;&#x439;&#x442;&#x435;: <code>const</code> &#x437;&#x430;&#x43F;&#x43E;&#x431;&#x456;&#x433;&#x430;&#x454; &#x432;&#x438;&#x434;&#x43E;&#x437;&#x43C;&#x456;&#x43D;&#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;, &#x430; &#x43D;&#x435; &#x439;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>W&gt; &#x412; &#x434;&#x435;&#x44F;&#x43A;&#x438;&#x445; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44F;  &#x43F;&#x435;&#x440;&#x435;&#x434; ECMAScript 6 &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F; <code>const</code>, &#x442;&#x43E;&#x43C;&#x443; &#x437;&#x432;&#x430;&#x436;&#x430;&#x439;&#x442;&#x435; &#x43D;&#x430; &#x446;&#x435;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x446;&#x435;&#x439; &#x432;&#x438;&#x434; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x420;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x432;&#x430;&#x440;&#x456;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43D;&#x43E;&#x43D;&#x456;&#x43C;&#x443; <code>var</code> (&#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x447;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;), &#x434;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442; &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456;, &#x430;&#x43B;&#x435; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x439; &#x442;&#x430; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x440;&#x456;&#x432;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;. &#x422;&#x43E;&#x43C;&#x443; &#x431;&#x443;&#x434;&#x44C;&#x442;&#x435;  &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x43E; &#x43E;&#x431;&#x435;&#x440;&#x435;&#x436;&#x43D;&#x456;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>const</code> &#x432; &#x43F;&#x440;&#x43E;&#x434;&#x430;&#x43A;&#x448;&#x438;&#x43D;&#x456;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456;, &#x44F;&#x43A;&#x443; &#x432;&#x438; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x435;, &#x43C;&#x43E;&#x436;&#x435; &#x43D;&#x435; &#x431;&#x443;&#x442;&#x438;.</p>
<h3 id="&#x442;&#x438;&#x43C;&#x447;&#x430;&#x441;&#x43E;&#x432;&#x430;-&#x43C;&#x435;&#x440;&#x442;&#x432;&#x430;-&#x437;&#x43E;&#x43D;&#x430;">&#x422;&#x438;&#x43C;&#x447;&#x430;&#x441;&#x43E;&#x432;&#x430; &#x43C;&#x435;&#x440;&#x442;&#x432;&#x430; &#x437;&#x43E;&#x43D;&#x430;</h3>
<p>&#x41D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; <code>var</code>, <code>let</code> &#x442;&#x430; <code>const</code> &#x43D;&#x435; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x440;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x43E;&#x457; &#x445;&#x430;&#x440;&#x430;&#x43A;&#x442;&#x435;&#x440;&#x438;&#x441;&#x442;&#x438;&#x43A;&#x438;.  &#x414;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x438;&#x445; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435;, &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x437;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x43E;&#x442;&#x438;, &#x434;&#x43E;&#x43A;&#x438; &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456; &#x437;&#x43D;&#x43E;&#x432;&#x443;.  &#x421;&#x43F;&#x440;&#x43E;&#x431;&#x430; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x446;&#x435; &#x441;&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;, &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x442;&#x430;&#x43A;&#x443; &#x437;&#x432;&#x438;&#x447;&#x43D;&#x443; &#x442;&#x430; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44E; &#x44F;&#x43A; <code>typeof</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">if</span> (condition) {
    <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> value);  <span class="hljs-comment">// &#x41F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;!</span>
    <span class="hljs-keyword">let</span> value = <span class="hljs-string">&quot;blue&quot;</span>;
}
</code></pre>
<p>&#x422;&#x443;&#x442; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>value</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x430; &#x442;&#x430; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x430;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>let</code>, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x438;&#x440;&#x430;&#x437; &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x438;&#x439;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x434;&#x435; &#x434;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;. &#x41F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; <code>value</code> &#x456;&#x441;&#x43D;&#x443;&#x454; &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456;, &#x432;&#x456;&#x434;&#x43E;&#x43C;&#x456;&#x439; JavaScript &#x441;&#x43F;&#x456;&#x43B;&#x44C;&#x43D;&#x43E;&#x442;&#x456; &#x44F;&#x43A; <em>&#x442;&#x438;&#x43C;&#x447;&#x430;&#x441;&#x43E;&#x432;&#x430; &#x43C;&#x435;&#x440;&#x442;&#x432;&#x430; &#x437;&#x43E;&#x43D;&#x430;</em> (&#x422;&#x41C;&#x417;). &#x422;&#x41C;&#x417; &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x437;&#x433;&#x430;&#x434;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x432; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x446;&#x435; &#x442;&#x435;&#x440;&#x43C;&#x456;&#x43D;, &#x44F;&#x43A;&#x438;&#x439; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x432;&#x436;&#x438;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x449;&#x43E;&#x431; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x43D;&#x435;&#x441;&#x43F;&#x43B;&#x438;&#x432;&#x430;&#x44E;&#x447;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; <code>let</code> &#x442;&#x430; <code>const</code>. &#x426;&#x435;&#x439; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;  &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43F;&#x440;&#x43E; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x442;&#x43E;&#x43D;&#x43A;&#x43E;&#x449;&#x456; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x43C;&#x456;&#x441;&#x446;&#x44F;&#x445;, &#x44F;&#x43A;&#x456; &#x454; &#x422;&#x41C;&#x417;, &#x456; &#x445;&#x43E;&#x447;&#x430; &#x432;&#x441;&#x456; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; <code>let</code>, &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435; &#x440;&#x456;&#x432;&#x43D;&#x43E;&#x446;&#x456;&#x43D;&#x43D;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x434;&#x43B;&#x44F; <code>const</code>.</p>
<p>&#x41A;&#x43E;&#x43B;&#x438; JavaScript &#x440;&#x443;&#x448;&#x456;&#x439; &#x43F;&#x435;&#x440;&#x435;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x431;&#x43B;&#x43E;&#x43A;, &#x44F;&#x43A;&#x438;&#x439; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x456; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;, &#x432;&#x456;&#x43D; &#x457;&#x445; &#x430;&#x431;&#x43E; &#x437;&#x43C;&#x443;&#x448;&#x443;&#x454; &#xAB;&#x441;&#x43F;&#x43B;&#x438;&#x432;&#x442;&#x438;&#xBB; (&#x44F;&#x43A;&#x449;&#x43E; &#x446;&#x435; <code>var</code>), &#x430;&#x431;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x456;&#x449;&#x443;&#x454; &#x432; &#x422;&#x41C;&#x417; (&#x44F;&#x43A;&#x449;&#x43E; &#x446;&#x435; <code>let</code> &#x430;&#x431;&#x43E; <code>const</code>). &#x412;&#x441;&#x456; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x438; &#x437;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;, &#x44F;&#x43A;&#x430; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x422;&#x41C;&#x417; &#x441;&#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x43A;&#x443;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;. &#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x430; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x430; &#x437; &#x422;&#x41C;&#x417;, &#x430; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x431;&#x443;&#x434;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x457;&#x457; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x456;&#x439;&#x434;&#x435; &#x434;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;.</p>
<p>&#x426;&#x435; &#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x436;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x43D;&#x430;&#x43C;&#x430;&#x433;&#x430;&#x454;&#x442;&#x435;&#x441;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x443; &#x437; <code>let</code> &#x43F;&#x435;&#x440;&#x448; &#x43D;&#x456;&#x436; &#x432;&#x43E;&#x43D;&#x430; &#x431;&#x443;&#x43B;&#x430; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x430;, &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x437;&#x432;&#x438;&#x447;&#x43D;&#x438;&#x439; &#x456; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>typeof</code>. &#x41F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>typeof</code> &#x437;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x43C;&#x438; &#x43F;&#x43E;&#x437;&#x430; &#x431;&#x43B;&#x43E;&#x43A;&#x43E;&#x43C;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456;, &#x445;&#x43E;&#x447; &#x446;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x43D;&#x435; &#x434;&#x430;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443;. &#x420;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435;&#x43C;&#x43E; &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> value);     <span class="hljs-comment">// &quot;undefined&quot;</span>

<span class="hljs-keyword">if</span> (condition) {
    <span class="hljs-keyword">let</span> value = <span class="hljs-string">&quot;blue&quot;</span>;
}
</code></pre>
<p>&#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>value</code> &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x432; &#x422;&#x41C;&#x417;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>typeof</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x446;&#x435; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x437;&#x430; &#x431;&#x43B;&#x43E;&#x43A;&#x43E;&#x43C; &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; <code>value</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x430;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x449;&#x435; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; <code>value</code>, &#x456; <code>typeof</code> &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>&quot;undefined&quot;</code>.</p>
<p>&#x422;&#x41C;&#x417; &#x2014; &#x432;&#x441;&#x44C;&#x43E;&#x433;&#x43E; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442; &#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x406;&#x43D;&#x448;&#x438;&#x43C; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x43E;&#x43C; &#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x446;&#x438;&#x43A;&#x43B;&#x456;&#x432;.</p>
<h2 id="&#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x435;-&#x437;&#x432;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x432;-&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456;-&#x446;&#x438;&#x43A;&#x43B;&#x456;&#x432;">&#x411;&#x43B;&#x43E;&#x447;&#x43D;&#x435; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x446;&#x438;&#x43A;&#x43B;&#x456;&#x432;</h2>
<p>&#x41C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43E;&#x43A;, &#x43A;&#x43E;&#x43B;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x430; &#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x430; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x43B;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x2014; &#x446;&#x438;&#x43A;&#x43B;&#x438; <code>for</code>, &#x434;&#x435; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; &#x43B;&#x456;&#x447;&#x438;&#x43B;&#x44C;&#x43D;&#x438;&#x43A;&#x430; &#x43C;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x446;&#x438;&#x43A;&#x43B;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x2014; &#x446;&#x456;&#x43B;&#x43A;&#x43E;&#x43C; &#x437;&#x432;&#x438;&#x447;&#x43D;&#x438;&#x439; &#x432; JavaScript:</p>
<pre><code class="lang-js"><span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> i=<span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) {
    process(items[i]);
}

<span class="hljs-comment">// &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; i &#x434;&#x43E;&#x441;&#x456; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430;</span>
<span class="hljs-built_in">console</span>.log(i);                     <span class="hljs-comment">// 10</span>
</code></pre>
<p>&#x412; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432;&#x430;&#x445;, &#x434;&#x435; &#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x430; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x43A;&#x43E;&#x434; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x44F;&#x43A; &#x456; &#x43F;&#x43B;&#x430;&#x43D;&#x443;&#x432;&#x430;&#x43B;&#x43E;&#x441;&#x44C;, &#x456; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x446;&#x438;&#x43A;&#x43B; <code>for</code> &#x43C;&#x430;&#x454; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>i</code>. &#x412; JavaScript &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>i</code> &#x434;&#x43E;&#x441;&#x456; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x446;&#x438;&#x43A;&#x43B; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x438;&#x442;&#x44C;&#x441;&#x44F;, &#x447;&#x435;&#x440;&#x435;&#x437; &#x432;&#x438;&#x440;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438;&#x439; &#x445;&#x430;&#x440;&#x430;&#x43A;&#x442;&#x435;&#x440; <code>var</code>. &#x41D;&#x430;&#x442;&#x43E;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>let</code> &#x44F;&#x43A; &#x432; &#x43A;&#x43E;&#x434;&#x456; &#x43D;&#x430;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43E;&#x43C;&#x443; &#x43D;&#x438;&#x436;&#x447;&#x435;, &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i=<span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) {
    process(items[i]);
}

<span class="hljs-comment">// &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; i &#x442;&#x443;&#x442; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430;, &#x442;&#x43E;&#x43C;&#x443; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;</span>
<span class="hljs-built_in">console</span>.log(i);
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>i</code> &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x446;&#x438;&#x43A;&#x43B;&#x443; <code>for</code>. &#x42F;&#x43A; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x446;&#x438;&#x43A;&#x43B; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x438;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;, &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; &#x431;&#x443;&#x434;&#x435; &#x437;&#x43D;&#x438;&#x449;&#x435;&#x43D;&#x430; &#x442;&#x430; &#x441;&#x442;&#x430;&#x43D;&#x435; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x44E; &#x434;&#x435;&#x456;&#x43D;&#x434;&#x435;.</p>
<h3 id="&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;-&#x432;-&#x446;&#x438;&#x43A;&#x43B;&#x430;&#x445;">&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x432; &#x446;&#x438;&#x43A;&#x43B;&#x430;&#x445;</h3>
<p>&#x422;&#x430;&#x43A; &#x441;&#x43A;&#x43B;&#x430;&#x43B;&#x43E;&#x441;&#x44C;, &#x449;&#x43E; &#x447;&#x435;&#x440;&#x435;&#x437; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>var</code>, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x446;&#x438;&#x43A;&#x43B;&#x456;&#x432; &#x431;&#x443;&#x43B;&#x43E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x43E;&#x44E; &#x447;&#x435;&#x440;&#x435;&#x437; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x43F;&#x43E;&#x437;&#x430; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44E; &#x439;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;. &#x420;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435;&#x43C;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> funcs = [];

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> i=<span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) {
    funcs.push(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{ <span class="hljs-built_in">console</span>.log(i); });
}

funcs.forEach(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">func</span>) </span>{
    func();     <span class="hljs-comment">// &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x447;&#x438;&#x441;&#x43B;&#x43E; &quot;10&quot; &#x434;&#x435;&#x441;&#x44F;&#x442;&#x44C; &#x440;&#x430;&#x437;&#x456;&#x432;</span>
});
</code></pre>
<p>&#x412;&#x438;, &#x43C;&#x430;&#x431;&#x443;&#x442;&#x44C;, &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x435;, &#x449;&#x43E; &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x432;&#x456;&#x434; 0 &#x434;&#x43E; 9, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x456;&#x43D; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x447;&#x438;&#x441;&#x43B;&#x43E; 10 &#x434;&#x435;&#x441;&#x44F;&#x442;&#x44C; &#x440;&#x430;&#x437;&#x456;&#x432; &#x43F;&#x456;&#x434;&#x440;&#x44F;&#x434;. &#x412;&#x441;&#x435; &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>i</code> &#x441;&#x43F;&#x456;&#x43B;&#x44C;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x457; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439; &#x446;&#x438;&#x43A;&#x43B;&#x443;, &#x442;&#x43E;&#x431;&#x442;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x44F;&#x43A;&#x456; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x446;&#x438;&#x43A;&#x43B;&#x443;, &#x431;&#x435;&#x440;&#x443;&#x442;&#x44C; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x442;&#x443; &#x436; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443;. &#x41A;&#x43E;&#x43B;&#x438; &#x446;&#x438;&#x43A;&#x43B; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x438;&#x442;&#x44C;&#x441;&#x44F;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>i</code> &#x431;&#x443;&#x434;&#x435; &#x440;&#x456;&#x432;&#x43D;&#x435; 10, &#x442;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>console.log(i)</code>, &#x446;&#x435; &#x456; &#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;, &#x44F;&#x43A;&#x435; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x443;.</p>
<p>&#x429;&#x43E;&#x431; &#x432;&#x438;&#x440;&#x456;&#x448;&#x438;&#x442;&#x438; &#x446;&#x44E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443;, &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x43D;&#x435;&#x433;&#x430;&#x439;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; (&#x41D;&#x412;&#x424;&#x412;) (immediately-invoked function expression (IIFE)) &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x446;&#x438;&#x43A;&#x43B;&#x456;&#x432;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x43C;&#x443;&#x448;&#x435;&#x43D;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x443; &#x43A;&#x43E;&#x43F;&#x456;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;, &#x44F;&#x43A;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x445;&#x43E;&#x447;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;, &#x442;&#x43E;&#x431;&#x442;&#x43E; &#x44F;&#x43A; &#x432; &#x43A;&#x43E;&#x434;&#x456; &#x43D;&#x438;&#x436;&#x447;&#x435;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> funcs = [];

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> i=<span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) {
    funcs.push((<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
        <span class="hljs-keyword">return</span> <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
            <span class="hljs-built_in">console</span>.log(value);
        }
    }(i)));
}

funcs.forEach(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">func</span>) </span>{
    func();     <span class="hljs-comment">// &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; 0, &#x442;&#x43E;&#x434;&#x456; 1, &#x442;&#x43E;&#x434;&#x456; 2, &#x456; &#x442;&#x430;&#x43A; &#x434;&#x43E; 9</span>
});
</code></pre>
<p>&#x422;&#x443;&#x442;, &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x446;&#x438;&#x43A;&#x43B;&#x443;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x41D;&#x412;&#x424;&#x412;. &#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>i</code> &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x41D;&#x412;&#x424;&#x412;, &#x44F;&#x43A;&#x438;&#x439; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x443; &#x43A;&#x43E;&#x43F;&#x456;&#x44E; &#x456; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x457;&#x457; &#x44F;&#x43A; <code>value</code>. &#x426;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;, &#x44F;&#x43A;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E; &#x434;&#x43B;&#x44F; &#x446;&#x456;&#x454;&#x457; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x44E;&#x447;&#x438; &#x43A;&#x43E;&#x436;&#x43D;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x43C;&#x438; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454;&#x43C;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43B;&#x456;&#x447;&#x438;&#x43B;&#x44C;&#x43D;&#x438;&#x43A;&#x430; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x2014; &#x432;&#x456;&#x434; 0 &#x434;&#x43E; 9. &#x41D;&#x430; &#x449;&#x430;&#x441;&#x442;&#x44F;, &#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x430; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x437; <code>let</code> &#x442;&#x430; <code>const</code> &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x442;&#x438; &#x446;&#x435;&#x439; &#x446;&#x438;&#x43A;&#x43B; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x441;.</p>
<h3 id="let-&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;-&#x432;-&#x446;&#x438;&#x43A;&#x43B;&#x430;&#x445;">let-&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x446;&#x438;&#x43A;&#x43B;&#x430;&#x445;</h3>
<p>&#x422;&#x438;&#x43F; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x437; <code>let</code> &#x441;&#x43F;&#x440;&#x43E;&#x449;&#x443;&#x454; &#x446;&#x438;&#x43A;&#x43B;&#x438;, &#x444;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x447;&#x438; &#x442;&#x435;, &#x449;&#x43E; &#x41D;&#x412;&#x424;&#x412; &#x440;&#x43E;&#x431;&#x438;&#x43B;&#x438; &#x432; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;. &#x41A;&#x43E;&#x436;&#x43D;&#x43E;&#x457; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x446;&#x438;&#x43A;&#x43B; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43D;&#x43E;&#x432;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; &#x442;&#x430; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x454; &#x457;&#x457; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x456;&#x43C;&apos;&#x44F;&#x43C; &#x432; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x439; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x41D;&#x412;&#x424;&#x412; &#x456; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;, &#x44F;&#x43A; &#x446;&#x435;&#x439;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> funcs = [];

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i=<span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) {
    funcs.push(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
        <span class="hljs-built_in">console</span>.log(i);
    });
}

funcs.forEach(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">func</span>) </span>{
    func();     <span class="hljs-comment">// &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; 0, &#x442;&#x43E;&#x434;&#x456; 1, &#x442;&#x43E;&#x434;&#x456; 2, &#x456; &#x442;&#x430;&#x43A; &#x434;&#x43E; 9</span>
})
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x43A;&#x43E;&#x434;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; <code>var</code> &#x442;&#x430; &#x41D;&#x412;&#x424;&#x412;, &#x43F;&#x440;&#x43E;&#x442;&#x435;, &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x432;&#x456;&#x43D; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x438;&#x439;. &#x41E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x456;&#x437; <code>let</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43D;&#x43E;&#x432;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x443; &#x432;&#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436; &#x446;&#x438;&#x43A;&#x43B;&#x443;, &#x442;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x436;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x430; &#x432; &#x446;&#x438;&#x43A;&#x43B;&#x456; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x443; &#x43A;&#x43E;&#x43F;&#x456;&#x44E; <code>i</code>. &#x41A;&#x43E;&#x436;&#x43D;&#x430; &#x43A;&#x43E;&#x43F;&#x456;&#x44F; <code>i</code> &#x43C;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x435; &#x43D;&#x430; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x446;&#x438;&#x43A;&#x43B;&#x443;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x430; &#x431;&#x443;&#x43B;&#x430; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x430;. &#x422;&#x435;&#x436; &#x441;&#x430;&#x43C;&#x435; &#x43F;&#x456;&#x434;&#x456;&#x439;&#x434;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x434;&#x43B;&#x44F; <code>for-in</code> &#x442;&#x430; <code>for-of</code> &#x446;&#x438;&#x43A;&#x43B;&#x456;&#x432;, &#x44F;&#x43A; &#x446;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x442;&#x443;&#x442;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> funcs = [],
    object = {
        a: <span class="hljs-literal">true</span>,
        b: <span class="hljs-literal">true</span>,
        c: <span class="hljs-literal">true</span>
    };

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> key <span class="hljs-keyword">in</span> object) {
    funcs.push(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
        <span class="hljs-built_in">console</span>.log(key);
    });
}

funcs.forEach(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">func</span>) </span>{
    func();     <span class="hljs-comment">// &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &quot;a&quot;, &#x442;&#x43E;&#x434;&#x456; &quot;b&quot; &#x456; &#x442;&#x43E;&#x434;&#x456; &quot;c&quot;</span>
});
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x446;&#x438;&#x43A;&#x43B; <code>for-in</code> &#x432;&#x456;&#x434;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x442;&#x430;&#x43A;&#x443; &#x436; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443;, &#x44F;&#x43A; &#x456; &#x432; &#x446;&#x438;&#x43A;&#x43B; <code>for</code>. &#x41A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x443; &#x432;&#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x43E;&#x432;&#x435; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; <code>key</code>, &#x442;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x436;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43C;&#x430;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x443; &#x43A;&#x43E;&#x43F;&#x456;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>key</code>. &#x42F;&#x43A; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43A;&#x43E;&#x436;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x456;&#x43D;&#x448;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x42F;&#x43A;&#x449;&#x43E; &#x431; &#x43C;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438; <code>var</code> &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>key</code>, &#x43A;&#x43E;&#x436;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x43B;&#x430; &#x431; <code>&quot;c&quot;</code>.</p>
<p>|&gt; &#x412;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; <code>let</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x446;&#x438;&#x43A;&#x43B;&#x430;&#x445; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x430; &#x432; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457;, &#x456; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&apos;&#x44F;&#x437;&#x430;&#x43D;&#x430; &#x437; &#x43D;&#x435;&#x432;&#x438;&#x440;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x43E;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; <code>let</code>. &#x41D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x436; &#x440;&#x430;&#x43D;&#x43D;&#x456; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; <code>let</code> &#x43D;&#x435; &#x43C;&#x430;&#x43B;&#x438; &#x446;&#x456;&#x454;&#x457; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x438; &#x2014; &#x446;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x43E; &#x43F;&#x456;&#x437;&#x43D;&#x456;&#x448;&#x435; &#x432; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x456; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457;.</p>
<h3 id="&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;-&#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442;-&#x432;-&#x446;&#x438;&#x43A;&#x43B;&#x430;&#x445;">&#x41E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442; &#x432; &#x446;&#x438;&#x43A;&#x43B;&#x430;&#x445;</h3>
<p>&#x424;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F; ECMAScript 6 &#x43D;&#x435; &#x437;&#x430;&#x431;&#x43E;&#x440;&#x43E;&#x43D;&#x44F;&#x454; <code>const</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x446;&#x438;&#x43A;&#x43B;&#x430;&#x445;; &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x438;&#x442;&#x44C; &#x432;&#x456;&#x434; &#x446;&#x438;&#x43A;&#x43B;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x435;. &#x414;&#x43B;&#x44F; &#x437;&#x432;&#x438;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x443; <code>for</code> &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>const</code> &#x432; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457;, &#x430;&#x43B;&#x435; &#x446;&#x438;&#x43A;&#x43B; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x436;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x454;&#x442;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> funcs = [];

<span class="hljs-comment">// &#x432;&#x438;&#x432;&#x435;&#x434;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x457; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;</span>

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">const</span> i=<span class="hljs-number">0</span>; i &lt; <span class="hljs-number">10</span>; i++) {
    funcs.push(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
        <span class="hljs-built_in">console</span>.log(i);
    });
}
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>i</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x430; &#x44F;&#x43A; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442;&#x430;. &#x41F;&#x435;&#x440;&#x448;&#x430; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F; &#x446;&#x438;&#x43A;&#x43B;&#x443;, &#x434;&#x435; <code>i</code> &#x440;&#x456;&#x432;&#x43D;&#x435; 0, &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x43E;. &#x41F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; <code>i++</code>, &#x442;&#x430;&#x43A; &#x44F;&#x43A; &#x446;&#x435; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442;&#x443;. &#x422;&#x43E;&#x43C;&#x443; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>const</code> &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; &#x432; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x457;&#x445; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438;.</p>
<p>&#x417; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x431;&#x43E;&#x43A;&#x443;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>const</code> &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; &#x432; &#x446;&#x438;&#x43A;&#x43B;&#x430;&#x445; <code>for-in</code> &#x442;&#x430; <code>for-of</code>, &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x431;&#x443;&#x434;&#x435; &#x442;&#x430;&#x43A;&#x430; &#x436;, &#x44F;&#x43A; &#x456; <code>let</code> &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;. &#x422;&#x43E;&#x43C;&#x443; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> funcs = [],
    object = {
        a: <span class="hljs-literal">true</span>,
        b: <span class="hljs-literal">true</span>,
        c: <span class="hljs-literal">true</span>
    };

<span class="hljs-comment">// &#x43D;&#x435; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;</span>
<span class="hljs-keyword">for</span> (<span class="hljs-keyword">const</span> key <span class="hljs-keyword">in</span> object) {
    funcs.push(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
        <span class="hljs-built_in">console</span>.log(key);
    });
}

funcs.forEach(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">func</span>) </span>{
    func();     <span class="hljs-comment">// &#x432;&#x438;&#x432;&#x435;&#x434;&#x435; &quot;a&quot;, &#x442;&#x43E;&#x434;&#x456; &quot;b&quot; &#x456; &#x442;&#x43E;&#x434;&#x456; &quot;c&quot;</span>
});
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x441;&#x430;&#x43C;&#x438;&#x439;, &#x44F;&#x43A; &#x456; &#x432; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x432; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x443; &#xAB;let &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x446;&#x438;&#x43A;&#x43B;&#x430;&#x445;&#xBB;. &#x404;&#x434;&#x438;&#x43D;&#x43E;&#x44E; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>key</code> &#x43D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x446;&#x438;&#x43A;&#x43B;&#x443;. &#x426;&#x438;&#x43A;&#x43B;&#x438; <code>for-in</code> &#x442;&#x430; <code>for-of</code> &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x456;&#x437; <code>const</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x442;&#x43E;&#x440; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43D;&#x43E;&#x432;&#x435; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438; &#x43A;&#x43E;&#x436;&#x43D;&#x456;&#x439; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;, &#x430; &#x43D;&#x435; &#x43D;&#x430;&#x43C;&#x430;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x44F;&#x43A;&#x435; &#x432;&#x436;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x454; (&#x44F;&#x43A; &#x446;&#x435; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x432; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>for</code>, &#x430; &#x43D;&#x435; <code>for-in</code>).</p>
<h2 id="&#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x435;-&#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x435;-&#x437;&#x432;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;">&#x413;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x435; &#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x435; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</h2>
<p>&#x406;&#x43D;&#x448;&#x43E;&#x44E; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44E; <code>let</code> &#x442;&#x430; <code>const</code> &#x432;&#x456;&#x434; <code>var</code> &#x454; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x432; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;. &#x41A;&#x43E;&#x43B;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x443; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>var</code>, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430;, &#x44F;&#x43A;&#x430; &#x454; &#x43F;&#x43E;&#x43B;&#x435;&#x43C; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443; (<code>windows</code> &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445;). &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x443; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>var</code>, &#x442;&#x430;&#x43A; &#x44F;&#x43A; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x443;&#x442;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x456;</span>
<span class="hljs-keyword">var</span> <span class="hljs-built_in">RegExp</span> = <span class="hljs-string">&quot;Hello!&quot;</span>;
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">window</span>.RegExp);     <span class="hljs-comment">// &quot;Hello!&quot;</span>

<span class="hljs-keyword">var</span> ncz = <span class="hljs-string">&quot;Hi!&quot;</span>;
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">window</span>.ncz);        <span class="hljs-comment">// &quot;Hi!&quot;</span>
</code></pre>
<p>&#x425;&#x43E;&#x447;&#x430; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; <code>RegExp</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x432; <code>window</code>, &#x439;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>var</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;. &#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x443;&#x454; &#x43D;&#x43E;&#x432;&#x443; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; <code>RegExp</code>, &#x44F;&#x43A;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x454; &#x43E;&#x440;&#x438;&#x433;&#x456;&#x43D;&#x430;&#x43B;. &#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x44F;&#x43A; &#x456; <code>ncz</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x44F;&#x43A; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; &#x456; &#x432;&#x456;&#x434;&#x440;&#x430;&#x437;&#x443; &#x436; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x43F;&#x43E;&#x43B;&#x435; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x430; <code>windows</code>. &#x422;&#x430;&#x43A; JavaScript &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x432; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438;.</p>
<p>&#x41F;&#x440;&#x43E;&#x442;&#x435; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>let</code> &#x442;&#x430; <code>const</code> &#x432; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;, &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x456; &#x43D;&#x43E;&#x432;&#x456; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; &#x431;&#x435;&#x437; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x457;&#x445; &#x44F;&#x43A; &#x43F;&#x43E;&#x43B;&#x44F; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443;. &#x426;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x437;&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>let</code> &#x442;&#x430; <code>const</code>, &#x430; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x440;&#x438;&#x442;&#x438; &#x457;&#x445;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x456;</span>
<span class="hljs-keyword">let</span> <span class="hljs-built_in">RegExp</span> = <span class="hljs-string">&quot;Hello!&quot;</span>;
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">RegExp</span>);                    <span class="hljs-comment">// &quot;Hello!&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">window</span>.RegExp === <span class="hljs-built_in">RegExp</span>);  <span class="hljs-comment">// false</span>

<span class="hljs-keyword">const</span> ncz = <span class="hljs-string">&quot;Hi!&quot;</span>;
<span class="hljs-built_in">console</span>.log(ncz);                       <span class="hljs-comment">// &quot;Hi!&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;ncz&quot;</span> <span class="hljs-keyword">in</span> <span class="hljs-built_in">window</span>);           <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; &#x43D;&#x43E;&#x432;&#x435; <code>let</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;  &#x434;&#x43B;&#x44F; <code>RegExp</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43D;&#x43E;&#x432;&#x435; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x454; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x443; <code>RegExp</code>. &#x422;&#x43E;&#x431;&#x442;&#x43E; <code>windows.RegExp</code> &#x442;&#x430; <code>RegExp</code> &#x2014; &#x43D;&#x435; &#x43E;&#x434;&#x43D;&#x435; &#x456; &#x442;&#x435; &#x436;, &#x442;&#x43E;&#x43C;&#x443; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43D;&#x456;&#x44F;&#x43A;&#x438;&#x445; &#x437;&#x431;&#x43E;&#x457;&#x432; &#x443; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;. &#x422;&#x430;&#x43A;&#x43E;&#x436; <code>const</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; <code>nzt</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43D;&#x43E;&#x432;&#x435; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;, &#x430;&#x43B;&#x435; &#x43D;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43D;&#x43E;&#x432;&#x435; &#x43F;&#x43E;&#x43B;&#x435; &#x432; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C;&#x443; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x456;. &#x426;&#x44F; &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; <code>let</code> &#x442;&#x430; <code>const</code> &#x43D;&#x430;&#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x456;&#x448;&#x438;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x432; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x43B;&#x435; &#x432; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C;&#x443; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x456;.</p>
<p>|&gt; &#x412;&#x438; &#x44F;&#x43A; &#x456; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>var</code> &#x434;&#x43B;&#x44F; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x432; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x448; &#x43A;&#x43E;&#x434; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x447;&#x435;&#x440;&#x435;&#x437; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;. &#x426;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x43C; &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x438;&#x439; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x43A;&#x43E;&#x434;&#x443; &#x456;&#x437; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x432;&#x456;&#x43A;&#x43D;&#x430; &#x447;&#x438; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x443;.</p>
<h2 id="&#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x430;&#x446;&#x456;-&#x449;&#x43E;&#x434;&#x43E;-&#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x43E;&#x433;&#x43E;-&#x437;&#x432;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;">&#x420;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x430;&#x446;&#x456; &#x449;&#x43E;&#x434;&#x43E; &#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</h2>
<p>&#x414;&#x43E;&#x43F;&#x43E;&#x43A;&#x438; ECMAScript 6 &#x431;&#x443;&#x432; &#x443; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x446;&#x456;, &#x431;&#x443;&#x43B;&#x430; &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x432;&#x441;&#x44E;&#x434;&#x436;&#x435;&#x43D;&#x430; &#x434;&#x443;&#x43C;&#x43A;&#x430; &#x43F;&#x440;&#x43E; &#x442;&#x435;, &#x449;&#x43E; &#x434;&#x43B;&#x44F; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>let</code> &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x430; &#x43D;&#x435; <code>var</code> &#x434;&#x43B;&#x44F; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;. &#x414;&#x43B;&#x44F; &#x431;&#x430;&#x433;&#x430;&#x442;&#x44C;&#x43E;&#x445; JavaScript &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; <code>let</code> &#x454; &#x441;&#x430;&#x43C;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x44E;, &#x44F;&#x43A;&#x43E;&#x44E; &#x43C;&#x430;&#x43B;&#x430; &#x431;&#x438; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; <code>var</code>, &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x44F;&#x43C;&#x435; &#x437;&#x430;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x454; &#x43B;&#x43E;&#x433;&#x456;&#x447;&#x43D;&#x438;&#x43C;. &#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; &#x432;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x435; <code>const</code> &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;, &#x44F;&#x43A;&#x456; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C;.</p>
<p>&#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x449;&#x43E; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x43C;&#x456;&#x433;&#x440;&#x443;&#x432;&#x430;&#x43B;&#x43E; &#x43D;&#x430; ECMAScript 6, &#x442;&#x43E; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x443; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43D;&#x430;&#x431;&#x440;&#x430;&#x432; &#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434;: &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>const</code> &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x430; <code>let</code> &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x437;&#x43D;&#x430;&#x454;&#x442;&#x435;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438;. &#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x44E; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x43E;&#x44E; &#x434;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x43D;&#x435;&#x441;&#x43F;&#x43E;&#x434;&#x456;&#x432;&#x430;&#x43D;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x454; &#x434;&#x436;&#x435;&#x440;&#x435;&#x43B;&#x43E;&#x43C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;. &#x426;&#x435;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x43D;&#x430;&#x431;&#x440;&#x430;&#x432; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456;&#x441;&#x442;&#x44C;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x430;&#x440;&#x442;&#x43E; &#x432;&#x438;&#x432;&#x447;&#x438;&#x442;&#x438; &#x432;&#x430;&#x448; &#x43A;&#x43E;&#x434;, &#x449;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438; &#x44F;&#x43A; &#x43F;&#x438;&#x448;&#x438;&#x442;&#x435; &#x43A;&#x43E;&#x434; &#x43D;&#x430; ECMAScript 6 &#x432;&#x438;.</p>
<h2 id="&#x43F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;">&#x41F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;</h2>
<p>&#x411;&#x43B;&#x43E;&#x447;&#x43D;&#x435; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; <code>let</code> &#x442;&#x430; <code>const</code>, &#x43F;&#x440;&#x438;&#x43D;&#x435;&#x441;&#x43B;&#x43E; &#x43B;&#x435;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x443; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x432; JavaScript. &#x426;&#x456; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x432;&#x438;&#x440;&#x438;&#x43D;&#x430;&#x44E;&#x442;&#x44C; &#x442;&#x430; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x442;&#x44C; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x431;&#x43B;&#x43E;&#x43A;&#x443;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456;. &#x41A;&#x440;&#x456;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x435; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; ECMAScript 2015 &#x43D;&#x430;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443;, &#x44F;&#x43A;&#x430; &#x454; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x445;&#x43E;&#x436;&#x43E;&#x44E; &#x43D;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x432; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432;&#x430;&#x445;, &#x442;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x43E;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x432;&#x456;&#x434; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x445; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x456; &#x441;&#x430;&#x43C;&#x435; &#x442;&#x430;&#x43C;, &#x434;&#x435; &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x456;. &#x41F;&#x43E;&#x431;&#x456;&#x447;&#x43D;&#x438;&#x43C; &#x435;&#x444;&#x435;&#x43A;&#x442;&#x43E;&#x43C; &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;, &#x43F;&#x435;&#x440;&#x448; &#x43D;&#x456;&#x436; &#x432;&#x43E;&#x43D;&#x430; &#x431;&#x443;&#x43B;&#x430; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x430;, &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x456;&#x437; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x438;&#x43C;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x43C;&#x438;, &#x442;&#x430;&#x43A;&#x438;&#x43C;&#x438; &#x44F;&#x43A; <code>typeof</code>. &#x421;&#x43F;&#x440;&#x43E;&#x431;&#x430; &#x446;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x441;&#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x43A;&#x443;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x443; &#x437;&#x432;&apos;&#x44F;&#x437;&#x43A;&#x443; &#x456;&#x437; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x43D;&#x430;&#x44F;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x432;&apos;&#x44F;&#x437;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x432; &#x442;&#x438;&#x43C;&#x447;&#x430;&#x441;&#x43E;&#x432;&#x456;&#x439; &#x43C;&#x435;&#x440;&#x442;&#x432;&#x456;&#x439; &#x437;&#x43E;&#x43D;&#x456; (&#x422;&#x41C;&#x417;).</p>
<p>&#x412; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x456;&#x432; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; <code>l&#x435;t</code> &#x442;&#x430; <code>const</code> &#x441;&#x445;&#x43E;&#x436;&#x430; &#x434;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x438; <code>var</code>, &#x43E;&#x434;&#x43D;&#x430;&#x43A; &#x432; &#x446;&#x438;&#x43A;&#x43B;&#x430;&#x445; &#x446;&#x435; &#x43D;&#x435; &#x442;&#x430;&#x43A;. &#x414;&#x43B;&#x44F; <code>let</code> &#x442;&#x430; <code>const</code> &#x446;&#x438;&#x43A;&#x43B;&#x438; <code>for-in</code> &#x442;&#x430; <code>for-of</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x435; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x457; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x432;&#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436; &#x446;&#x438;&#x43A;&#x43B;&#x443;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x456; &#x432; &#x442;&#x456;&#x43B;&#x456; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x437;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x437;&#x432;&apos;&#x44F;&#x437;&#x430;&#x43D;&#x435; &#x437; &#x43D;&#x438;&#x43C; &#x432;&#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x457; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;, &#x430; &#x43D;&#x435; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x457; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; (&#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; <code>var</code>). &#x426;&#x435; &#x436; &#x432;&#x456;&#x440;&#x43D;&#x43E; &#x456; &#x434;&#x43B;&#x44F; <code>let</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x44C; &#x443; &#x446;&#x438;&#x43A;&#x43B;&#x430;&#x445; <code>for</code>, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>const</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x446;&#x438;&#x43A;&#x43B;&#x443; <code>for</code> &#x441;&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;.</p>
<p>&#x41F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x44E; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x430;&#x446;&#x456;&#x454;&#x44E; &#x434;&#x43B;&#x44F; &#x431;&#x43B;&#x43E;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>const</code> &#x432; &#x443;&#x441;&#x456;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x430;&#x445;, &#x43E;&#x43A;&#x440;&#x456;&#x43C; &#x442;&#x438;&#x445;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x437;&#x43D;&#x430;&#x454;&#x442;&#x435;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;, &#x442;&#x43E;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x439;&#x442;&#x435; <code>let</code>. &#x426;&#x438;&#x43C; &#x432;&#x438; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x443;&#x454;&#x442;&#x435; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x456;&#x432;&#x435;&#x43D;&#x44C; &#x456;&#x43C;&#x443;&#x442;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432; &#x43A;&#x43E;&#x434;&#x456;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x430;&#x43F;&#x43E;&#x431;&#x456;&#x433;&#x442;&#x438; &#x432;&#x438;&#x43D;&#x438;&#x43A;&#x43D;&#x435;&#x43D;&#x43D;&#x44E; &#x434;&#x435;&#x44F;&#x43A;&#x438;&#x445; &#x432;&#x438;&#x434;&#x456;&#x432; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="00-Introduction.html" class="navigation navigation-prev " aria-label="Previous page: Вступ">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="02-Strings-and-Regular-Expressions.html" class="navigation navigation-next " aria-label="Next page: Глава 2: Рядки та регулярні вирази">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Глава 1: Блочне зв’язування","level":"1.3","depth":1,"next":{"title":"Глава 2: Рядки та регулярні вирази","level":"1.4","depth":1,"path":"manuscript/02-Strings-and-Regular-Expressions.md","ref":"manuscript/02-Strings-and-Regular-Expressions.md","articles":[]},"previous":{"title":"Вступ","level":"1.2","depth":1,"path":"manuscript/00-Introduction.md","ref":"manuscript/00-Introduction.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","ga","rss","github-buttons"],"pluginsConfig":{"github":{"url":"https://github.com/LambdaBooks/understandinges6ua"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Рoзуміння ECMAScript 6","description":"Український переклад книги «Understanding ES6».","author":"Denys Dovhan","site_url":"http://understandinges6.denysdovhan.com/","feed_url":"http://understandinges6.denysdovhan.com/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"github-buttons":{"repo":"LambdaBooks/understandinges6ua","types":["star"],"size":"small"},"ga":{"configuration":"auto","token":"UA-40496885-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/LambdaBooks/understandinges6ua/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"manuscript/01-Block-Bindings.md","mtime":"2017-03-13T09:04:15.935Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-13T09:05:41.171Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

