
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Глава 2: Рядки та регулярні вирази · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="03-Functions.html" />
    
    
    <link rel="prev" href="01-Block-Bindings.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"denysdovhan/understandinges6ua","types":["star"],"size":"small"};
    </script>

    <link href="http://understandinges6.denysdovhan.com/rss.xml" title="Рoзуміння ECMAScript 6" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Рoзуміння ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-Block-Bindings.html">
            
                <a href="01-Block-Bindings.html">
            
                    
                    Глава 1: Блочне зв’язування
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="02-Strings-and-Regular-Expressions.html">
            
                <a href="02-Strings-and-Regular-Expressions.html">
            
                    
                    Глава 2: Рядки та регулярні вирази
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03-Functions.html">
            
                <a href="03-Functions.html">
            
                    
                    Глава 3: Функції
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="04-Objects.html">
            
                <a href="04-Objects.html">
            
                    
                    Глава 4: Розширена функціональність об’єктів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="05-Destructuring.html">
            
                <a href="05-Destructuring.html">
            
                    
                    Глава 5: Деструктурування для легшого доступу до даних
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="06-Symbols.html">
            
                <a href="06-Symbols.html">
            
                    
                    Глава 6: Символи та їх властивості
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="07-Sets-And-Maps.html">
            
                <a href="07-Sets-And-Maps.html">
            
                    
                    Глава 7: Множини та мапи
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="08-Iterators-And-Generators.html">
            
                <a href="08-Iterators-And-Generators.html">
            
                    
                    Глава 8: Ітератори та генератори
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="09-Classes.html">
            
                <a href="09-Classes.html">
            
                    
                    Глава 9: Знайомство з класами у JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10-Arrays.html">
            
                <a href="10-Arrays.html">
            
                    
                    Глава 10: Покращені можливості масивів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11-Promises.html">
            
                <a href="11-Promises.html">
            
                    
                    Глава 11: Проміси та асинхронне програмування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12-Proxies-and-Reflection.html">
            
                <a href="12-Proxies-and-Reflection.html">
            
                    
                    Глава 12: Проксі та АРІ рефлексії
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" >
            
                <span>
            
                    
                    Глава 13: Інкапсуляція коду через модулі
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" >
            
                <span>
            
                    
                    Додаток А: Дрібніші зміни у ECMAScript 6
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" >
            
                <span>
            
                    
                    Додаток Б: Розуміння ECMAScript 7 (2016)
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Глава 2: Рядки та регулярні вирази</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x440;&#x44F;&#x434;&#x43A;&#x438;-&#x442;&#x430;-&#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456;-&#x432;&#x438;&#x440;&#x430;&#x437;&#x438;">&#x420;&#x44F;&#x434;&#x43A;&#x438; &#x442;&#x430; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438;</h1>
<p>&#x420;&#x44F;&#x434;&#x43A;&#x438;, &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x454; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C;&#x438; &#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x432; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456;. &#x412;&#x43E;&#x43D;&#x438; &#x454; &#x43C;&#x430;&#x439;&#x436;&#x435; &#x443; &#x432;&#x441;&#x456;&#x445; &#x432;&#x438;&#x441;&#x43E;&#x43A;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x435;&#x432;&#x438;&#x445; &#x43C;&#x43E;&#x432;&#x430;&#x445; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x430; &#x432;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x43D;&#x438;&#x43C;&#x438; &#x435;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E; &#x454; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;, &#x43F;&#x440;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x456; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;. &#x412;&#x442;&#x456;&#x43C;, &#x431;&#x443;&#x434;&#x443;&#x447;&#x438; &#x432;&#x456;&#x434;&#x432;&#x435;&#x440;&#x442;&#x438;&#x43C;&#x438;, &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x454; &#x43D;&#x435; &#x43C;&#x435;&#x43D;&#x448; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x434;&#x430;&#x44E;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x443; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x440;&#x438; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x456; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438;. &#x417;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x446;&#x435;, &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; ECMAScript 6 &#x432;&#x434;&#x43E;&#x441;&#x43A;&#x43E;&#x43D;&#x430;&#x43B;&#x438;&#x43B;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x456; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438;, &#x434;&#x43E;&#x434;&#x430;&#x432;&#x448;&#x438; &#x43D;&#x43E;&#x432;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x442;&#x430; &#x434;&#x43E;&#x432;&#x433;&#x43E;&#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;. &#x426;&#x44F; &#x433;&#x43B;&#x430;&#x432;&#x430; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x432; &#x43E;&#x431;&#x43E;&#x445; &#x442;&#x438;&#x43F;&#x430;&#x445;.</p>
<h2 id="&#x43A;&#x440;&#x430;&#x449;&#x430;-&#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x430;-unicode">&#x41A;&#x440;&#x430;&#x449;&#x430; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x430; Unicode</h2>
<p>&#x414;&#x43E; &#x43F;&#x43E;&#x44F;&#x432;&#x438; ECMAScript 6, &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x432; JavaScript &#x431;&#x430;&#x437;&#x443;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x43D;&#x430; 16-&#x431;&#x456;&#x442;&#x43D;&#x456;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x456; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;. &#x423;&#x441;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;, &#x44F;&#x43A;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>length</code> &#x442;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>charAt()</code>, &#x431;&#x430;&#x437;&#x443;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44F; &#x43D;&#x430; &#x456;&#x434;&#x435;&#x457;, &#x449;&#x43E; 16-&#x431;&#x456;&#x442;&#x43D;&#x430; &#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x454; &#x454;&#x434;&#x438;&#x43D;&#x456;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;. ECMAScript 5 &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x432; JavaScript &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x43C; &#x43E;&#x431;&#x438;&#x440;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x456;&#x436; &#x434;&#x432;&#x43E;&#x43C;&#x430; &#x432;&#x430;&#x440;&#x456;&#x430;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;: UCS-2 &#x430;&#x431;&#x43E; UTF-16. (&#x41E;&#x431;&#x438;&#x434;&#x432;&#x456; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; 16-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x438;&#x445; <em>&#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x445; &#x441;&#x43B;&#x456;&#x432;</em> (code unites), &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x43E; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x44E;&#x447;&#x438; &#x443;&#x441;&#x456; &#x432;&#x456;&#x434;&#x441;&#x442;&#x435;&#x436;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;.) &#x410;&#x43B;&#x435; &#x432;&#x432;&#x430;&#x436;&#x430;&#x43B;&#x43E;&#x441;&#x44F; &#x449;&#x43E; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x456;&#x436; 16 &#x431;&#x456;&#x442;, &#x43D;&#x430; &#x449;&#x430;&#x441;&#x442;&#x44F; &#x446;&#x435; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x454; &#x430;&#x431;&#x441;&#x43E;&#x43B;&#x44E;&#x442;&#x43E;&#x43C;, &#x434;&#x44F;&#x43A;&#x443;&#x44E;&#x447;&#x438; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44E; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43E;&#x433;&#x43E; &#x43D;&#x430;&#x431;&#x43E;&#x440;&#x443; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; Unicode.</p>
<h3 id="&#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-utf-16">&#x41A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; UTF-16</h3>
<p>&#x41E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x438; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x434;&#x43E; 16 &#x431;&#x456;&#x442; &#x43D;&#x435; &#x434;&#x430;&#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x443; &#x43C;&#x435;&#x442;&#x443; Unicode: &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x43C;&#x443; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x443; &#x441;&#x432;&#x456;&#x442;&#x456;. &#x426;&#x456; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x438;, &#x442;&#x430;&#x43A; &#x437;&#x432;&#x430;&#x43D;&#x456; <em>&#x43A;&#x43E;&#x434;&#x438;</em> (code point), &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43D;&#x43E;&#x43C;&#x435;&#x440;&#x438;, &#x44F;&#x43A;&#x456; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437; 0.</p>
<p>&#x41A;&#x43E;&#x434;&#x438; UTF-16 &#x441;&#x445;&#x43E;&#x436;&#x456; &#x43D;&#x430; &#x43A;&#x43E;&#x434;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;, &#x430;&#x43B;&#x435; &#x43C;&#x456;&#x436; &#x43D;&#x438;&#x43C;&#x438; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x43D;&#x435;&#x432;&#x435;&#x43B;&#x438;&#x43A;&#x430; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x446;&#x44F;. &#x41A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x454; &#x43A;&#x43E;&#x434;&#x438; &#x432; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x456; &#x441;&#x43B;&#x43E;&#x432;&#x430;, &#x44F;&#x43A;&#x456; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44C;&#x43E; &#x43D;&#x435;&#x441;&#x443;&#x43F;&#x435;&#x440;&#x435;&#x447;&#x43B;&#x438;&#x432;&#x456;. &#x412; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; UCS-2 &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x454; &#x43A;&#x43E;&#x434;&#x438; &#x437; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x441;&#x43B;&#x43E;&#x432;&#x430;&#x43C;&#x438; &#x443; &#x441;&#x43F;&#x456;&#x432;&#x432;&#x456;&#x434;&#x43D;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x456; &#x43E;&#x434;&#x438;&#x43D; &#x434;&#x43E; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E;, &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432; UTF-16 &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43E;&#x434;&#x438;&#x43D; &#x434;&#x43E; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E;.</p>
<p>&#x41F;&#x435;&#x440;&#x448;&#x456; 2^16 &#x43A;&#x43E;&#x434;&#x456;&#x432; &#x432; UTF-16 &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x456; &#x44F;&#x43A; &#x43E;&#x434;&#x438;&#x43D;&#x438;&#x447;&#x43D;&#x456; 16-&#x431;&#x456;&#x442;&#x43D;&#x456; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x456; &#x441;&#x43B;&#x43E;&#x432;&#x430;. &#x426;&#x435;&#x439; &#x434;&#x456;&#x430;&#x43F;&#x430;&#x437;&#x43E;&#x43D; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <em>&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x430; &#x411;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x43C;&#x43E;&#x432;&#x43D;&#x430; &#x41C;&#x430;&#x442;&#x440;&#x438;&#x446;&#x44F;</em> (&#x41E;&#x411;&#x41C;). &#x412;&#x441;&#x435;, &#x449;&#x43E; &#x43F;&#x43E;&#x437;&#x430; &#x43C;&#x435;&#x436;&#x430;&#x43C;&#x438; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x434;&#x456;&#x430;&#x43F;&#x430;&#x437;&#x43E;&#x43D;&#x443; &#x432;&#x432;&#x430;&#x436;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <em>&#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x44E; &#x43C;&#x430;&#x442;&#x440;&#x438;&#x446;&#x435;&#x44E;</em>, &#x434;&#x435; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x456; &#x441;&#x43B;&#x43E;&#x432;&#x430; &#x432;&#x436;&#x435; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x456; &#x43B;&#x438;&#x448;&#x435; &#x443; 16 &#x431;&#x456;&#x442;&#x430;&#x445;. UTF-16 &#x432;&#x438;&#x440;&#x456;&#x448;&#x443;&#x454; &#x446;&#x44E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; <em>&#x441;&#x443;&#x440;&#x43E;&#x433;&#x430;&#x442;&#x43D;&#x438;&#x445; &#x43F;&#x430;&#x440;</em>, &#x432; &#x44F;&#x43A;&#x438;&#x445; &#x43E;&#x434;&#x438;&#x43D; &#x43A;&#x43E;&#x434; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x434;&#x432;&#x43E;&#x43C;&#x430; 16-&#x431;&#x456;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x441;&#x43B;&#x43E;&#x432;&#x430;&#x43C;&#x438;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x44C; &#x44F;&#x43A;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x44F;&#x43A; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x43C; &#x441;&#x43B;&#x43E;&#x432;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x41E;&#x411;&#x41C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;, &#x434;&#x430;&#x44E;&#x447;&#x438; &#x432; &#x441;&#x443;&#x43C;&#x456; 16 &#x431;&#x456;&#x442;, &#x442;&#x430;&#x43A; &#x456; &#x434;&#x432;&#x43E;&#x43C;&#x430; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x441;&#x43B;&#x43E;&#x432;&#x430;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x457; &#x43C;&#x430;&#x442;&#x440;&#x438;&#x446;&#x456;, &#x434;&#x430;&#x44E;&#x447;&#x438; &#x432; &#x441;&#x443;&#x43C;&#x456; 32 &#x431;&#x456;&#x442;&#x438;.</p>
<p>&#x423; ECMAScript 5, &#x432;&#x441;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x432; &#x434;&#x456;&#x430;&#x43F;&#x430;&#x437;&#x43E;&#x43D;&#x456; 16-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x445; &#x441;&#x43B;&#x456;&#x432;, &#x442;&#x43E;&#x43C;&#x443;, &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x43F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x438;, &#x449;&#x43E; &#x432;&#x438; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x454;&#x442;&#x435; &#x43D;&#x435;&#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x456; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x438; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x432; UTF-16, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x441;&#x443;&#x440;&#x43E;&#x433;&#x430;&#x442;&#x43D;&#x456; &#x43F;&#x430;&#x440;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> text = <span class="hljs-string">&quot;&#x20BB7;&quot;</span>;

<span class="hljs-built_in">console</span>.log(text.length);           <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-regexp">/^.$/</span>.test(text));      <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(text.charAt(<span class="hljs-number">0</span>));        <span class="hljs-comment">// &quot;&quot;</span>
<span class="hljs-built_in">console</span>.log(text.charAt(<span class="hljs-number">1</span>));        <span class="hljs-comment">// &quot;&quot;</span>
<span class="hljs-built_in">console</span>.log(text.charCodeAt(<span class="hljs-number">0</span>));    <span class="hljs-comment">// 55362</span>
<span class="hljs-built_in">console</span>.log(text.charCodeAt(<span class="hljs-number">1</span>));    <span class="hljs-comment">// 57271</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x454;&#x434;&#x438;&#x43D;&#x438;&#x439; Unicode &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x441;&#x443;&#x440;&#x43E;&#x433;&#x430;&#x442;&#x43D;&#x43E;&#x44E; &#x43F;&#x430;&#x440;&#x43E;&#x44E;, &#x442;&#x43E;&#x43C;&#x443; JavaScript &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x43C; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F;, &#x44F;&#x43A; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C;, &#x449;&#x43E; &#x43C;&#x430;&#x454; &#x434;&#x432;&#x430; 16-&#x431;&#x456;&#x442;&#x43D;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;:</p>
<ul>
<li>&#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>length</code> &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>text</code> &#x431;&#x443;&#x434;&#x435; 2;</li>
<li>&#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437;, &#x44F;&#x43A;&#x438;&#x439; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x454; &#x437;&#x43D;&#x430;&#x439;&#x442;&#x438; &#x43E;&#x434;&#x438;&#x43D;&#x438;&#x447;&#x43D;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;, &#x434;&#x430;&#x441;&#x442;&#x44C; <code>false</code>;</li>
<li>&#x43C;&#x435;&#x442;&#x43E;&#x434; <code>charAt()</code> &#x43D;&#x435; &#x432; &#x437;&#x43C;&#x43E;&#x437;&#x456; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43E;&#x43A;;</li>
</ul>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>charCodeAt()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x439; 16-&#x431;&#x456;&#x442;&#x43D;&#x438;&#x439; &#x43D;&#x43E;&#x43C;&#x435;&#x440; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430;, &#x430;&#x43B;&#x435; &#x446;&#x435; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43D;&#x430;&#x431;&#x43B;&#x438;&#x436;&#x435;&#x43D;&#x435; &#x434;&#x43E; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x432; ECMAScript 5.</p>
<p>ECMAScript 6 &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x443;&#x454; &#x43F;&#x43E;&#x432;&#x43D;&#x443; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x432; UTF-16. &#x421;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x438;&#x437;&#x430;&#x446;&#x456;&#x44F; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438;, &#x44F;&#x43A;&#x456; &#x431;&#x430;&#x437;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456;, &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x449;&#x43E; JavaScript &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x441;&#x443;&#x440;&#x43E;&#x433;&#x430;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x438;. &#x420;&#x435;&#x448;&#x442;&#x430; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x443; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;&#x432; &#x446;&#x456;&#x454;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456;.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-codepointat">&#x41C;&#x435;&#x442;&#x43E;&#x434; codePointAt()</h3>
<p>&#x41E;&#x434;&#x43D;&#x438;&#x43C; &#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x438;&#x445; &#x432; ECMAScript 6 &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x432;&#x43D;&#x43E;&#x457; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x438; UTF-16 &#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>codePointAt()</code>, &#x44F;&#x43A;&#x438;&#x439; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x43A;&#x43E;&#x434;&#x438; Unicode, &#x44F;&#x43A;&#x456; &#x43F;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x430;&#x43D;&#x456; &#x437; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;&#x44E; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x454;&#x44E; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443;. &#x426;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x44E; &#x43A;&#x43E;&#x434;&#x443; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x457; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x442;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x446;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; <code>console.log()</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> text = <span class="hljs-string">&quot;&#x20BB7;a&quot;</span>;

<span class="hljs-built_in">console</span>.log(text.charCodeAt(<span class="hljs-number">0</span>));    <span class="hljs-comment">// 55362</span>
<span class="hljs-built_in">console</span>.log(text.charCodeAt(<span class="hljs-number">1</span>));    <span class="hljs-comment">// 57271</span>
<span class="hljs-built_in">console</span>.log(text.charCodeAt(<span class="hljs-number">2</span>));    <span class="hljs-comment">// 97</span>

<span class="hljs-built_in">console</span>.log(text.codePointAt(<span class="hljs-number">0</span>));   <span class="hljs-comment">// 134071</span>
<span class="hljs-built_in">console</span>.log(text.codePointAt(<span class="hljs-number">1</span>));   <span class="hljs-comment">// 57271</span>
<span class="hljs-built_in">console</span>.log(text.codePointAt(<span class="hljs-number">2</span>));   <span class="hljs-comment">// 97</span>
</code></pre>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>codePointAt()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>charCodeAt()</code> &#x437;&#x430; &#x432;&#x438;&#x43D;&#x44F;&#x442;&#x43A;&#x43E;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x43E;&#x43F;&#x435;&#x440;&#x443;&#x454; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43D;&#x435;-&#x41E;&#x411;&#x41C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>text</code> &#x454; &#x43D;&#x435;-&#x41E;&#x411;&#x41C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x43C; &#x456; &#x432;&#x456;&#x43D; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x434;&#x432;&#x43E;&#x43C;&#x430; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x441;&#x43B;&#x43E;&#x432;&#x430;&#x43C;&#x438;; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43C;&#x430;&#x454; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x443; &#x442;&#x440;&#x44C;&#x43E;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x434;&#x432;&#x43E;&#x445;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>charCodeAt()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43F;&#x435;&#x440;&#x448;&#x435; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x457; 0, &#x430;&#x43B;&#x435; <code>codePointAt()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x43E;&#x432;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x43D;&#x435;&#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x434;&#x432;&#x430; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x456; &#x441;&#x43B;&#x43E;&#x432;&#x430;. &#x41E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x435; &#x441;&#x430;&#x43C;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x457; 1 (&#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x439; &#x431;&#x43B;&#x43E;&#x43A; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443;) &#x442;&#x430; 2 (&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; <code>&quot;a&quot;</code>).</p>
<p>&#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>codePointAt()</code> &#x434;&#x43B;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x454; &#x43D;&#x430;&#x439;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x434;&#x456;&#x437;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x437; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x430;&#x431;&#x43E; &#x434;&#x432;&#x43E;&#x445; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x445; &#x441;&#x43B;&#x456;&#x432;. &#x41E;&#x441;&#x44C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x44F;&#x43A;&#x443; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">is32Bit</span>(<span class="hljs-params">c</span>) </span>{
    <span class="hljs-keyword">return</span> c.codePointAt(<span class="hljs-number">0</span>) &gt; <span class="hljs-number">0xFFFF</span>;
}

<span class="hljs-built_in">console</span>.log(is32Bit(<span class="hljs-string">&quot;&#x20BB7;&quot;</span>));         <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(is32Bit(<span class="hljs-string">&quot;a&quot;</span>));          <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x412;&#x435;&#x440;&#x445;&#x43D;&#x44F; &#x43C;&#x435;&#x436;&#x430; 16-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x445; &#x432; &#x448;&#x456;&#x441;&#x442;&#x43D;&#x430;&#x434;&#x446;&#x44F;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x456; &#x454; <code>FFFF</code>, &#x442;&#x43E;&#x43C;&#x443; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x438;&#x439; &#x43D;&#x456;&#x436; &#x446;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x434;&#x432;&#x43E;&#x43C;&#x430; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x441;&#x43B;&#x43E;&#x432;&#x430;&#x43C;&#x438;, &#x432; &#x446;&#x456;&#x43B;&#x43E;&#x43C;&#x443; 32 &#x431;&#x456;&#x442;&#x430;.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-stringfromcodepoint">&#x41C;&#x435;&#x442;&#x43E;&#x434; String.fromCodePoint()</h3>
<p>&#x422;&#x43E;&#x434;&#x456; &#x44F;&#x43A; ECMAScript &#x43D;&#x430;&#x434;&#x430;&#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x449;&#x43E;&#x441;&#x44C; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438;, &#x432;&#x456;&#x43D; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x43F;&#x440;&#x43E;&#x432;&#x430;&#x434;&#x436;&#x443;&#x454; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435; &#x443; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; <code>codePointAt()</code> &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43A;&#x43E;&#x434; &#x434;&#x43B;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x432; &#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; <code>String.fromCodePoint()</code> &#x434;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E; &#x434;&#x43E; &#x43A;&#x43E;&#x434;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">String</span>.fromCodePoint(<span class="hljs-number">134071</span>));  <span class="hljs-comment">// &quot;&#x20BB7;&quot;</span>
</code></pre>
<p>&#x421;&#x43B;&#x456;&#x434; &#x432;&#x432;&#x430;&#x436;&#x430;&#x442;&#x438;, &#x449;&#x43E; <code>String.fromCodePoint()</code> &#x2014; &#x432;&#x434;&#x43E;&#x441;&#x43A;&#x43E;&#x43D;&#x430;&#x43B;&#x435;&#x43D;&#x430; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F; <code>String.fromCharCode()</code>. &#x41E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x434;&#x430;&#x44E;&#x442;&#x44C; &#x442;&#x456; &#x441;&#x430;&#x43C;&#x456; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x432; &#x43C;&#x435;&#x436;&#x430;&#x445; &#x41E;&#x411;&#x41C;. &#x420;&#x456;&#x437;&#x43D;&#x438;&#x446;&#x44E; &#x432;&#x438; &#x437;&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x43C;&#x456;&#x442;&#x438;&#x442;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x44F;&#x43A;&#x449;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438; &#x437;&#x430; &#x43C;&#x435;&#x436;&#x430;&#x43C;&#x438; &#x41E;&#x411;&#x41C;.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-normalize">&#x41C;&#x435;&#x442;&#x43E;&#x434; normalize()</h3>
<p>&#x406;&#x43D;&#x448;&#x438;&#x43C; &#x446;&#x456;&#x43A;&#x430;&#x432;&#x438;&#x43C; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x43E;&#x43C; Unicode &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x432;&#x430;&#x436;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439;, &#x449;&#x43E; &#x431;&#x430;&#x437;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x43D;&#x43D;&#x456;. &#x404; &#x434;&#x432;&#x430; &#x448;&#x43B;&#x44F;&#x445;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x438;&#x445; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x456;&#x432;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x439;, <em>&#x43A;&#x430;&#x43D;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x430; &#x440;&#x456;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44C;</em> &#x43C;&#x430;&#x454; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;, &#x449;&#x43E; &#x434;&#x432;&#x456; &#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x445; &#x441;&#x43B;&#x456;&#x432; &#x454; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x437;&#x430;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x43C;&#x438; &#x443; &#x432;&#x441;&#x456;&#x445; &#x432;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x438;&#x43D;&#x430;&#x445;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43A;&#x43E;&#x43C;&#x431;&#x456;&#x43D;&#x430;&#x446;&#x456;&#x44F; &#x434;&#x432;&#x43E;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43A;&#x430;&#x43D;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x438;&#x43C; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443;. &#x414;&#x440;&#x443;&#x433;&#x435; &#x441;&#x43F;&#x456;&#x432;&#x432;&#x456;&#x434;&#x43D;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x2014; <em>&#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x456;&#x441;&#x442;&#x44C;</em>. &#x414;&#x432;&#x456; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x456; &#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x445; &#x441;&#x43B;&#x456;&#x432; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x43C;&#x438;, &#x430;&#x43B;&#x435; &#x431;&#x443;&#x442;&#x438; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x437;&#x430;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x43C;&#x438; &#x432; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x445; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x456;&#x44F;&#x445;.</p>
<p>&#x412;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E; &#x434;&#x43E; &#x446;&#x438;&#x445; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x456;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x438;, &#x44F;&#x43A;&#x456; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C; &#x437; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x431;&#x43E;&#x43A;&#x443; &#x442;&#x43E;&#x439; &#x441;&#x430;&#x43C;&#x438;&#x439; &#x442;&#x435;&#x43A;&#x441;&#x442;, &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43C;&#x430;&#x442;&#x438; &#x440;&#x456;&#x437;&#x43D;&#x443; &#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x445; &#x441;&#x43B;&#x456;&#x432;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &quot;&#xE6;&quot; &#x442;&#x430; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x441; &#x434;&#x432;&#x43E;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &quot;ae&quot; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x43E;, &#x430;&#x43B;&#x435; &#x43D;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x43C;&#x438;, &#x43F;&#x43E;&#x43A;&#x438; &#x457;&#x445; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x43D;&#x435; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438;.</p>
<p>ECMAScript 6 &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44E; &#x444;&#x43E;&#x440;&#x43C; Unicode, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x447;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>normalize()</code>. &#x426;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43E;&#x43F;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x43E;&#x434;&#x438;&#x43D; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x430;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x430;&#x454; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43E;&#x434;&#x43D;&#x443; &#x437; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x445; &#x444;&#x43E;&#x440;&#x43C; Unicode &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x434;&#x430;&#x43B;&#x44C;&#x448;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;:</p>
<ul>
<li><code>&quot;NFC&quot;</code> (Normalization Form Canonical Composition) &#x2014; &#x444;&#x43E;&#x440;&#x43C;&#x430; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#xAB;&#x41A;&#x430;&#x43D;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x430; &#x41A;&#x43E;&#x43C;&#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x44F;&#xBB;; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;</li>
<li><code>&quot;NFD&quot;</code> (Normalization Form Canonical Decomposition) &#x2014; &#x444;&#x43E;&#x440;&#x43C;&#x430; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#xAB;&#x41A;&#x430;&#x43D;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x430; &#x414;&#x435;&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x44F;&#xBB;;</li>
<li><code>&quot;NFKC&quot;</code> (Normalization Form Compatibility Composition) &#x2014; &#x444;&#x43E;&#x440;&#x43C;&#x430; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#xAB;&#x421;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x430; &#x41A;&#x43E;&#x43C;&#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x44F;&#xBB;;</li>
<li><code>&quot;NFKD&quot;</code> (Normalization Form Compatibility Decomposition) &#x2014; &#x444;&#x43E;&#x440;&#x43C;&#x430; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#xAB;&#x421;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x430; &#x414;&#x435;&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x44F;&#xBB;.</li>
</ul>
<p>&#x41F;&#x43E;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43C;&#x456;&#x436; &#x446;&#x438;&#x43C;&#x438; &#x447;&#x43E;&#x442;&#x438;&#x440;&#x43C;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43C;&#x438; &#x432;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x437;&#x430; &#x43C;&#x435;&#x436;&#x456; &#x446;&#x456;&#x454;&#x457; &#x43A;&#x43D;&#x438;&#x433;&#x438;. &#x422;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43C;&#x430;&#x439;&#x442;&#x435; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;, &#x449;&#x43E; &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454;&#x442;&#x435; &#x440;&#x44F;&#x434;&#x43A;&#x438;, &#x43E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x434;&#x43E; &#x43E;&#x434;&#x43D;&#x456;&#x454;&#x457; &#x444;&#x43E;&#x440;&#x43C;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> normalized = values.map(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">text</span>) </span>{
    <span class="hljs-keyword">return</span> text.normalize();
});

normalized.sort(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">first, second</span>) </span>{
    <span class="hljs-keyword">if</span> (first &lt; second) {
        <span class="hljs-keyword">return</span> <span class="hljs-number">-1</span>;
    } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (first === second) {
        <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
    } <span class="hljs-keyword">else</span> {
        <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
    }
});
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x454; &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432; <code>values</code> &#x443; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x456;, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x432;&#x456;&#x434;&#x441;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439;. &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x456;&#x434;&#x441;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x440;&#x438;&#x433;&#x456;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>normalize()</code> &#x44F;&#x43A; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443; <em>&#x443;&#x43C;&#x43E;&#x432;&#x438;</em>, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js">values.sort(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">first, second</span>) </span>{
    <span class="hljs-keyword">var</span> firstNormalized = first.normalize(),
        secondNormalized = second.normalize();

    <span class="hljs-keyword">if</span> (firstNormalized &lt; secondNormalized) {
        <span class="hljs-keyword">return</span> <span class="hljs-number">-1</span>;
    } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (firstNormalized === secondNormalized) {
        <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
    } <span class="hljs-keyword">else</span> {
        <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
    }
});
</code></pre>
<p>&#x41F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x438;&#x43C;&#x43E; &#x449;&#x435; &#x440;&#x430;&#x437;, &#x449;&#x43E; &#x43D;&#x430;&#x439;&#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x448;&#x438;&#x43C; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x43E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;, <code>first</code> &#x442;&#x430; <code>second</code>, &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;. &#x426;&#x456; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x444;&#x43E;&#x440;&#x43C;&#x443; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, NFC, &#x430;&#x43B;&#x435; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x456;&#x43D;&#x448;&#x443;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js">values.sort(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">first, second</span>) </span>{
    <span class="hljs-keyword">var</span> firstNormalized = first.normalize(<span class="hljs-string">&quot;NFD&quot;</span>),
        secondNormalized = second.normalize(<span class="hljs-string">&quot;NFD&quot;</span>);

    <span class="hljs-keyword">if</span> (firstNormalized &lt; secondNormalized) {
        <span class="hljs-keyword">return</span> <span class="hljs-number">-1</span>;
    } <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (firstNormalized === secondNormalized) {
        <span class="hljs-keyword">return</span> <span class="hljs-number">0</span>;
    } <span class="hljs-keyword">else</span> {
        <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
    }
});
</code></pre>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x442;&#x443;&#x440;&#x431;&#x443;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44F; &#x43F;&#x440;&#x43E; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44E; Unicode &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435; &#x442;&#x43E;&#x434;&#x456;, &#x43D;&#x430;&#x43F;&#x435;&#x432;&#x43D;&#x43E;, &#x446;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43C;&#x430;&#x442;&#x438; &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x410;&#x43B;&#x435; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43A;&#x43E;&#x43B;&#x438;&#x441;&#x44C; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x43A;&#x43E;&#x434;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;, &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>normalize()</code> &#x441;&#x442;&#x430;&#x43D;&#x435; &#x432;&#x430;&#x43C; &#x443; &#x43D;&#x430;&#x433;&#x43E;&#x434;&#x456;.</p>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x2014; &#x43D;&#x435; &#x454;&#x434;&#x438;&#x43D;&#x456; &#x43F;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x456; ECMAScript 6 &#x432;&#x43F;&#x440;&#x43E;&#x432;&#x430;&#x434;&#x436;&#x443;&#x454; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438; Unicode. &#x421;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x440;&#x43E;&#x43F;&#x43E;&#x43D;&#x443;&#x454; &#x434;&#x432;&#x430; &#x43D;&#x43E;&#x432;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443;.</p>
<h3 id="&#x43E;&#x43F;&#x446;&#x456;&#x44F;-&#x43F;&#x43E;&#x448;&#x443;&#x43A;&#x443;-flag-u-&#x432;-&#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445;-&#x432;&#x438;&#x440;&#x430;&#x437;&#x430;&#x445;">&#x41E;&#x43F;&#x446;&#x456;&#x44F; &#x43F;&#x43E;&#x448;&#x443;&#x43A;&#x443; (flag) u &#x432; &#x420;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x412;&#x438;&#x440;&#x430;&#x437;&#x430;&#x445;</h3>
<p>&#x417;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x438;&#x445; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438;. &#x410;&#x43B;&#x435; &#x442;&#x440;&#x435;&#x431;&#x430; &#x43F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x430;&#x442;&#x438;, &#x449;&#x43E; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; 16-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x456; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x456; &#x441;&#x43B;&#x43E;&#x432;&#x430;, &#x434;&#x435; &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x454; &#x43E;&#x434;&#x438;&#x43D; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;. &#x429;&#x43E;&#x431; &#x437;&#x430;&#x440;&#x430;&#x434;&#x438;&#x442;&#x438; &#x446;&#x456;&#x439; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x456;, ECMAScript 6 &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43E;&#x43F;&#x446;&#x456;&#x44E; &#x43F;&#x43E;&#x448;&#x443;&#x43A;&#x443; <code>u</code> &#x434;&#x43B;&#x44F; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x437; Unicode.</p>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x43C;&#x430;&#x454; &#x43E;&#x43F;&#x446;&#x456;&#x44E; <code>u</code>, &#x442;&#x43E; &#x432;&#x456;&#x43D; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x441;&#x442;&#x430;&#x43D; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438;, &#x430; &#x43D;&#x435; &#x437; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x441;&#x43B;&#x43E;&#x432;&#x430;&#x43C;&#x438;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x432;&#x436;&#x435;, &#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x441;&#x443;&#x440;&#x43E;&#x433;&#x430;&#x442;&#x43D;&#x438;&#x445; &#x43F;&#x430;&#x440; &#x432; &#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x438;&#x441;&#x44C; &#x44F;&#x43A; &#x442;&#x440;&#x435;&#x431;&#x430;. &#x42F;&#x43A; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435;&#x43C;&#x43E; &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> text = <span class="hljs-string">&quot;&#x20BB7;&quot;</span>;

<span class="hljs-built_in">console</span>.log(text.length);           <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-regexp">/^.$/</span>.test(text));      <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-regexp">/^.$/u</span>.test(text));     <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x420;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; <code>/^.$/</code> &#x43D;&#x435; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x436;&#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430;, &#x44F;&#x43A;&#x438;&#x439; &#x431;&#x438; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x432;&#x441;&#x44F; &#x437; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443;. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x438;&#x439; &#x431;&#x435;&#x437; &#x43E;&#x43F;&#x446;&#x456;&#x457; <code>u</code>, &#x446;&#x435;&#x439; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x456; &#x441;&#x43B;&#x43E;&#x432;&#x430;, &#x442;&#x43E;&#x43C;&#x443; &#x42F;&#x43F;&#x43E;&#x43D;&#x441;&#x44C;&#x43A;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; (&#x44F;&#x43A;&#x456;&#x439; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x434;&#x432;&#x43E;&#x43C;&#x430; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x441;&#x43B;&#x43E;&#x432;&#x430;&#x43C;&#x438;) &#x43D;&#x435; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;. &#x41A;&#x43E;&#x43B;&#x438; &#x436; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x43F;&#x446;&#x456;&#x44F; <code>u</code>, &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x445; &#x441;&#x43B;&#x456;&#x432; &#x456; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x42F;&#x43F;&#x43E;&#x43D;&#x441;&#x44C;&#x43A;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;.</p>
<p>&#x41D;&#x430; &#x436;&#x430;&#x43B;&#x44C;, ECMAScript 6 &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x445; &#x43F;&#x443;&#x43D;&#x43A;&#x442;&#x456;&#x432; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x430;&#x43B;&#x435; &#x437; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E;&#x44E; &#x43E;&#x43F;&#x446;&#x456;&#x454;&#x44E; <code>u</code>, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437;, &#x449;&#x43E;&#x431; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x446;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">codePointLength</span>(<span class="hljs-params">text</span>) </span>{
    <span class="hljs-keyword">var</span> result = text.match(<span class="hljs-regexp">/[\s\S]/gu</span>);
    <span class="hljs-keyword">return</span> result ? result.length : <span class="hljs-number">0</span>;
}

<span class="hljs-built_in">console</span>.log(codePointLength(<span class="hljs-string">&quot;abc&quot;</span>));    <span class="hljs-comment">// 3</span>
<span class="hljs-built_in">console</span>.log(codePointLength(<span class="hljs-string">&quot;&#x20BB7;bc&quot;</span>));   <span class="hljs-comment">// 3</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>match()</code>, &#x449;&#x43E;&#x431; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x442;&#x438; <code>text</code> &#x43D;&#x430; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x431;&#x456;&#x43B;&#x456;&#x432; &#x456; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x431;&#x456;&#x43B;&#x456;&#x432;, &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x430;&#x43D;&#x43E; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x442;&#x430; &#x437; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x43E;&#x44E; Unicode. &#x420;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437;&#x431;&#x456;&#x433;&#x456;&#x432;, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x430;&#x44F;&#x432;&#x43D;&#x438;&#x439; &#x445;&#x43E;&#x447;&#x430; &#x431; &#x43E;&#x434;&#x438;&#x43D; &#x437;&#x431;&#x456;&#x433;, &#x442;&#x43E; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x431;&#x443;&#x434;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x43C; &#x43A;&#x43E;&#x434;&#x456;&#x432; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443;. &#x412; Unicode, &#x440;&#x44F;&#x434;&#x43A;&#x438; <code>&quot;abc&quot;</code> &#x442;&#x430; <code>&quot;&#x20BB7;bc&quot;</code> &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x442;&#x440;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x431;&#x443;&#x434;&#x435; &#x442;&#x440;&#x438;.</p>
<p>W&gt; &#x414;&#x430;&#x43D;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;, &#x430;&#x43B;&#x435; &#x43D;&#x435; &#x434;&#x443;&#x436;&#x435; &#x448;&#x432;&#x438;&#x434;&#x43A;&#x43E;, &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x43E; &#x43A;&#x43E;&#x43B;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43E; &#x434;&#x43E;&#x432;&#x433;&#x438;&#x445; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;. &#x422;&#x43E;&#x43C;&#x443; &#x43D;&#x430;&#x43C;&#x430;&#x433;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44F; &#x437;&#x43C;&#x435;&#x43D;&#x448;&#x438;&#x442;&#x438; &#x43F;&#x456;&#x434;&#x440;&#x430;&#x445;&#x443;&#x43D;&#x43E;&#x43A; &#x43A;&#x43E;&#x434;&#x456;&#x432;, &#x44F;&#x43A;&#x449;&#x43E; &#x446;&#x435; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;. &#x41D;&#x430; &#x449;&#x430;&#x441;&#x442;&#x44F;, ECMAScript 7 &#x431;&#x443;&#x434;&#x435; &#x43C;&#x430;&#x442;&#x438; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43F;&#x456;&#x434;&#x440;&#x430;&#x445;&#x443;&#x43D;&#x43A;&#x443; &#x43A;&#x43E;&#x434;&#x456;&#x432;.</p>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43E;&#x43F;&#x446;&#x456;&#x44F; <code>u</code> &#x454; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x43E;&#x44E;, &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x457;&#x457; &#x432; JavaScript &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x445;, &#x44F;&#x43A;&#x456; &#x43D;&#x435; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x456; &#x437; ECMAScript 6 &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x443; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;. &#x41D;&#x430;&#x439;&#x43D;&#x435;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x456;&#x448;&#x438;&#x43C; &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x438;, &#x447;&#x438; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x43F;&#x446;&#x456;&#x44F; <code>u</code> &#x431;&#x443;&#x434;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x43D;&#x430; &#x43A;&#x448;&#x442;&#x430;&#x43B;&#x442; &#x446;&#x456;&#x454;&#x457;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">hasRegExpU</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">try</span> {
        <span class="hljs-keyword">var</span> pattern = <span class="hljs-keyword">new</span> <span class="hljs-built_in">RegExp</span>(<span class="hljs-string">&quot;.&quot;</span>, <span class="hljs-string">&quot;u&quot;</span>);
        <span class="hljs-keyword">return</span> <span class="hljs-literal">true</span>;
    } <span class="hljs-keyword">catch</span> (ex) {
        <span class="hljs-keyword">return</span> <span class="hljs-literal">false</span>;
    }
}
</code></pre>
<p>&#x426;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>RegExp</code>, &#x449;&#x43E;&#x431; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x43E;&#x43F;&#x446;&#x456;&#x44E; <code>u</code> &#x44F;&#x43A; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x441;&#x442;&#x430;&#x440;&#x438;&#x43C;&#x438; JavaScript &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x43C;&#x438;, &#x430;&#x43B;&#x435; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; <code>u</code> &#x43D;&#x435; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;.</p>
<p>I&gt; &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E;, &#x449;&#x43E;&#x431; &#x432;&#x430;&#x448; &#x43A;&#x43E;&#x434; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x432; &#x437;&#x456; &#x441;&#x442;&#x430;&#x440;&#x438;&#x43C;&#x438; JavaScript &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x43C;&#x438;, &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x439;&#x442;&#x435; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>RegExp</code> &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43E;&#x43F;&#x446;&#x456;&#x457; <code>u</code>. &#x426;&#x435; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x43D;&#x438;&#x43A;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x438;&#x445; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A; &#x456; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x447;&#x438; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x43F;&#x446;&#x456;&#x44F; <code>u</code>&#x431;&#x435;&#x437; &#x441;&#x43A;&#x430;&#x441;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x443;.</p>
<h2 id="&#x456;&#x43D;&#x448;&#x456;-&#x437;&#x43C;&#x456;&#x43D;&#x438;-&#x434;&#x43B;&#x44F;-&#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;">&#x406;&#x43D;&#x448;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x434;&#x43B;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;</h2>
<p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; JavaScript &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x432;&#x456;&#x434;&#x441;&#x442;&#x430;&#x432;&#x430;&#x432; &#x432;&#x456;&#x434; &#x430;&#x43D;&#x430;&#x43B;&#x43E;&#x433;&#x456;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x432; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432;&#x430;&#x445;. &#x422;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432; ECMAScript 5 &#x440;&#x44F;&#x434;&#x43A;&#x438;, &#x43D;&#x430;&#x440;&#x435;&#x448;&#x442;&#x456;, &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43B;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>trim()</code>. ECMAScript 6 &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454; &#x440;&#x43E;&#x437;&#x432;&#x438;&#x432;&#x430;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B; JavaScript &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438;.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;-&#x434;&#x43B;&#x44F;-&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;-&#x43F;&#x456;&#x434;&#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;">&#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x456;&#x434;&#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;</h3>
<p>&#x417; &#x442;&#x43E;&#x433;&#x43E; &#x447;&#x430;&#x441;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; JavaScript &#x431;&#x443;&#x432; &#x432;&#x43F;&#x435;&#x440;&#x448;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x439;, &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>indexOf()</code> &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x430;. ECMAScript 6 &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x442;&#x440;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x434;&#x43B;&#x44F; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x446;&#x456;&#x454;&#x457; &#x434;&#x456;&#x457;:</p>
<ul>
<li>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>includes()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>true</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x434;&#x430;&#x43D;&#x438;&#x439; &#x442;&#x435;&#x441;&#x442; &#x437;&#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x438;&#x439; &#x434;&#x435;&#x456;&#x43D;&#x434;&#x435; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443;. &#x422;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>false</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x456;.</li>
<li>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>startsWith()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>true</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x434;&#x430;&#x43D;&#x438;&#x439; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x437;&#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x43E; &#x43D;&#x430; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x422;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>false</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x456;.</li>
<li>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>endsWith()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>true</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x434;&#x430;&#x43D;&#x438;&#x439; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x437;&#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x43E; &#x443; &#x43A;&#x456;&#x43D;&#x446;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x422;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>false</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x456;.</li>
</ul>
<p>&#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x437; &#x446;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x434;&#x432;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;: &#x442;&#x435;&#x43A;&#x441;&#x442;, &#x44F;&#x43A;&#x438;&#x439; &#x442;&#x440;&#x435;&#x431;&#x430; &#x437;&#x43D;&#x430;&#x439;&#x442;&#x438;, &#x442;&#x430; &#x43D;&#x435;&#x43E;&#x431;&#x43E;&#x432;&apos;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x456; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x437; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x442;&#x440;&#x435;&#x431;&#x430; &#x448;&#x443;&#x43A;&#x430;&#x442;&#x438;. &#x41A;&#x43E;&#x43B;&#x438; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;, <code>includes()</code> &#x442;&#x430; <code>startsWith()</code> &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x43F;&#x43E;&#x448;&#x443;&#x43A; &#x437; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443;, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; <code>endsWith()</code> &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x448;&#x443;&#x43A;&#x430;&#x442;&#x438; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x440;&#x456;&#x432;&#x43D;&#x438;&#x439; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x43C;&#x456;&#x43D;&#x443;&#x441; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;; &#x43A;&#x43E;&#x43B;&#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x435; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x43E;, <code>includes()</code> &#x442;&#x430; <code>startsWith()</code> &#x448;&#x443;&#x43A;&#x430;&#x44E;&#x442;&#x44C; &#x437; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430;, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; <code>endsWith()</code> &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x437; &#x43A;&#x456;&#x43D;&#x446;&#x44F;. &#x41A;&#x430;&#x436;&#x443;&#x447;&#x438; &#x456;&#x43D;&#x430;&#x43A;&#x448;&#x435;, &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x437;&#x43C;&#x435;&#x43D;&#x448;&#x443;&#x454; &#x434;&#x456;&#x430;&#x43F;&#x430;&#x437;&#x43E;&#x43D; &#x43F;&#x43E;&#x448;&#x443;&#x43A;&#x443; &#x432; &#x440;&#x44F;&#x434;&#x43A;&#x443;. &#x41E;&#x441;&#x44C; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;&#x432; &#x446;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x432; &#x434;&#x456;&#x457;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> msg = <span class="hljs-string">&quot;Hello world!&quot;</span>;

<span class="hljs-built_in">console</span>.log(msg.startsWith(<span class="hljs-string">&quot;Hello&quot;</span>));       <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(msg.endsWith(<span class="hljs-string">&quot;!&quot;</span>));             <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(msg.includes(<span class="hljs-string">&quot;o&quot;</span>));             <span class="hljs-comment">// true</span>

<span class="hljs-built_in">console</span>.log(msg.startsWith(<span class="hljs-string">&quot;o&quot;</span>));           <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(msg.endsWith(<span class="hljs-string">&quot;world!&quot;</span>));        <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(msg.includes(<span class="hljs-string">&quot;x&quot;</span>));             <span class="hljs-comment">// false</span>

<span class="hljs-built_in">console</span>.log(msg.startsWith(<span class="hljs-string">&quot;o&quot;</span>, <span class="hljs-number">4</span>));        <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(msg.endsWith(<span class="hljs-string">&quot;o&quot;</span>, <span class="hljs-number">8</span>));          <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(msg.includes(<span class="hljs-string">&quot;o&quot;</span>, <span class="hljs-number">8</span>));          <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x412; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x445; &#x442;&#x440;&#x44C;&#x43E;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x445; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E;, &#x442;&#x43E;&#x436; &#x43F;&#x43E;&#x448;&#x443;&#x43A; &#x432;&#x435;&#x434;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E; &#x432;&#x441;&#x456;&#x439; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x41E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x442;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x44E;&#x442;&#x44C; &#x43B;&#x438;&#x448;&#x435; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>msg.startsWith(&quot;o&quot;, 4)</code> &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x448;&#x443;&#x43A;&#x430;&#x442;&#x438; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; 4 &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>msg</code> (&#x449;&#x43E; &#x454; &quot;o&quot; &#x432; &quot;Hello&quot;); &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>msg.endsWith(&quot;o&quot;, 8)</code> &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x448;&#x443;&#x43A;&#x430;&#x442;&#x438; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; 4, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; <code>8</code> &#x432;&#x456;&#x434;&#x43D;&#x456;&#x43C;&#x430;&#x454;&#x43C;&#x43E; &#x432;&#x456;&#x434; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x430; (12); &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>msg.includes(&quot;o&quot;, 8)</code> &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x448;&#x443;&#x43A;&#x430;&#x442;&#x438; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; 8 (&#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &quot;r&quot; &#x432; &quot;world&quot;).</p>
<p>&#x41D;&#x435; &#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x446;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x442;&#x44C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x456;&#x434;&#x440;&#x44F;&#x434;&#x43A;&#x430; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443; &#x43B;&#x435;&#x433;&#x448;&#x438;&#x43C;, &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x437; &#x43D;&#x438;&#x445; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43B;&#x438;&#x448;&#x435; &#x431;&#x443;&#x43B;&#x435;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x437;&#x43D;&#x430;&#x439;&#x442;&#x438; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x443; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x44E; &#x43F;&#x456;&#x434;&#x440;&#x44F;&#x434;&#x43A;&#x430; &#x432; &#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x442;&#x440;&#x435;&#x431;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>indexOf()</code> &#x430;&#x431;&#x43E; <code>lastIndexOf()</code>.</p>
<p>W&gt; &#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>startsWith()</code>, <code>endsWith()</code> &#x442;&#x430; <code>includes()</code> &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x441;&#x442;&#x435; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;. &#x41D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; <code>indexOf()</code> &#x442;&#x430; <code>lastIndexOf()</code>, &#x44F;&#x43A;&#x456; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x44E;&#x442;&#x44C; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x432; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x430; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x448;&#x443;&#x43A;&#x430;&#x44E;&#x442;&#x44C; &#x446;&#x435;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-repeat">&#x41C;&#x435;&#x442;&#x43E;&#x434; repeat()</h3>
<p>ECMAScript 6 &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x434;&#x43E;&#x434;&#x430;&#x454; &#x434;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>repeat()</code>, &#x44F;&#x43A;&#x438;&#x439; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x440;&#x456;&#x432;&#x43D;&#x435; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x412;&#x456;&#x43D; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43E;&#x440;&#x438;&#x433;&#x456;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x439; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x440;&#x430;&#x437;&#x456;&#x432;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;x&quot;</span>.repeat(<span class="hljs-number">3</span>));         <span class="hljs-comment">// &quot;xxx&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;hello&quot;</span>.repeat(<span class="hljs-number">2</span>));     <span class="hljs-comment">// &quot;hellohello&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;abc&quot;</span>.repeat(<span class="hljs-number">4</span>));       <span class="hljs-comment">// &quot;abcabcabcabc&quot;</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43D;&#x430;&#x434;&#x430;&#x454; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43D;&#x430;&#x434;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43C; &#x43F;&#x440;&#x438; &#x43C;&#x430;&#x43D;&#x456;&#x43F;&#x443;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x43C;. &#x426;&#x435; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x432; &#x456;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x445; &#x434;&#x43B;&#x44F; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x443;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x432;&#x456;&#x434;&#x441;&#x442;&#x443;&#x43F;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x431;&#x456;&#x43B;&#x456;&#x432;</span>
<span class="hljs-keyword">var</span> indent = <span class="hljs-string">&quot; &quot;</span>.repeat(<span class="hljs-number">4</span>),
    indentLevel = <span class="hljs-number">0</span>;

<span class="hljs-comment">// &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x437;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x443;&#x454;&#x442;&#x435; &#x432;&#x456;&#x434;&#x441;&#x442;&#x443;&#x43F;</span>
<span class="hljs-keyword">var</span> newIndent = indent.repeat(++indentLevel);
</code></pre>
<p>&#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>repeat()</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x44C; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x437; &#x447;&#x43E;&#x442;&#x438;&#x440;&#x43C;&#x430; &#x43F;&#x440;&#x43E;&#x431;&#x456;&#x43B;&#x430;&#x43C;&#x438;, &#x430; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>indentLevel</code> &#x431;&#x443;&#x434;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x432;&#x430;&#x442;&#x438; &#x440;&#x456;&#x432;&#x435;&#x43D;&#x44C; &#x432;&#x456;&#x434;&#x441;&#x442;&#x443;&#x43F;&#x456;&#x432;. &#x422;&#x435;&#x43F;&#x435;&#x440; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; <code>repeat()</code> &#x437;&#x456; &#x437;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435;&#x43D;&#x438;&#x43C; <code>indentLevel</code>, &#x449;&#x43E;&#x431; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x456;&#x434;&#x441;&#x442;&#x443;&#x43F;&#x456;&#x432;.</p>
<p>ECMAScript 6 &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43D;&#x430;&#x434;&#x430;&#x454; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x434;&#x43E; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x438;&#x434;&#x456;&#x43B;&#x438;&#x442;&#x438; &#x432; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x443; &#x43A;&#x430;&#x442;&#x435;&#x433;&#x43E;&#x440;&#x456;&#x44E;. &#x41D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x437; &#x43D;&#x438;&#x445;.</p>
<h2 id="&#x456;&#x43D;&#x448;&#x456;-&#x437;&#x43C;&#x456;&#x43D;&#x438;-&#x443;-&#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445;-&#x432;&#x438;&#x440;&#x430;&#x437;&#x430;&#x445;">&#x406;&#x43D;&#x448;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x443; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x430;&#x445;</h2>
<p>&#x420;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x430; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438; &#x432; JavaScript, &#x456; &#x44F;&#x43A; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x430; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x43C;&#x43E;&#x432;&#x438;, &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x456;&#x441;&#x442;&#x43E;&#x442;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x443; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x445; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F;&#x445;. ECMAScript 6 &#x43F;&#x440;&#x43E;&#x43F;&#x43E;&#x43D;&#x443;&#x454; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x43F;&#x43E;&#x43A;&#x440;&#x430;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;, &#x43F;&#x440;&#x438;&#x43D;&#x430;&#x439;&#x43C;&#x43D;&#x456;, &#x449;&#x43E;&#x431; &#x439;&#x442;&#x438; &#x43F;&#x43E;&#x440;&#x443;&#x447; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438;.</p>
<h3 id="&#x43E;&#x43F;&#x446;&#x456;&#x44F;-flag-y-&#x434;&#x43B;&#x44F;-&#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445;-&#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;">&#x41E;&#x43F;&#x446;&#x456;&#x44F; (flag) <code>y</code> &#x434;&#x43B;&#x44F; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;</h3>
<p>ECMAScript 6 &#x437;&#x440;&#x43E;&#x431;&#x438;&#x432; &#x43E;&#x43F;&#x446;&#x456;&#x44E; <code>y</code> &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43E;&#x43C; flag &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x432;&#x43E;&#x43D;&#x430; &#x431;&#x443;&#x43B;&#x430; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x432;&#x430;&#x434;&#x436;&#x435;&#x43D;&#x430; &#x432; Firefox &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x440;&#x43E;&#x43F;&#x440;&#x456;&#x454;&#x442;&#x430;&#x440;&#x43E;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x43E;&#x43F;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43E;&#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;. &#x41E;&#x43F;&#x446;&#x456;&#x44F; <code>y</code> &#x441;&#x442;&#x43E;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A;&#x43E;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;, &#x44F;&#x43A; <code>sticky</code>, &#x44F;&#x43A;&#x430; &#x43A;&#x430;&#x436;&#x435; &#x43F;&#x43E;&#x448;&#x443;&#x43A;&#x443; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x438; &#x448;&#x443;&#x43A;&#x430;&#x442;&#x438; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x432; &#x440;&#x44F;&#x434;&#x43A;&#x443; &#x437; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x457;, &#x437;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E;&#x457; &#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>lastIndex</code> &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;. &#x42F;&#x43A;&#x449;&#x43E; &#x432; &#x446;&#x456;&#x439; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x457; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x437;&#x431;&#x456;&#x433;&#x456;&#x432;, &#x442;&#x43E; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x437;&#x443;&#x43F;&#x438;&#x43D;&#x44F;&#x454; &#x43F;&#x43E;&#x448;&#x443;&#x43A; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439;. &#x429;&#x43E;&#x431; &#x43F;&#x43E;&#x431;&#x430;&#x447;&#x438;&#x442;&#x438;, &#x44F;&#x43A; &#x446;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435;&#x43C;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> text = <span class="hljs-string">&quot;hello1 hello2 hello3&quot;</span>,
    pattern = <span class="hljs-regexp">/hello\d\s?/</span>,
    result = pattern.exec(text),
    globalPattern = <span class="hljs-regexp">/hello\d\s?/g</span>,
    globalResult = globalPattern.exec(text),
    stickyPattern = <span class="hljs-regexp">/hello\d\s?/y</span>,
    stickyResult = stickyPattern.exec(text);

<span class="hljs-built_in">console</span>.log(result[<span class="hljs-number">0</span>]);         <span class="hljs-comment">// &quot;hello1 &quot;</span>
<span class="hljs-built_in">console</span>.log(globalResult[<span class="hljs-number">0</span>]);   <span class="hljs-comment">// &quot;hello1 &quot;</span>
<span class="hljs-built_in">console</span>.log(stickyResult[<span class="hljs-number">0</span>]);   <span class="hljs-comment">// &quot;hello1 &quot;</span>

pattern.lastIndex = <span class="hljs-number">1</span>;
globalPattern.lastIndex = <span class="hljs-number">1</span>;
stickyPattern.lastIndex = <span class="hljs-number">1</span>;

result = pattern.exec(text);
globalResult = globalPattern.exec(text);
stickyResult = stickyPattern.exec(text);

<span class="hljs-built_in">console</span>.log(result[<span class="hljs-number">0</span>]);         <span class="hljs-comment">// &quot;hello1 &quot;</span>
<span class="hljs-built_in">console</span>.log(globalResult[<span class="hljs-number">0</span>]);   <span class="hljs-comment">// &quot;hello2 &quot;</span>
<span class="hljs-built_in">console</span>.log(stickyResult[<span class="hljs-number">0</span>]);   <span class="hljs-comment">// Error! stickyResult is null</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43C;&#x430;&#x454; &#x442;&#x440;&#x438; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438;. &#x412;&#x438;&#x440;&#x430;&#x437; &#x432; <code>pattern</code> &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43E;&#x43F;&#x446;&#x456;&#x439;, &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x432; <code>globalPattern</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43E;&#x43F;&#x446;&#x456;&#x44E; <code>g</code>, &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456;&#x439; <code>stickyPattern</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43E;&#x43F;&#x446;&#x456;&#x44E; <code>y</code>. &#x423; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x445; &#x442;&#x440;&#x44C;&#x43E;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x445; <code>console.log()</code>, &#x443;&#x441;&#x456; &#x442;&#x440;&#x438; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; <code>&quot;hello1 &quot;</code> (&#x437; &#x43F;&#x440;&#x43E;&#x431;&#x456;&#x43B;&#x43E;&#x43C; &#x443; &#x43A;&#x456;&#x43D;&#x446;&#x456;).</p>
<p>&#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>lastIndex</code> &#x431;&#x443;&#x43B;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x435;&#x43D;&#x43E; &#x43D;&#x430; 1 &#x443; &#x432;&#x441;&#x456;&#x445; &#x442;&#x440;&#x44C;&#x43E;&#x445; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;&#x445;, &#x43C;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;, &#x449;&#x43E; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x435;&#x43D; &#x448;&#x443;&#x43A;&#x430;&#x442;&#x438; &#x437;&#x431;&#x456;&#x433;&#x438; &#x437; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x443; &#x432;&#x441;&#x456;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x430;&#x445;. &#x420;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x431;&#x435;&#x437; &#x43E;&#x43F;&#x446;&#x456;&#x439; &#x43F;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x456;&#x433;&#x43D;&#x43E;&#x440;&#x443;&#x454; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x443; <code>lastIndex</code> &#x442;&#x430; &#x432;&#x441;&#x435; &#x449;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>&quot;hello1 &quot;</code> &#x431;&#x435;&#x437; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;. &#x420;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x437; &#x43E;&#x43F;&#x446;&#x456;&#x454;&#x44E; <code>g</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x437;&#x431;&#x456;&#x433; &#x437; <code>&quot;hello2 &quot;</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x43F;&#x43E;&#x448;&#x443;&#x43A; &#x437; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430; (<code>&quot;e&quot;</code>). &#x420;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x437; &#x43E;&#x43F;&#x446;&#x456;&#x454;&#x44E; <code>y</code> &#x43D;&#x435; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x436;&#x43E;&#x434;&#x43D;&#x438;&#x445; &#x437;&#x431;&#x456;&#x433;&#x456;&#x432;, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430;, &#x442;&#x43E;&#x43C;&#x443; <code>stickyResult</code> &#x454; <code>null</code>.</p>
<p>&#x41E;&#x43F;&#x446;&#x456;&#x44F; <code>y</code> &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432; <code>lastIndex</code> &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;. &#x42F;&#x43A;&#x449;&#x43E; &#x432; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x437;&#x431;&#x456;&#x433;&#x456;&#x432;, &#x442;&#x43E;&#x434;&#x456; <code>lastIndex</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; 0. &#x41E;&#x43F;&#x446;&#x456;&#x44F; <code>g</code> &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x44F;&#x43A; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x442;&#x443;&#x442;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> text = <span class="hljs-string">&quot;hello1 hello2 hello3&quot;</span>,
    pattern = <span class="hljs-regexp">/hello\d\s?/</span>,
    result = pattern.exec(text),
    globalPattern = <span class="hljs-regexp">/hello\d\s?/g</span>,
    globalResult = globalPattern.exec(text),
    stickyPattern = <span class="hljs-regexp">/hello\d\s?/y</span>,
    stickyResult = stickyPattern.exec(text);

<span class="hljs-built_in">console</span>.log(result[<span class="hljs-number">0</span>]);         <span class="hljs-comment">// &quot;hello1 &quot;</span>
<span class="hljs-built_in">console</span>.log(globalResult[<span class="hljs-number">0</span>]);   <span class="hljs-comment">// &quot;hello1 &quot;</span>
<span class="hljs-built_in">console</span>.log(stickyResult[<span class="hljs-number">0</span>]);   <span class="hljs-comment">// &quot;hello1 &quot;</span>

<span class="hljs-built_in">console</span>.log(pattern.lastIndex);         <span class="hljs-comment">// 0</span>
<span class="hljs-built_in">console</span>.log(globalPattern.lastIndex);   <span class="hljs-comment">// 7</span>
<span class="hljs-built_in">console</span>.log(stickyPattern.lastIndex);   <span class="hljs-comment">// 7</span>

result = pattern.exec(text);
globalResult = globalPattern.exec(text);
stickyResult = stickyPattern.exec(text);

<span class="hljs-built_in">console</span>.log(result[<span class="hljs-number">0</span>]);         <span class="hljs-comment">// &quot;hello1 &quot;</span>
<span class="hljs-built_in">console</span>.log(globalResult[<span class="hljs-number">0</span>]);   <span class="hljs-comment">// &quot;hello2 &quot;</span>
<span class="hljs-built_in">console</span>.log(stickyResult[<span class="hljs-number">0</span>]);   <span class="hljs-comment">// &quot;hello2 &quot;</span>

<span class="hljs-built_in">console</span>.log(pattern.lastIndex);         <span class="hljs-comment">// 0</span>
<span class="hljs-built_in">console</span>.log(globalPattern.lastIndex);   <span class="hljs-comment">// 14</span>
<span class="hljs-built_in">console</span>.log(stickyPattern.lastIndex);   <span class="hljs-comment">// 14</span>
</code></pre>
<p>&#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>lastIndex</code> &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; 7 &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>exec()</code> &#x442;&#x430; &#x43D;&#x430; 14 &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;, &#x44F;&#x43A; &#x434;&#x43B;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>stickyPattern</code> &#x442;&#x430;&#x43A; &#x456; &#x434;&#x43B;&#x44F; <code>globalPattern</code>.</p>
<p>&#x404; &#x434;&#x432;&#x456; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x456; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x456;, &#x44F;&#x43A;&#x456; &#x442;&#x440;&#x435;&#x431;&#x430; &#x43C;&#x430;&#x442;&#x438; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456; &#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x43D;&#x43E; &#x43E;&#x43F;&#x446;&#x456;&#x456; <code>y</code>:</p>
<ol>
<li>&#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>lastIndex</code> &#x431;&#x443;&#x434;&#x435; &#x432;&#x440;&#x430;&#x445;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438;, &#x44F;&#x43A;&#x456; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;, &#x43D;&#x430; &#x43A;&#x448;&#x442;&#x430;&#x43B;&#x442; <code>exec()</code> &#x430;&#x431;&#x43E; <code>test()</code>. &#x41F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443; &#x434;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443;, &#x44F;&#x43A; <code>match()</code>, &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443;.</li>
<li>&#x41A;&#x43E;&#x43B;&#x438; &#x43C;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x43C;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; <code>^</code> &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x448;&#x443;&#x43A; &#x437; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430;, &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x437; &#x43E;&#x43F;&#x446;&#x456;&#x454;&#x44E; <code>y</code> &#x448;&#x443;&#x43A;&#x430;&#x454; &#x437;&#x431;&#x456;&#x433;&#x438; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430; (&#x430;&#x431;&#x43E; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x43B;&#x456;&#x43D;&#x456;&#x457; &#x432; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x43B;&#x456;&#x43D;&#x456;&#x439;&#x43D;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;). &#x42F;&#x43A;&#x449;&#x43E; <code>lastIndex</code> &#x454; 0, &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; <code>^</code> &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x44F;&#x43A; &#x456; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443;. &#x42F;&#x43A;&#x449;&#x43E; <code>lastIndex</code> &#x43D;&#x435; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x430;&#x431;&#x43E; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x432; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;, &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x437; &#x43E;&#x43F;&#x446;&#x456;&#x454;&#x44E; <code>y</code> &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; &#x437;&#x431;&#x456;&#x433;.</li>
</ol>
<p>&#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x44F;&#x43A; &#x456; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x43C;&#x438; &#x43E;&#x43F;&#x446;&#x456;&#x44F;&#x43C;&#x438; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43D;&#x430;&#x44F;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43E;&#x43F;&#x446;&#x456;&#x457; <code>y</code>, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>sticky</code>. &#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x430;&#x437;&#x456; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x442;&#x438; &#x43D;&#x430;&#x44F;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>sticky</code>, &#x44F;&#x43A; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x443; &#x43A;&#x43E;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> pattern = <span class="hljs-regexp">/hello\d/y</span>;

<span class="hljs-built_in">console</span>.log(pattern.sticky);    <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x41F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x430; &#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>sticky</code> &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; <code>true</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43E;&#x43F;&#x446;&#x456;&#x44F; <code>y</code> &#x43D;&#x430;&#x44F;&#x432;&#x43D;&#x430; &#x443; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;, &#x442;&#x430; <code>false</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x456;. &#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>sticky</code> &#x454; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x44E; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x456; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x434;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x435;&#x43D;&#x43E;&#x44E; &#x432; &#x43A;&#x43E;&#x434;&#x456;.</p>
<p>&#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x44F;&#x43A; &#x43E;&#x43F;&#x446;&#x456;&#x44F; <code>u</code>, &#x43E;&#x43F;&#x446;&#x456;&#x44F; <code>y</code> &#x454; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x43E;&#x44E;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x430; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x443; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x443; &#x441;&#x442;&#x430;&#x440;&#x438;&#x445; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x445; JavaScript. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x438;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">hasRegExpY</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">try</span> {
        <span class="hljs-keyword">var</span> pattern = <span class="hljs-keyword">new</span> <span class="hljs-built_in">RegExp</span>(<span class="hljs-string">&quot;.&quot;</span>, <span class="hljs-string">&quot;y&quot;</span>);
        <span class="hljs-keyword">return</span> <span class="hljs-literal">true</span>;
    } <span class="hljs-keyword">catch</span> (ex) {
        <span class="hljs-keyword">return</span> <span class="hljs-literal">false</span>;
    }
}
</code></pre>
<p>&#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x44F;&#x43A; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x430; &#x43D;&#x430; &#x43E;&#x43F;&#x446;&#x456;&#x44E; <code>u</code>, &#x43A;&#x43E;&#x434; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>false</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x435; &#x432; &#x437;&#x43C;&#x43E;&#x437;&#x456; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x437; &#x43E;&#x43F;&#x446;&#x456;&#x454;&#x44E; <code>y</code>. &#x41F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E; &#x434;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>u</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x43C; &#x442;&#x440;&#x435;&#x431;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; <code>y</code> &#x432; &#x43A;&#x43E;&#x434;&#x456;, &#x44F;&#x43A;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x441;&#x442;&#x430;&#x440;&#x438;&#x445; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x445; JavaScript, &#x431;&#x443;&#x434;&#x44C;&#x442;&#x435; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C;&#x438;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x435; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>RegExp</code> &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x435; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437;, &#x449;&#x43E;&#x431; &#x443;&#x43D;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;.</p>
<h3 id="&#x434;&#x443;&#x431;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-regular-expressions">&#x414;&#x443;&#x431;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; Regular Expressions</h3>
<p>&#x412; ECMAScript 5, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x443;&#x431;&#x43B;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x448;&#x438; &#x434;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; <code>RegExp</code> &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> re1 = <span class="hljs-regexp">/ab/i</span>,
    re2 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">RegExp</span>(re1);
</code></pre>
<p>&#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>re2</code> &#x454; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E;&#x44E; &#x43A;&#x43E;&#x43F;&#x456;&#x454;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>re1</code>. &#x410;&#x43B;&#x435; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x441;&#x442;&#x435; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x434;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x443; <code>RegExp</code>, &#x44F;&#x43A;&#x438;&#x439; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438; &#x43E;&#x43F;&#x446;&#x456;&#x44E; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x448;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;, &#x432;&#x438; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x454;&#x442;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> re1 = <span class="hljs-regexp">/ab/i</span>,

    <span class="hljs-comment">// &#x432;&#x438;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x432; ES5 , &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x432; ES6</span>
    re2 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">RegExp</span>(re1, <span class="hljs-string">&quot;g&quot;</span>);
</code></pre>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x435; &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432; &#x43E;&#x442;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x456; ECMAScript 5, &#x432;&#x438; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x454;&#x442;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A;&#x430; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x438;&#x439;, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x454; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x43C; &#x432;&#x438;&#x440;&#x430;&#x437;&#x43E;&#x43C; . ECMAScript 6 &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454; &#x446;&#x44E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x449;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x454; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x435;&#x43D;&#x438;&#x43C; &#x442;&#x430; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x443;&#x432;&#x430;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x443; &#x43E;&#x43F;&#x446;&#x456;&#x44E;, &#x44F;&#x43A;&#x430; &#x431;&#x443;&#x434;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438;&#x441;&#x44F; &#x443; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x43C;&#x443; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> re1 = <span class="hljs-regexp">/ab/i</span>,

    <span class="hljs-comment">// &#x432;&#x438;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x432; ES5 , &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x432; ES6</span>
    re2 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">RegExp</span>(re1, <span class="hljs-string">&quot;g&quot;</span>);


<span class="hljs-built_in">console</span>.log(re1.toString());            <span class="hljs-comment">// &quot;/ab/i&quot;</span>
<span class="hljs-built_in">console</span>.log(re2.toString());            <span class="hljs-comment">// &quot;/ab/g&quot;</span>

<span class="hljs-built_in">console</span>.log(re1.test(<span class="hljs-string">&quot;ab&quot;</span>));            <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(re2.test(<span class="hljs-string">&quot;ab&quot;</span>));            <span class="hljs-comment">// true</span>

<span class="hljs-built_in">console</span>.log(re1.test(<span class="hljs-string">&quot;AB&quot;</span>));            <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(re2.test(<span class="hljs-string">&quot;AB&quot;</span>));            <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, <code>re1</code> &#x43C;&#x430;&#x454; &#x447;&#x443;&#x442;&#x43B;&#x438;&#x432;&#x443; &#x434;&#x43E; &#x440;&#x435;&#x433;&#x456;&#x441;&#x442;&#x440;&#x443; &#x43E;&#x43F;&#x446;&#x456;&#x44E; <code>i</code>, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; <code>re2</code> &#x43C;&#x430;&#x454; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43E;&#x43F;&#x446;&#x456;&#x44E; <code>g</code>. &#x41A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>RegExp</code> &#x434;&#x443;&#x431;&#x43B;&#x44E;&#x454; &#x432;&#x438;&#x440;&#x430;&#x437; &#x43F;&#x43E; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x443; <code>re1</code> &#x442;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454; &#x43E;&#x43F;&#x446;&#x456;&#x44E; <code>g</code> &#x43D;&#x430; &#x43E;&#x43F;&#x446;&#x456;&#x44E; <code>i</code>. &#x411;&#x435;&#x437; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;, <code>re2</code> &#x431;&#x443;&#x434;&#x435; &#x43C;&#x430;&#x442;&#x438; &#x442;&#x456; &#x441;&#x430;&#x43C;&#x456; &#x43E;&#x43F;&#x446;&#x456;&#x457;, &#x449;&#x43E; &#x439; <code>re1</code>.</p>
<h3 id="&#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;-flags">&#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>flags</code></h3>
<p>&#x420;&#x430;&#x437;&#x43E;&#x43C; &#x437; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43D;&#x43E;&#x432;&#x43E;&#x457; &#x43E;&#x43F;&#x446;&#x456;&#x457; &#x442;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x437;&#x430;&#x441;&#x43E;&#x431;&#x456;&#x432; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x43E;&#x43F;&#x446;&#x456;&#x44F;&#x43C;&#x438;, ECMAScript 6 &#x434;&#x43E;&#x434;&#x430;&#x454; &#x43D;&#x43E;&#x432;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x430;&#x43D;&#x443; &#x437; &#x43D;&#x438;&#x43C;&#x438;. &#x412; ECMAScript 5 &#x432;&#x438; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x442;&#x435;&#x43A;&#x441;&#x442; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>source</code>, &#x430;&#x43B;&#x435; &#x449;&#x43E;&#x431; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x43F;&#x446;&#x456;&#x457;, &#x432;&#x430;&#x43C; &#x431;&#x443;&#x43B;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43F;&#x430;&#x440;&#x441;&#x438;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430; <code>toString()</code>, &#x44F;&#x43A; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x43D;&#x438;&#x436;&#x447;&#x435;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">getFlags</span>(<span class="hljs-params">re</span>) </span>{
    <span class="hljs-keyword">var</span> text = re.toString();
    <span class="hljs-keyword">return</span> text.substring(text.lastIndexOf(<span class="hljs-string">&quot;/&quot;</span>) + <span class="hljs-number">1</span>, text.length);
}

<span class="hljs-comment">// toString() &#x454; &quot;/ab/g&quot;</span>
<span class="hljs-keyword">var</span> re = <span class="hljs-regexp">/ab/g</span>;

<span class="hljs-built_in">console</span>.log(getFlags(re));          <span class="hljs-comment">// &quot;g&quot;</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x454; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x432; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x430; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x437;&#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x456; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; <code>/</code>. &#x426;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x456; &#x454; &#x43E;&#x43F;&#x446;&#x456;&#x457;.</p>
<p>ECMAScript 6 &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x43F;&#x446;&#x456;&#x439; &#x43B;&#x435;&#x433;&#x448;&#x435;, &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x447;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>flags</code> &#x434;&#x43E; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x43E;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>source</code>. &#x41E;&#x431;&#x438;&#x434;&#x432;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x454; &#x437;&#x430;&#x441;&#x43E;&#x431;&#x430;&#x43C;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x434;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443;, &#x449;&#x43E; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x457;&#x445; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C;&#x438; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x43E; &#x437;&#x447;&#x438;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>flags</code> &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x43E;&#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432; &#x43B;&#x435;&#x433;&#x448;&#x438;&#x43C;, &#x44F;&#x43A; &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x43B;&#x430;&#x433;&#x43E;&#x434;&#x436;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x430;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x414;&#x43E;&#x434;&#x430;&#x43D;&#x430; &#x434;&#x43E; ECMAScript 6 &#x432; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44E; &#x447;&#x435;&#x440;&#x433;&#x443;, &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>flags</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x435; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x43E;&#x457; &#x43E;&#x43F;&#x446;&#x456;&#x457; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x43E;&#x457; &#x434;&#x43E; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> re = <span class="hljs-regexp">/ab/g</span>;

<span class="hljs-built_in">console</span>.log(re.source);     <span class="hljs-comment">// &quot;ab&quot;</span>
<span class="hljs-built_in">console</span>.log(re.flags);      <span class="hljs-comment">// &quot;g&quot;</span>
</code></pre>
<p>&#x41A;&#x43E;&#x434; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x432;&#x441;&#x456; &#x43E;&#x43F;&#x446;&#x456;&#x457; &#x432;&#x456;&#x434; <code>re</code> &#x442;&#x430; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x457;&#x445; &#x434;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x43D;&#x43E; &#x43B;&#x435;&#x433;&#x448;&#x438;&#x43C; &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C; &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441;, &#x43A;&#x43E;&#x43B;&#x438; &#x442;&#x435;&#x445;&#x43D;&#x456;&#x43A;&#x430; &#x446;&#x435; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>toString()</code>. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>source</code> &#x442;&#x430; <code>flags</code> &#x440;&#x430;&#x437;&#x43E;&#x43C; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x442;&#x438; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443; &#x431;&#x435;&#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x435;&#x445;&#x43D;&#x456;&#x43A; &#x437; &#x43F;&#x430;&#x440;&#x441;&#x438;&#x43D;&#x433;&#x43E;&#x43C;.</p>
<p>&#x412;&#x441;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x434;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x456; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x443;&#x442;&#x456; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456; &#x454; &#x431;&#x435;&#x437;&#x443;&#x43C;&#x43E;&#x432;&#x43D;&#x43E; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x438;&#x43C;&#x438;, &#x430;&#x43B;&#x435; ECMAScript 6 &#x43D;&#x430;&#x434;&#x430;&#x454; &#x448;&#x438;&#x440;&#x448;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438;. &#x412;&#x456;&#x43D; &#x434;&#x43E;&#x434;&#x430;&#x454; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B; &#x434;&#x43E; &#x442;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x456;, &#x449;&#x43E; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x433;&#x43D;&#x443;&#x447;&#x43A;&#x438;&#x43C;&#x438;.</p>
<h2 id="&#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x456;-&#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438;">&#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438;</h2>
<p>&#x420;&#x44F;&#x434;&#x43A;&#x438; &#x432; JavaScript&apos;s &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x434;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x438;&#x43C;&#x438; &#x432; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x43D;&#x43D;&#x456; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x43C;&#x438; &#x43C;&#x43E;&#x432;&#x430;&#x43C;&#x438;. &#x417; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; JavaScript, &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C; &#x43D;&#x435; &#x432;&#x438;&#x441;&#x442;&#x430;&#x447;&#x430;&#x43B;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x443;&#x442;&#x438;&#x445; &#x432;&#x438;&#x449;&#x435; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456;, &#x430; &#x43A;&#x43E;&#x43D;&#x43A;&#x430;&#x442;&#x435;&#x43D;&#x430;&#x446;&#x456;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x454; &#x434;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x44E;. <em>&#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438;</em> &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x447;&#x43D;&#x43E;&#x457; &#x434;&#x43B;&#x44F; &#x434;&#x43E;&#x43C;&#x435;&#x43D;&#x443; &#x43C;&#x43E;&#x432;&#x438; (DSLs), &#x449;&#x43E;&#x431; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x443; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x43D;&#x456;&#x436; &#x43C;&#x438; &#x440;&#x43E;&#x431;&#x438;&#x43C;&#x43E; &#x446;&#x435; &#x437;&#x430;&#x440;&#x430;&#x437;. DSLs &#x43C;&#x43E;&#x432;&#x430; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x447;&#x43D;&#x43E;&#x433;&#x43E;, &#x432;&#x443;&#x437;&#x44C;&#x43A;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; (&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; JavaScript, &#x44F;&#x43A;&#x438;&#x439; &#x454; &#x43C;&#x43E;&#x432;&#x43E;&#x44E; &#x448;&#x438;&#x440;&#x43E;&#x43A;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;) &#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; DSLs &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x435;&#x43D;&#x456; JavaScript &#x431;&#x443;&#x43B;&#x430; &#x434;&#x443;&#x436;&#x435; &#x431;&#x430;&#x436;&#x430;&#x43D;&#x43E;&#x44E; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; JavaScript, &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x432;&#x2019;&#x44F;&#x437;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;. &#x412;&#x456;&#x43A;&#x456; ECMAScript &#x43F;&#x440;&#x43E;&#x43F;&#x43E;&#x43D;&#x443;&#x454; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; <a href="http://wiki.ecmascript.org/doku.php?id=harmony:quasis" target="_blank">template literal strawman</a>:</p>
<blockquote>
<p>&#x426;&#x44F; &#x441;&#x445;&#x435;&#x43C;&#x430; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x44E;&#x454; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; ECMAScript &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x443;&#x43A;&#x440;&#x443;, &#x449;&#x43E;&#x431; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x438; &#x456;&#x43D;&#x448;&#x438;&#x43C; &#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x43C; &#x432;&#x43F;&#x440;&#x43E;&#x432;&#x430;&#x434;&#x436;&#x443;&#x432;&#x430;&#x442;&#x438; DSLs &#x434;&#x43B;&#x44F; &#x43B;&#x435;&#x433;&#x43A;&#x43E;&#x433;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x43F;&#x438;&#x442;&#x456;&#x432; &#x442;&#x430; &#x43C;&#x430;&#x43D;&#x456;&#x43F;&#x443;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432;, &#x44F;&#x43A;&#x456; &#x441;&#x442;&#x456;&#x439;&#x43A;&#x456; &#x434;&#x43B;&#x44F; &#x456;&#x43D;&#x2019;&#x454;&#x43A;&#x446;&#x456;&#x439; &#x442;&#x430; &#x430;&#x442;&#x430;&#x43A;, &#x44F;&#x43A; XSS, SQL &#x406;&#x43D;&#x2019;&#x454;&#x43A;&#x446;&#x456;&#x457;, &#x442;&#x430; &#x456;&#x43D;&#x448;&#x456;.</p>
</blockquote>
<p>&#x41D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456;, &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438; ECMAScript 6 &#x2014; &#x446;&#x435; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x44C; &#x443;&#x441;&#x456;&#x43C; &#x43D;&#x435;&#x434;&#x43E;&#x43B;&#x456;&#x43A;&#x430;&#x43C;, &#x44F;&#x43A;&#x456; &#x43C;&#x430;&#x432; JavaScript &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x43B;&#x430;&#x43D;&#x456; &#x437; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x432;&#x438;&#x445;&#x43E;&#x434;&#x443; ECMAScript 5:</p>
<ul>
<li><strong>&#x431;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C;</strong> &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x430; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x446;&#x456;&#x44F; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x43B;&#x456;&#x43D;&#x456;&#x439;&#x43D;&#x438;&#x445; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;;</li>
<li><strong>&#x431;&#x430;&#x437;&#x43E;&#x432;&#x435; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;</strong> &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x430;&#x43C;&#x456;&#x449;&#x443;&#x432;&#x430;&#x442;&#x438; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x437; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x445; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;;</li>
<li><strong>HTML escaping</strong> &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x442;&#x440;&#x430;&#x43D;&#x441;&#x444;&#x43E;&#x440;&#x43C;&#x443;&#x432;&#x430;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x438;, &#x449;&#x43E;&#x431; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x43E; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x438; &#x456;&#x445; &#x432; HTML.</li>
</ul>
<p>&#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x43E;&#x43C;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x443; &#x437; &#x43E;&#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; JavaScript, &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x43F;&#x440;&#x43E;&#x43F;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x440;&#x456;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;.</p>
<h3 id="&#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439;-&#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;">&#x417;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;</h3>
<p>&#x414;&#x44F;&#x43A;&#x443;&#x44E;&#x447;&#x438; &#x441;&#x432;&#x43E;&#x457;&#x439; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x442;&#x456;, &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x44F;&#x43A; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x43E;&#x442;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x456; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x43C;&#x438; &#x43B;&#x430;&#x43F;&#x43A;&#x430;&#x43C;&#x438; (<code>` </code>) &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x43E;&#x434;&#x432;&#x456;&#x439;&#x43D;&#x438;&#x445; &#x430;&#x431;&#x43E; &#x43E;&#x434;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x445;. &#x420;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435;&#x43C;&#x43E; &#x446;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> message = <span class="hljs-string">`Hello world!`</span>;

<span class="hljs-built_in">console</span>.log(message);               <span class="hljs-comment">// &quot;Hello world!&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> message);        <span class="hljs-comment">// &quot;string&quot;</span>
<span class="hljs-built_in">console</span>.log(message.length);        <span class="hljs-comment">// 12</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x449;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>message</code> &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; JavaScript. &#x412; &#x434;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x437;&#x433;&#x43E;&#x434;&#x43E;&#x43C; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x2019;&#x44F;&#x437;&#x430;&#x43D;&#x435; &#x434;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>message</code>.</p>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x443; &#x439; &#x43D;&#x430;&#x434;&#x430;&#x43B;&#x456;, &#x442;&#x43E;&#x434;&#x456; &#x442;&#x440;&#x435;&#x431;&#x430; &#x435;&#x43A;&#x440;&#x430;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x457;&#x445; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x43C; &#x441;&#x43B;&#x435;&#x448;&#x435;&#x43C; (<code>\</code>), &#x44F;&#x43A; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x430;&#x440;&#x456;&#x430;&#x43D;&#x442;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>message</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> message = <span class="hljs-string">`\`Hello\` world!`</span>;

<span class="hljs-built_in">console</span>.log(message);               <span class="hljs-comment">// &quot;`Hello` world!&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> message);        <span class="hljs-comment">// &quot;string&quot;</span>
<span class="hljs-built_in">console</span>.log(message.length);        <span class="hljs-comment">// 14</span>
</code></pre>
<p>&#x412;&#x438; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x435;&#x43A;&#x440;&#x430;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x434;&#x432;&#x456;&#x439;&#x43D;&#x456; &#x430;&#x431;&#x43E; &#x43E;&#x434;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x456; &#x43B;&#x430;&#x43F;&#x43A;&#x438; &#x432; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x456; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443;.</p>
<h3 id="&#x431;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x439;-&#x440;&#x435;&#x436;&#x438;&#x43C;">&#x411;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C;</h3>
<p>JavaScript &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x448;&#x443;&#x43A;&#x430;&#x43B;&#x438; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x432; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x437; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x432;&#x438;. &#x410;&#x43B;&#x435; &#x43A;&#x43E;&#x43B;&#x438; &#x43C;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x43C;&#x43E; &#x43F;&#x43E;&#x434;&#x432;&#x456;&#x439;&#x43D;&#x456; &#x430;&#x431;&#x43E; &#x43E;&#x434;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x456; &#x43B;&#x430;&#x43F;&#x43A;&#x438;, &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x442;&#x430;&#x448;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43D;&#x430; &#x43E;&#x434;&#x43D;&#x43E;&#x43C;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443; &#x43A;&#x43E;&#x434;&#x443;.</p>
<h4 id="&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x456;-&#x448;&#x43B;&#x44F;&#x445;&#x438;-&#x434;&#x43E;-&#x43F;&#x43E;&#x44F;&#x432;&#x438;-ecmascript-6">&#x41E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x448;&#x43B;&#x44F;&#x445;&#x438; &#x434;&#x43E; &#x43F;&#x43E;&#x44F;&#x432;&#x438; ECMAScript 6</h4>
<p>&#x414;&#x44F;&#x43A;&#x443;&#x44E;&#x447;&#x438; &#x434;&#x430;&#x432;&#x43D;&#x43E; &#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43E;&#x43C;&#x443; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x43C;&#x443; &#x431;&#x430;&#x433;&#x443;, JavaScript &#x43C;&#x430;&#x454; &#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x448;&#x43B;&#x44F;&#x445;&#x438;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x432; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43D;&#x43E;&#x432;&#x438;&#x43C; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x43C; &#x43A;&#x43E;&#x434;&#x443; &#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x439; &#x441;&#x43B;&#x435;&#x448; (<code>\</code>). &#x41E;&#x441;&#x44C;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> message = <span class="hljs-string">&quot;Multiline \
string&quot;</span>;

<span class="hljs-built_in">console</span>.log(message);       <span class="hljs-comment">// &quot;Multiline string&quot;</span>
</code></pre>
<p>&#x420;&#x44F;&#x434;&#x43E;&#x43A; <code>message</code> &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x43D;&#x43E;&#x432;&#x438;&#x445; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x456;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x439; &#x441;&#x43B;&#x435;&#x448; &#x441;&#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454;&#x442;&#x435;&#x441;&#x44F; &#x44F;&#x43A; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430;, &#x430; &#x43D;&#x435; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43E;&#x43A; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E;. &#x414;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E; &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x439;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> message = <span class="hljs-string">&quot;Multiline \n\
string&quot;</span>;

<span class="hljs-built_in">console</span>.log(message);       <span class="hljs-comment">// &quot;Multiline</span>
                            <span class="hljs-comment">//  string&quot;</span>
</code></pre>
<p>&#x426;&#x435; &#x43C;&#x430;&#x454; &#x432;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; <code>Multiline String</code> &#x43D;&#x430; &#x434;&#x432;&#x43E;&#x445; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x445; &#x443; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x441;&#x442;&#x456; JavaScript &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;, &#x430;&#x43B;&#x435;, &#x43F;&#x43E; &#x441;&#x443;&#x442;&#x456;, &#x442;&#x430;&#x43A;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x431;&#x430;&#x433;, &#x442;&#x43E;&#x43C;&#x443; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x456;&#x441;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x440;&#x430;&#x434;&#x44F;&#x442;&#x44C; &#x43D;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x442;&#x440;&#x44E;&#x43A;&#x43E;&#x43C;.</p>
<p>&#x406;&#x43D;&#x448;&#x438;&#x43C;&#x438; &#x448;&#x43B;&#x44F;&#x445;&#x430;&#x43C;&#x438; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x443; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x434;&#x43E; &#x43F;&#x43E;&#x44F;&#x432;&#x438; ECMAScript 6 &#x431;&#x443;&#x43B;&#x43E; &#x437;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x430;&#x431;&#x43E; &#x43A;&#x43E;&#x43D;&#x43A;&#x430;&#x442;&#x435;&#x43D;&#x430;&#x446;&#x456;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> message = [
    <span class="hljs-string">&quot;Multiline &quot;</span>,
    <span class="hljs-string">&quot;string&quot;</span>
].join(<span class="hljs-string">&quot;\n&quot;</span>);

<span class="hljs-keyword">let</span> message = <span class="hljs-string">&quot;Multiline \n&quot;</span> +
    <span class="hljs-string">&quot;string&quot;</span>;
</code></pre>
<p>&#x41F;&#x440;&#x43E;&#x442;&#x435; &#x443; &#x446;&#x438;&#x445; &#x432;&#x441;&#x456;&#x445; &#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x445; &#x448;&#x43B;&#x44F;&#x445;&#x430;&#x445; &#x43D;&#x435; &#x432;&#x438;&#x441;&#x442;&#x430;&#x447;&#x430;&#x43B;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x431;&#x443;&#x43B;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C;.</p>
<h4 id="&#x431;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x439;-&#x440;&#x435;&#x436;&#x438;&#x43C;-&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x43C;-&#x447;&#x438;&#x43D;&#x43E;&#x43C;">&#x411;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;</h4>
<p>&#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438; ECMAScript 6 &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x442;&#x44C; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443; &#x443; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x434;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x43B;&#x435;&#x433;&#x43A;&#x43E;&#x44E;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x43D;&#x435; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443;. &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x440;&#x43E;&#x431;&#x456;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x434;&#x435; &#x432;&#x430;&#x43C; &#x442;&#x440;&#x435;&#x431;&#x430; &#x456; &#x432;&#x456;&#x43D; &#x431;&#x443;&#x434;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x438;&#x439;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> message = <span class="hljs-string">`Multiline
string`</span>;

<span class="hljs-built_in">console</span>.log(message);           <span class="hljs-comment">// &quot;Multiline</span>
                                <span class="hljs-comment">//  string&quot;</span>
<span class="hljs-built_in">console</span>.log(message.length);    <span class="hljs-comment">// 16</span>
</code></pre>
<p>&#x423;&#x441;&#x456; &#x43F;&#x440;&#x43E;&#x431;&#x456;&#x43B;&#x438; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x430;&#x43F;&#x43E;&#x43A; &#x454; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; &#x440;&#x44F;&#x434;&#x43A;&#x430;, &#x442;&#x43E;&#x43C;&#x443; &#x431;&#x443;&#x434;&#x44C;&#x442;&#x435; &#x443;&#x432;&#x430;&#x436;&#x43D;&#x438;&#x43C;&#x438; &#x437; &#x432;&#x456;&#x434;&#x441;&#x442;&#x443;&#x43F;&#x430;&#x43C;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> message = <span class="hljs-string">`Multiline
               string`</span>;

<span class="hljs-built_in">console</span>.log(message);           <span class="hljs-comment">// &quot;Multiline</span>
                                <span class="hljs-comment">//                 string&quot;</span>
<span class="hljs-built_in">console</span>.log(message.length);    <span class="hljs-comment">// 31</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, &#x432;&#x441;&#x456; &#x43F;&#x440;&#x43E;&#x431;&#x456;&#x43B;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43C; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x43C; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x443; &#x444;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x432;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x42F;&#x43A;&#x449;&#x43E; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x437; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x432;&#x456;&#x434;&#x441;&#x442;&#x443;&#x43F;&#x430;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x441; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x442;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x438; &#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x456;&#x43C; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x443; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x43E;&#x43C;&#x443; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;, &#x430; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x442;&#x438; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x432;&#x456;&#x434;&#x441;&#x442;&#x443;&#x43F;&#x438; &#x432; &#x43D;&#x43E;&#x432;&#x438;&#x445; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x445;, &#x430; &#x441;&#x430;&#x43C;&#x435;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> html = <span class="hljs-string">`
&lt;div&gt;
    &lt;h1&gt;Title&lt;/h1&gt;
&lt;/div&gt;`</span>.trim();
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B; &#x43D;&#x430; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x43C;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x430;&#x43B;&#x435; &#x432;&#x456;&#x43D; &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x43D;&#x456;&#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x443; &#x430;&#x436; &#x434;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E;. &#x422;&#x435;&#x433;&#x438; HTML &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x456;&#x434;&#x441;&#x442;&#x443;&#x43F;&#x438; &#x434;&#x43B;&#x44F; &#x433;&#x430;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x443;, &#x430; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>trim()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x449;&#x43E;&#x431; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x438;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x456;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;.</p>
<p>A&gt; &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x431;&#x430;&#x436;&#x430;&#x454;&#x442;&#x435;, &#x432;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; <code>\n</code> &#x432; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x43E;&#x43C;&#x443; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x434;&#x435; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x430; &#x43D;&#x43E;&#x432;&#x430; &#x43B;&#x456;&#x43D;&#x456;&#x44F;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> message = <span class="hljs-string">`Multiline\nstring`</span>;
<span class="hljs-built_in">console</span>.log(message);           <span class="hljs-comment">// &quot;Multiline</span>
                                <span class="hljs-comment">//  string&quot;</span>
<span class="hljs-built_in">console</span>.log(message.length);    <span class="hljs-comment">// 16</span>
</code></pre>
<h3 id="&#x440;&#x43E;&#x431;&#x438;&#x43C;&#x43E;-&#x43F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x438;">&#x420;&#x43E;&#x431;&#x438;&#x43C;&#x43E; &#x43F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x438;</h3>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x441;&#x435;&#x43D;&#x441;&#x456;, &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x432;&#x434;&#x43E;&#x441;&#x43A;&#x43E;&#x43D;&#x430;&#x43B;&#x435;&#x43D;&#x43E;&#x44E; &#x432;&#x435;&#x440;&#x441;&#x456;&#x454;&#x44E; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x445; JavaScript &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;. &#x420;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x430; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x446;&#x44F; &#x43C;&#x456;&#x436; &#x43D;&#x438;&#x43C;&#x438; &#x44F;&#x43A;&#x440;&#x430;&#x437; &#x456; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x43E;&#x43C;&#x443; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456; <em>&#x43F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x438;</em>. &#x41F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x438; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43B;&#x44E;&#x431;&#x438;&#x439; &#x432;&#x430;&#x43B;&#x456;&#x434;&#x43D;&#x438;&#x439; JavaScript &#x432;&#x438;&#x440;&#x430;&#x437; &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; &#x456; &#x432;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x44F;&#x43A; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430;.</p>
<p>&#x41F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x438; &#x43E;&#x442;&#x43E;&#x447;&#x435;&#x43D;&#x456; &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x44E;&#x447;&#x438;&#x43C; <code>${</code> &#x456; &#x437;&#x430;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x44E;&#x447;&#x438;&#x43C; <code>}</code>, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x439; JavaScript &#x432;&#x438;&#x440;&#x430;&#x437;. &#x41D;&#x430;&#x439;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x430; &#x43F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x430; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; &#x432; &#x43F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> name = <span class="hljs-string">&quot;Nicholas&quot;</span>,
    message = <span class="hljs-string">`Hello, <span class="hljs-subst">${name}</span>.`</span>;

<span class="hljs-built_in">console</span>.log(message);       <span class="hljs-comment">// &quot;Hello, Nicholas.&quot;</span>
</code></pre>
<p>&#x41F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x430; &#x432; <code>${name}</code> &#x43C;&#x430;&#x454; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>name</code> &#x449;&#x43E;&#x431; &#x432;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; <code>name</code> &#x432; &#x440;&#x44F;&#x434;&#x43E;&#x43A; <code>message</code>. &#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>message</code> &#x43E;&#x434;&#x440;&#x430;&#x437;&#x443; &#x436; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x438;.</p>
<p>I&gt; &#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B; &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x43E;&#x457; &#x43D;&#x430;&#x44F;&#x432;&#x43D;&#x43E;&#x457; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;, &#x434;&#x43E; &#x44F;&#x43A;&#x43E;&#x457; &#x432;&#x456;&#x43D; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x438;&#x442;&#x44C;. &#x421;&#x43F;&#x440;&#x43E;&#x431;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x432; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x43E;&#x43C;&#x443; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456; &#x43D;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x434;&#x435; &#x434;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x44F;&#x43A; &#x443; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443;, &#x442;&#x430;&#x43A; &#x456; &#x43D;&#x435;&#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;.</p>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x441;&#x456; &#x43F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x438; &#x454; JavaScript &#x432;&#x438;&#x440;&#x430;&#x437;&#x430;&#x43C;&#x438;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x438; &#x43D;&#x435; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x44C; &#x430;&#x431;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> count = <span class="hljs-number">10</span>,
    price = <span class="hljs-number">0.25</span>,
    message = <span class="hljs-string">`<span class="hljs-subst">${count}</span> items cost $<span class="hljs-subst">${(count * price).toFixed(2)}</span>.`</span>;

<span class="hljs-built_in">console</span>.log(message);       <span class="hljs-comment">// &quot;10 items cost $2.50.&quot;</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443;. &#x414;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; <code>count</code> &#x442;&#x430; <code>price</code> &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E;&#x431; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;, &#x430; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; &#x434;&#x432;&#x43E;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43A;&#x43E;&#x43C;&#x438; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; <code>.toFixed()</code>. &#x417;&#x43D;&#x430;&#x43A; &#x434;&#x43E;&#x43B;&#x430;&#x440;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x44E; &#x43F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x43E;&#x44E; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x454;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x44E;&#x447;&#x43E;&#x457; &#x444;&#x456;&#x433;&#x443;&#x440;&#x43D;&#x43E;&#x457; &#x434;&#x443;&#x436;&#x43A;&#x438;.</p>
<h3 id="&#x442;&#x435;&#x433;&#x43E;&#x432;&#x430;&#x43D;&#x456;-&#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x438;">&#x422;&#x435;&#x433;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x438;</h3>
<p>&#x412;&#x438; &#x43F;&#x43E;&#x431;&#x430;&#x447;&#x438;&#x43B;&#x438; &#x44F;&#x43A; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x442;&#x430; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x431;&#x435;&#x437; &#x43A;&#x43E;&#x43D;&#x43A;&#x430;&#x442;&#x435;&#x43D;&#x430;&#x446;&#x456;&#x457;. &#x410;&#x43B;&#x435; &#x441;&#x43F;&#x440;&#x430;&#x432;&#x436;&#x43D;&#x44E; &#x441;&#x438;&#x43B;&#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;&#x432; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x447;&#x443;&#x442;&#x438; &#x437; &#x442;&#x435;&#x433;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;&#x43C;&#x438;. <em>&#x422;&#x435;&#x433; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x443;</em> &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454; &#x442;&#x440;&#x430;&#x43D;&#x441;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; &#x456; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x442;&#x435;&#x433; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430;, &#x43E;&#x434;&#x440;&#x430;&#x437;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x43C; <code>` </code>, &#x44F;&#x43A; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x442;&#x443;&#x442;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> message = tag<span class="hljs-string">`Hello world`</span>;
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, <code>tag</code> &#x454; &#x442;&#x435;&#x433;&#x43E;&#x43C; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x443; &#x449;&#x43E;&#x431; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x443;&#x432;&#x430;&#x442;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; <code>`Hello world` </code>.</p>
<h4 id="&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x43C;&#x43E;-&#x442;&#x435;&#x433;&#x438;">&#x412;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x43C;&#x43E; &#x442;&#x435;&#x433;&#x438;</h4>
<p>&#x41D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; <em>&#x442;&#x435;&#x433;</em> &#x446;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x44F;&#x43A;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x438; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x446;&#x456; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443;. &#x422;&#x435;&#x433; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x434;&#x430;&#x43D;&#x43D;&#x456; &#x43F;&#x440;&#x43E; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438; &#x44F;&#x43A; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x456; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x43A;&#x43E;&#x434;&#x443; &#x456; &#x43C;&#x430;&#x454; &#x437;&#x456;&#x431;&#x440;&#x430;&#x442;&#x438; &#x446;&#x456; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x440;&#x430;&#x437;&#x43E;&#x43C;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x2014; &#x446;&#x435; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; &#x44F;&#x43A; &#x457;&#x445; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x443;&#x454; JavaScript. &#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x2014; &#x446;&#x435; &#x432;&#x456;&#x434;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x457; &#x43F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x438;.</p>
<p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x442;&#x435;&#x433;&#x456;&#x432; &#x44F;&#x43A; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;, &#x44F;&#x43A; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x43D;&#x438;&#x436;&#x447;&#x435;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x43B;&#x435;&#x433;&#x448;&#x438;&#x442;&#x438; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443; &#x437; &#x434;&#x430;&#x43D;&#x438;&#x43C;&#x438;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">tag</span>(<span class="hljs-params">literals, ...substitutions</span>) </span>{
    <span class="hljs-comment">// &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x440;&#x44F;&#x434;&#x43E;&#x43A;</span>
}
</code></pre>
<p>&#x429;&#x43E;&#x431; &#x43A;&#x440;&#x430;&#x449;&#x435; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438; &#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x442;&#x435;&#x433;&#x456;&#x432;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435;&#x43C;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> count = <span class="hljs-number">10</span>,
    price = <span class="hljs-number">0.25</span>,
    message = passthru<span class="hljs-string">`<span class="hljs-subst">${count}</span> items cost $<span class="hljs-subst">${(count * price).toFixed(2)}</span>.`</span>;
</code></pre>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x437; &#x43D;&#x430;&#x437;&#x432;&#x43E;&#x44E; <code>passthru()</code>, &#x442;&#x43E; &#x432;&#x43E;&#x43D;&#x430; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x454; &#x442;&#x440;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;. &#x41F;&#x43E;-&#x43F;&#x435;&#x440;&#x448;&#x435;, &#x432;&#x43E;&#x43D;&#x430; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x454; &#x43C;&#x430;&#x441;&#x438;&#x432; <code>literals</code>, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;:</p>
<ul>
<li>&#x43F;&#x443;&#x441;&#x442;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x44E; &#x43F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x43E;&#x44E; (<code>&quot;&quot;</code>);</li>
<li>&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x457; &#x456; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x44E; &#x43F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x43E;&#x44E; (<code>&quot; items cost $&quot;</code>);</li>
<li>&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x457; &#x43F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x438; (<code>&quot;.&quot;</code>).</li>
</ul>
<p>&#x41D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x431;&#x443;&#x434;&#x435; <code>10</code>, &#x449;&#x43E; &#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>count</code>. &#x412;&#x456;&#x43D; &#x441;&#x442;&#x430;&#x454; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; <code>substitutions</code>. &#x41E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x431;&#x443;&#x434;&#x435; <code>&quot;2.50&quot;</code>, &#x449;&#x43E; &#x454; &#x437;&#x434;&#x43E;&#x431;&#x443;&#x442;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; <code>(count * price).toFixed(2)</code> &#x442;&#x430; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; <code>substitutions</code>.</p>
<p>&#x417;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;, &#x449;&#x43E; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x432; <code>literals</code> &#x454; &#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x456;&#x43C; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x43C;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x43C;&#x438; &#x432;&#x43F;&#x435;&#x432;&#x43D;&#x435;&#x43D;&#x456;, &#x449;&#x43E; <code>literals[0]</code> &#x454; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x43C; &#x440;&#x44F;&#x434;&#x43A;&#x430;, &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x44F;&#x43A; <code>literals[literals.length - 1]</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43A;&#x456;&#x43D;&#x435;&#x446;&#x44C; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x41F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43E;&#x43A; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43D;&#x430; &#x43E;&#x434;&#x43D;&#x443; &#x43C;&#x435;&#x43D;&#x448;&#x435; &#x43D;&#x456;&#x436; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;&#x432;, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x432;&#x438;&#x440;&#x430;&#x437; <code>substitutions.length === literals.length - 1</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x438;&#x439;.</p>
<p>&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x446;&#x435;&#x439; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;, &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; <code>literals</code> &#x442;&#x430; <code>substitutions</code> &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x430;&#x43D;&#x456;, &#x449;&#x43E;&#x431; &#x443;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x443;&#x44E;&#x447;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x432; <code>literals</code> &#x439;&#x434;&#x435; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C;, &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; <code>substitutions</code> &#x439;&#x434;&#x435; &#x437;&#x430; &#x43D;&#x438;&#x43C;, &#x456; &#x442;&#x430;&#x43A; &#x434;&#x430;&#x43B;&#x456;, &#x43F;&#x43E;&#x43A;&#x438; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43E;&#x43F;&#x440;&#x430;&#x446;&#x44C;&#x43E;&#x432;&#x430;&#x43D;&#x43E;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x456;&#x43C;&#x456;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x443;, &#x447;&#x435;&#x440;&#x433;&#x443;&#x44E;&#x447;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x438;&#x445; &#x434;&#x432;&#x43E;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">passthru</span>(<span class="hljs-params">literals, ...substitutions</span>) </span>{
    <span class="hljs-keyword">let</span> result = <span class="hljs-string">&quot;&quot;</span>;

    <span class="hljs-comment">// &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x454;&#x43C;&#x43E; &#x446;&#x438;&#x43A;&#x43B; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x43F;&#x456;&#x434;&#x440;&#x430;&#x445;&#x443;&#x43D;&#x43A;&#x443; substitutions</span>
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; substitutions.length; i++) {
        result += literals[i];
        result += substitutions[i];
    }

    <span class="hljs-comment">// &#x434;&#x43E;&#x434;&#x430;&#x454;&#x43C;&#x43E; &#x43E;&#x441;&#x430;&#x442;&#x430;&#x43D;&#x456;&#x439; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;</span>
    result += literals[literals.length - <span class="hljs-number">1</span>];

    <span class="hljs-keyword">return</span> result;
}

<span class="hljs-keyword">let</span> count = <span class="hljs-number">10</span>,
    price = <span class="hljs-number">0.25</span>,
    message = passthru<span class="hljs-string">`<span class="hljs-subst">${count}</span> items cost $<span class="hljs-subst">${(count * price).toFixed(2)}</span>.`</span>;

<span class="hljs-built_in">console</span>.log(message);       <span class="hljs-comment">// &quot;10 items cost $2.50.&quot;</span>
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x435;&#x433; <code>passthru</code> &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454; &#x442;&#x443; &#x436; &#x441;&#x430;&#x43C;&#x443; &#x442;&#x440;&#x430;&#x43D;&#x441;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x449;&#x43E; &#x439; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x404;&#x434;&#x438;&#x43D;&#x430; &#x445;&#x438;&#x442;&#x440;&#x456;&#x441;&#x442;&#x44C; &#x442;&#x443;&#x442; &#x2014; &#x446;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>substitutions.length</code> &#x434;&#x43B;&#x44F; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; <code>literals.length</code>, &#x449;&#x43E;&#x431; &#x443;&#x43D;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x43D;&#x435;&#x43D;&#x430;&#x432;&#x43C;&#x438;&#x441;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x445;&#x43E;&#x434;&#x443; &#x437;&#x430; &#x440;&#x430;&#x43C;&#x43A;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; <code>substitutions</code>. &#x426;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43D;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x456;&#x436; <code>literals</code> &#x442;&#x430; <code>substitutions</code> &#x434;&#x43E;&#x431;&#x440;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456; &#x432; ECMAScript 6.</p>
<p>I&gt; &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; <code>substitutions</code> &#x43D;&#x435; &#x43E;&#x431;&#x43E;&#x432;&apos;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x43E; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438;. &#x42F;&#x43A;&#x449;&#x43E; &#x443; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x447;&#x438;&#x441;&#x43B;&#x43E;, &#x44F;&#x43A; &#x432; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x442;&#x43E;&#x434;&#x456; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x412;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;, &#x449;&#x43E; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x456; &#x432; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x442;&#x435;&#x433;&#x456;&#x432;.</p>
<h4 id="&#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;-&#x43F;&#x435;&#x440;&#x432;&#x438;&#x43D;&#x43D;&#x438;&#x445;-&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;-&#x443;-&#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x438;&#x445;-&#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;&#x445;">&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x432;&#x438;&#x43D;&#x43D;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;&#x445;</h4>
<p>&#x422;&#x435;&#x433;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x456;&#x432; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x43F;&#x435;&#x440;&#x432;&#x438;&#x43D;&#x43D;&#x43E;&#x457; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x457;, &#x449;&#x43E; &#x432; &#x43F;&#x435;&#x440;&#x448;&#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x435;&#x43A;&#x440;&#x430;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x448; &#x43D;&#x456;&#x436; &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x442;&#x440;&#x430;&#x43D;&#x441;&#x444;&#x43E;&#x440;&#x43C;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x432; &#x457;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x456; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x438;. &#x41D;&#x430;&#x439;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C; &#x437;&#x430;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x43F;&#x435;&#x440;&#x432;&#x438;&#x43D;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x435;&#x433;&#x443; <code>String.raw()</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> message1 = <span class="hljs-string">`Multiline\nstring`</span>,
    message2 = <span class="hljs-built_in">String</span>.raw<span class="hljs-string">`Multiline\nstring`</span>;

<span class="hljs-built_in">console</span>.log(message1);          <span class="hljs-comment">// &quot;Multiline</span>
                                <span class="hljs-comment">//  string&quot;</span>
<span class="hljs-built_in">console</span>.log(message2);          <span class="hljs-comment">// &quot;Multiline\\nstring&quot;</span>
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, <code>\n</code> &#x432; <code>message1</code> &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x43D;&#x43E;&#x432;&#x43E;&#x457; &#x43B;&#x456;&#x43D;&#x456;&#x457;, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; <code>\n</code> &#x432; <code>message2</code> &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x439;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x432;&#x438;&#x43D;&#x43D;&#x456;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x456; <code>&quot;\\n&quot;</code> (&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x441;&#x43B;&#x435;&#x448;&#x443; &#x439; <code>n</code>). &#x414;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x43F;&#x435;&#x440;&#x432;&#x438;&#x43D;&#x43D;&#x43E;&#x457; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x457;, &#x44F;&#x43A; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43A;&#x43E;&#x43C;&#x43F;&#x43B;&#x435;&#x43A;&#x441;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x437;&#x430; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456;.</p>
<p>&#x41F;&#x435;&#x440;&#x432;&#x438;&#x43D;&#x43D;&#x430; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x442;&#x435;&#x433;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x443;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x432; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x442;&#x435;&#x433;&#x443; &#x2014; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437; &#x435;&#x43A;&#x441;&#x442;&#x440;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; &#x43D;&#x435;&#x437;&#x432;&#x430;&#x43D;&#x43E;&#x44E; <code>raw</code>. &#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>raw</code> &#x454; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C; &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x43C;&#x456;&#x449;&#x430;&#x454; &#x43F;&#x435;&#x440;&#x432;&#x438;&#x43D;&#x43D;&#x438;&#x439; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; <code>literals[0]</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43C;&#x430;&#x454; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; <code>literals.raw[0]</code>, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x417;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x446;&#x435;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x456;&#x43C;&#x456;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; <code>String.raw()</code>, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">raw</span>(<span class="hljs-params">literals, ...substitutions</span>) </span>{
    <span class="hljs-keyword">let</span> result = <span class="hljs-string">&quot;&quot;</span>;

    <span class="hljs-comment">// &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x454;&#x43C;&#x43E; &#x446;&#x438;&#x43A;&#x43B; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x43F;&#x456;&#x434;&#x440;&#x430;&#x445;&#x443;&#x43D;&#x43A;&#x443; substitutions</span>
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; substitutions.length; i++) {
        result += literals.raw[i];      <span class="hljs-comment">// use raw values instead</span>
        result += substitutions[i];
    }

    <span class="hljs-comment">// &#x434;&#x43E;&#x434;&#x430;&#x454;&#x43C;&#x43E; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456;&#x439; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;</span>
    result += literals.raw[literals.length - <span class="hljs-number">1</span>];

    <span class="hljs-keyword">return</span> result;
}

<span class="hljs-keyword">let</span> message = raw<span class="hljs-string">`Multiline\nstring`</span>;

<span class="hljs-built_in">console</span>.log(message);           <span class="hljs-comment">// &quot;Multiline\\nstring&quot;</span>
<span class="hljs-built_in">console</span>.log(message.length);    <span class="hljs-comment">// 17</span>
</code></pre>
<p>&#x41A;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; <code>literals.raw</code> &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; <code>literals</code> &#x449;&#x43E;&#x431; &#x432;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x443;&#x44E;&#x447;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;, &#x449;&#x43E; &#x435;&#x43A;&#x440;&#x430;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F;, &#x432; &#x442;&#x43E;&#x43C;&#x443; &#x447;&#x438;&#x441;&#x43B;&#x456; &#x43A;&#x43E;&#x434;&#x438; Unicode, &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x456; &#x432; &#x457;&#x445; &#x43F;&#x435;&#x440;&#x432;&#x438;&#x43D;&#x43D;&#x456;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x456;. &#x41F;&#x435;&#x440;&#x432;&#x438;&#x43D;&#x43D;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x430; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x441;&#x442;&#x430;&#x454; &#x443; &#x43D;&#x430;&#x433;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43A;&#x43E;&#x434; &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x435;&#x43A;&#x440;&#x430;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x44E; &#x43F;&#x440;&#x43E; &#x44F;&#x43A;&#x438;&#x439;&#x441;&#x44C; &#x43A;&#x43E;&#x434;, &#x432;&#x438;, &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x437;&#x430;&#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43A;&#x43E;&#x434; &#x443; &#x442;&#x430;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x456; &#x44F;&#x43A; &#x432;&#x456;&#x43D; &#x454;).</p>
<h2 id="&#x43F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;">&#x41F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;</h2>
<p>&#x41F;&#x43E;&#x432;&#x43D;&#x430; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x430; Unicode &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; JavaScript &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438; UTF-16 &#x43B;&#x43E;&#x433;&#x456;&#x447;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;. &#x41C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434;&#x456;&#x432; &#x43C;&#x456;&#x436; &#x43A;&#x43E;&#x434;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438; &#x447;&#x435;&#x440;&#x435;&#x437; <code>codePointAt()</code> &#x442;&#x430; <code>String.fromCodePoint()</code> &#x454; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C; &#x43A;&#x440;&#x43E;&#x43A;&#x43E;&#x43C; &#x432; &#x43C;&#x430;&#x43D;&#x456;&#x43F;&#x443;&#x43B;&#x44F;&#x446;&#x456;&#x44F;&#x445; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438;. &#x414;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x43F;&#x446;&#x456;&#x457; <code>u</code> &#x434;&#x43E; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432; &#x434;&#x430;&#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43E;&#x43F;&#x435;&#x440;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x434;&#x430;&#x43C;&#x438; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; 16-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x438;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;, &#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>normalize()</code> &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x43A;&#x440;&#x430;&#x449;&#x435; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x438;.</p>
<p>ECMAScript 6 &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x434;&#x43E;&#x434;&#x430;&#x454; &#x43D;&#x43E;&#x432;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438;, &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x447;&#x438; &#x432;&#x430;&#x43C; &#x43A;&#x440;&#x430;&#x449;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438; &#x441;&#x443;&#x431;&#x440;&#x44F;&#x434;&#x43A;&#x438;, &#x434;&#x438;&#x432;&#x43B;&#x44F;&#x447;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x457;&#x445; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x44E; &#x432; &#x431;&#x430;&#x442;&#x44C;&#x43A;&#x456;&#x432;&#x441;&#x44C;&#x43A;&#x43E;&#x43C;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443;. &#x422;&#x430;&#x43A;&#x43E;&#x436; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x443; &#x431;&#x443;&#x43B;&#x43E; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x43E; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x43C; &#x432;&#x438;&#x440;&#x430;&#x437;&#x430;&#x43C;.</p>
<p>&#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438; &#x454; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x43C; &#x434;&#x43E; ECMAScript 6, &#x449;&#x43E; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x447;&#x43D;&#x456; &#x434;&#x43E; &#x434;&#x43E;&#x43C;&#x435;&#x43D;&#x443; &#x43C;&#x43E;&#x432;&#x438; (DSLs), &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x43B;&#x435;&#x433;&#x448;&#x438;&#x442;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;. &#x41C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x432; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x456;&#x448;&#x438;&#x439; &#x456;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x456;&#x436; &#x43A;&#x43E;&#x43D;&#x43A;&#x430;&#x442;&#x435;&#x43D;&#x430;&#x446;&#x456;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x454;&#x434;&#x43D;&#x430;&#x43D;&#x43D;&#x456; &#x434;&#x43E;&#x432;&#x433;&#x438;&#x445; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x437;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x43C;&#x438;.</p>
<p>&#x412;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x430; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x445; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43C; &#x434;&#x43E;&#x43F;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; JavaScript, &#x44F;&#x43A;&#x456; &#x434;&#x43E;&#x441;&#x456; &#x43D;&#x435; &#x43C;&#x430;&#x43B;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x457; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;. &#x41D;&#x435; &#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x43E;&#x432;&#x438;&#x445; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443;, &#x432;&#x438; &#x432;&#x441;&#x435; &#x449;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>\n</code> &#x442;&#x430; &#x456;&#x43D;&#x448;&#x456; &#x435;&#x43A;&#x440;&#x430;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;.</p>
<p>&#x422;&#x435;&#x433;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x443; &#x454; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; DSLs. &#x422;&#x435;&#x433;&#x438; &#x2014; &#x446;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x449;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x44E;&#x442;&#x44C; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x443; &#x44F;&#x43A; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;. &#x412; &#x43F;&#x43E;&#x434;&#x430;&#x43B;&#x44C;&#x448;&#x43E;&#x43C;&#x443; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x446;&#x456; &#x434;&#x430;&#x43D;&#x43D;&#x456;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x412;&#x43F;&#x440;&#x43E;&#x432;&#x430;&#x434;&#x436;&#x435;&#x43D;&#x456; &#x434;&#x430;&#x43D;&#x43D;&#x456; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x442;&#x44C; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438;, &#x457;&#x445;&#x43D;&#x456; &#x432;&#x438;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x438;, &#x442;&#x430; &#x431;&#x443;&#x434;&#x44C;&#x2212;&#x44F;&#x43A;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x44C;. &#x426;&#x456; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x457; &#x432; &#x43F;&#x43E;&#x434;&#x430;&#x43B;&#x44C;&#x448;&#x43E;&#x43C;&#x443; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x434;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x456;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43A;&#x43E;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x432;&#x456;&#x434; &#x442;&#x435;&#x433;&#x443;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="01-Block-Bindings.html" class="navigation navigation-prev " aria-label="Previous page: Глава 1: Блочне зв’язування">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="03-Functions.html" class="navigation navigation-next " aria-label="Next page: Глава 3: Функції">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Глава 2: Рядки та регулярні вирази","level":"1.4","depth":1,"next":{"title":"Глава 3: Функції","level":"1.5","depth":1,"path":"manuscript/03-Functions.md","ref":"manuscript/03-Functions.md","articles":[]},"previous":{"title":"Глава 1: Блочне зв’язування","level":"1.3","depth":1,"path":"manuscript/01-Block-Bindings.md","ref":"manuscript/01-Block-Bindings.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","yametrika","ga","rss","github-buttons"],"pluginsConfig":{"yametrika":{"number":"41711034"},"github":{"url":"https://github.com/denysdovhan/understandinges6ua"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Рoзуміння ECMAScript 6","description":"Український переклад книги «Understanding ES6».","author":"Denys Dovhan and Terry Sahaidak","site_url":"http://understandinges6.denysdovhan.com/","feed_url":"http://understandinges6.denysdovhan.com/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"github-buttons":{"repo":"denysdovhan/understandinges6ua","types":["star"],"size":"small"},"ga":{"configuration":"auto","token":"UA-40496885-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/denysdovhan/understandinges6ua/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"manuscript/02-Strings-and-Regular-Expressions.md","mtime":"2017-01-05T10:20:39.204Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-01-05T10:22:15.629Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-yametrika/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

