
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Глава 4: Розширена функціональність об’єктів · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="05-Destructuring.html" />
    
    
    <link rel="prev" href="03-Functions.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"LambdaBooks/understandinges6ua","types":["star"],"size":"small"};
    </script>

    <link href="http://understandinges6.denysdovhan.com/rss.xml" title="Рoзуміння ECMAScript 6" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Рoзуміння ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-Block-Bindings.html">
            
                <a href="01-Block-Bindings.html">
            
                    
                    Глава 1: Блочне зв’язування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02-Strings-and-Regular-Expressions.html">
            
                <a href="02-Strings-and-Regular-Expressions.html">
            
                    
                    Глава 2: Рядки та регулярні вирази
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03-Functions.html">
            
                <a href="03-Functions.html">
            
                    
                    Глава 3: Функції
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="04-Objects.html">
            
                <a href="04-Objects.html">
            
                    
                    Глава 4: Розширена функціональність об’єктів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="05-Destructuring.html">
            
                <a href="05-Destructuring.html">
            
                    
                    Глава 5: Деструктурування для легшого доступу до даних
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="06-Symbols.html">
            
                <a href="06-Symbols.html">
            
                    
                    Глава 6: Символи та їх властивості
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="07-Sets-And-Maps.html">
            
                <a href="07-Sets-And-Maps.html">
            
                    
                    Глава 7: Множини та мапи
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="08-Iterators-And-Generators.html">
            
                <a href="08-Iterators-And-Generators.html">
            
                    
                    Глава 8: Ітератори та генератори
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="09-Classes.html">
            
                <a href="09-Classes.html">
            
                    
                    Глава 9: Знайомство з класами у JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10-Arrays.html">
            
                <a href="10-Arrays.html">
            
                    
                    Глава 10: Покращені можливості масивів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11-Promises.html">
            
                <a href="11-Promises.html">
            
                    
                    Глава 11: Проміси та асинхронне програмування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12-Proxies-and-Reflection.html">
            
                <a href="12-Proxies-and-Reflection.html">
            
                    
                    Глава 12: Проксі та АРІ рефлексії
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13-Modules.html">
            
                <a href="13-Modules.html">
            
                    
                    Глава 13: Інкапсуляція коду через модулі
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="A-Other-Changes.html">
            
                <a href="A-Other-Changes.html">
            
                    
                    Додаток А: Дрібніші зміни у ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="B-ECMAScript-7.html">
            
                <a href="B-ECMAScript-7.html">
            
                    
                    Додаток Б: Розуміння ECMAScript 7 (2016)
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Глава 4: Розширена функціональність об’єктів</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F;-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x456;&#x432;">&#x420;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;</h1>
<p>ECMAScript 6 &#x437;&#x43D;&#x430;&#x447;&#x43D;&#x43E;&#x44E; &#x43C;&#x456;&#x440;&#x43E;&#x44E; &#x441;&#x43F;&#x440;&#x44F;&#x43C;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43D;&#x430; &#x43F;&#x43E;&#x43B;&#x456;&#x43F;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x449;&#x43E; &#x43C;&#x430;&#x454; &#x437;&#x43C;&#x456;&#x441;&#x442;, &#x430;&#x434;&#x436;&#x435; &#x43C;&#x430;&#x439;&#x436;&#x435; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; JavaScript &#x454; &#x43F;&#x435;&#x432;&#x43D;&#x43E;&#x44E; &#x43C;&#x456;&#x440;&#x43E;&#x44E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438;. &#x41A;&#x440;&#x456;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x432; &#x43F;&#x435;&#x440;&#x435;&#x441;&#x456;&#x447;&#x43D;&#x438;&#x445; JavaScript&#x2013;&#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x430;&#x445; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454; &#x437;&#x440;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x438; &#x440;&#x430;&#x437;&#x43E;&#x43C; &#x437;&#x456; &#x437;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456; JavaScript&#x2013;&#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x456;&#x432;, &#x430; &#x446;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438; &#x43F;&#x43E;&#x441;&#x442;&#x456;&#x439;&#x43D;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C; &#x432;&#x441;&#x435; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x456; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x417;&#x456; &#x437;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x437;&#x2019;&#x44F;&#x432;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x456; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x457;&#x445; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x435;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;.</p>
<p>ECMAScript 6 &#x43F;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x443;&#x454; &#x440;&#x44F;&#x434; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;: &#x432;&#x456;&#x434; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443; &#x434;&#x43E; &#x43E;&#x43F;&#x446;&#x456;&#x439; &#x434;&#x43B;&#x44F; &#x457;&#x445; &#x43C;&#x430;&#x43D;&#x456;&#x43F;&#x443;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x434;&#x456;&#x457;.</p>
<h2 id="&#x43A;&#x430;&#x442;&#x435;&#x433;&#x43E;&#x440;&#x456;&#x457;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x456;&#x432;">&#x41A;&#x430;&#x442;&#x435;&#x433;&#x43E;&#x440;&#x456;&#x457; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;</h2>
<p>JavaScript &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x437;&#x43C;&#x456;&#x448;&#x430;&#x43D;&#x443; &#x442;&#x435;&#x440;&#x43C;&#x456;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x456;&#x44E; &#x434;&#x43B;&#x44F; &#x43E;&#x43F;&#x438;&#x441;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x456;, &#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x443; &#x440;&#x456;&#x437;&#x43D;&#x43E;&#x43C;&#x430;&#x43D;&#x456;&#x442;&#x43D;&#x438;&#x445; &#x43E;&#x442;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x445;, &#x44F;&#x43A; &#x43E;&#x442; &#x443; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445; &#x447;&#x438; Node.js. &#x421;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F; ECMAScript 6 &#x43C;&#x430;&#x454; &#x432;&#x43D;&#x435;&#x441;&#x442;&#x438; &#x447;&#x456;&#x442;&#x43A;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x457; &#x437; &#x43A;&#x430;&#x442;&#x435;&#x433;&#x43E;&#x440;&#x456;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x412;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438; &#x446;&#x44E; &#x442;&#x435;&#x440;&#x43C;&#x456;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x456;&#x44E;, &#x449;&#x43E;&#x431; &#x43C;&#x430;&#x442;&#x438; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x435; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x432;&#x438; &#x432; &#x446;&#x456;&#x43B;&#x43E;&#x43C;&#x443;. &#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x431;&#x443;&#x432;&#x430;&#x44E;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x43A;&#x430;&#x442;&#x435;&#x433;&#x43E;&#x440;&#x456;&#x439;:</p>
<ul>
<li><em>&#x417;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;</em> &#x2014; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x43D;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x443; JavaScript.</li>
<li><em>&#x41D;&#x435;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;</em> &#x2014; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443;, &#x44F;&#x43A;&#x430; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x438; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;.</li>
<li><em>&#x421;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;</em> &#x2014; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456; &#x443; ECMAScript 6, &#x442;&#x430;&#x43A;&#x456; &#x44F;&#x43A; <code>Array</code>, <code>Date</code> &#x456; &#x442;&#x430;&#x43A; &#x434;&#x430;&#x43B;&#x456;. &#x421;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x43C;&#x438; &#x430;&#x431;&#x43E; &#x43D;&#x435;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x43C;&#x438;.</li>
<li><em>&#x412;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;</em> &#x2014; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x441;&#x443;&#x442;&#x43D;&#x456; &#x443; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x438;&#x449;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; JavaScript, &#x43A;&#x43E;&#x43B;&#x438; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C;. &#x412;&#x441;&#x456; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x454; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438;.</li>
</ul>
<p>&#x423; &#x43A;&#x43D;&#x438;&#x437;&#x456; &#x44F; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x443;&#x441;&#x44C; &#x446;&#x456;&#x454;&#x44E; &#x442;&#x435;&#x440;&#x43C;&#x456;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x456;&#x454;&#x44E; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x440;&#x456;&#x437;&#x43D;&#x43E;&#x43C;&#x430;&#x43D;&#x456;&#x442;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x445; &#x443; ECMAScript 6.</p>
<h2 id="&#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F;-&#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x433;&#x43E;-&#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;">&#x420;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;</h2>
<p>&#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x439; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B; &#x454; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x437; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x43F;&#x430;&#x442;&#x435;&#x440;&#x43D;&#x456;&#x432; &#x443; JavaScript. JSON &#x43F;&#x43E;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43D;&#x430; &#x439;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x456;, &#x456; &#x432;&#x456;&#x43D; &#x454; &#x43C;&#x430;&#x439;&#x436;&#x435; &#x443; &#x431;&#x443;&#x434;&#x44C;&#x2014;&#x44F;&#x43A;&#x43E;&#x43C;&#x443; JavaScript&#x2013;&#x444;&#x430;&#x439;&#x43B;&#x456; &#x432; &#x406;&#x43D;&#x442;&#x435;&#x440;&#x43D;&#x435;&#x442;&#x456;. &#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x439; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B; &#x441;&#x442;&#x430;&#x432; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x43C; &#x437;&#x430;&#x434;&#x44F;&#x43A;&#x438; &#x441;&#x432;&#x43E;&#x454;&#x43C;&#x443; &#x43B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x43E;&#x43C;&#x443; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x449;&#x43E; &#x432; &#x456;&#x43D;&#x448;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; &#x43C;&#x43E;&#x433;&#x43B;&#x43E; &#x431; &#x437;&#x430;&#x439;&#x43D;&#x44F;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x43A;&#x43E;&#x434;&#x443;. &#x41D;&#x430; &#x449;&#x430;&#x441;&#x442;&#x44F; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432;, ECMAScript 6 &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x438;&#x43C;&#x438; &#x442;&#x430; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x430;&#x432;&#x434;&#x44F;&#x43A;&#x438; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x43C;&#x430; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x430;&#x43C;&#x438;.</p>
<h3 id="&#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F;-&#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457;-&#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;">&#x421;&#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;</h3>
<p>&#x423; ECMAScript 5 &#x442;&#x430; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435;, &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x431;&#x443;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x43C;&#x438; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x44F;&#x43C;&#x438; &#x43F;&#x430;&#x440; &quot;&#x456;&#x43C;&apos;&#x44F;-&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&quot;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x43E;, &#x449;&#x43E; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x432;&#x438;&#x43D;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x434;&#x443;&#x431;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x432;&#x436;&#x435; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456;. &#x414;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">createPerson</span>(<span class="hljs-params">name, age</span>) </span>{
    <span class="hljs-keyword">return</span> {
        name: name,
        age: age
    };
}
</code></pre>
<p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>createPerson()</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x443; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; name &#x442;&#x430;&#x43A;&#x430; &#x436; &#x441;&#x430;&#x43C;&#x430;, &#x44F;&#x43A; &#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; name &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;. &#x423; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456; &#x446;&#x435; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x44F;&#x43A; &#x434;&#x443;&#x431;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; <code>name</code> &#x442;&#x430; <code>age</code>, &#x445;&#x43E;&#x447;&#x430; &#x439; &#x43E;&#x434;&#x438;&#x43D; name &#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;, &#x430; &#x456;&#x43D;&#x448;&#x438;&#x439; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x456;&#x439; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;. &#x41A;&#x43B;&#x44E;&#x447;&#x435;&#x432;&#x456; <code>name</code> &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F;, &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; <code>name</code>, &#x430; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x432;&#x456; <code>age</code>, &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F;, &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; <code>age</code>.</p>
<p>&#x423; ECMAScript 6 &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x437;&#x431;&#x443;&#x442;&#x438;&#x441;&#x44C; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x434;&#x443;&#x431;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x432;&#x434;&#x44F;&#x43A;&#x438; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44E; <em>&#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;</em>. &#x41A;&#x43E;&#x43B;&#x438; &#x456;&#x43C;&#x2019;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x442;&#x430;&#x43A;&#x435; &#x436;, &#x44F;&#x43A; &#x456; &#x456;&#x43C;&#x2019;&#x44F; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x456;&#x43C;&#x2019;&#x44F; &#x431;&#x435;&#x437; &#x434;&#x432;&#x43E;&#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x438; &#x442;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x414;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;, <code>createPerson()</code> &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x430; &#x43D;&#x430; ECMAScript 6 &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">createPerson</span>(<span class="hljs-params">name, age</span>) </span>{
    <span class="hljs-keyword">return</span> {
        name,
        age
    };
}
</code></pre>
<p>&#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x43C;&#x443; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456; &#x43C;&#x430;&#x454; &#x43B;&#x438;&#x448;&#x435; &#x456;&#x43C;&#x2019;&#x44F;, &#x440;&#x443;&#x448;&#x456;&#x439; JavaScript &#x448;&#x443;&#x43A;&#x430;&#x454; &#x443; &#x441;&#x443;&#x43C;&#x456;&#x436;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x456;&#x43C;&#x2019;&#x44F;&#x43C;. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x456;&#x43D; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x443;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x456;&#x454;&#x457; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A;&#x43E;&#x43C;&#x443; &#x436; &#x456;&#x43C;&#x435;&#x43D;&#x456; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x43C;&#x443; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;.&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>name</code> &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>name</code>.</p>
<p>&#x422;&#x430;&#x43A;&#x435; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;&#x432; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x43E;&#x44E; &#x442;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x430;&#x433;&#x430;&#x454; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x442;&#x438;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;, &#x43F;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x430;&#x43D;&#x438;&#x445; &#x437; &#x456;&#x43C;&#x435;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x41F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x436;&#x435; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x456;&#x43C;&#x2019;&#x44F;&#x43C; &#x454; &#x434;&#x443;&#x436;&#x435; &#x43F;&#x43E;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x43C; &#x43F;&#x430;&#x442;&#x435;&#x440;&#x43D;&#x43E;&#x43C;&#x443; &#x443; JavaScript, &#x449;&#x43E; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x446;&#x435; &#x43D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x443;&#x436;&#x435; &#x431;&#x430;&#x436;&#x430;&#x43D;&#x438;&#x43C;.</p>
<h3 id="&#x43B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x456;-&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;">&#x41B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;</h3>
<p>ECMAScript 6 &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x434;&#x43E;&#x441;&#x43A;&#x43E;&#x43D;&#x430;&#x43B;&#x44E;&#x454; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;&#x445;. &#x423; ECMAScript 5 &#x442;&#x430; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435;, &#x449;&#x43E;&#x431; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x432;&#x438; &#x43C;&#x443;&#x441;&#x438;&#x43B;&#x438; &#x437;&#x430;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x456;&#x43C;&#x2019;&#x44F;, &#x430; &#x442;&#x43E;&#x434;&#x456; &#x43F;&#x43E;&#x432;&#x43D;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> person = {
    name: <span class="hljs-string">&quot;Nicholas&quot;</span>,
    sayName: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
        <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">this</span>.name);
    }
};
</code></pre>
<p>&#x423; ECMAScript 6 &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x43E; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x438;&#x43C;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x437;&#x431;&#x443;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x432;&#x43E;&#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x438; &#x442;&#x430; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>function</code>. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> person = {
    name: <span class="hljs-string">&quot;Nicholas&quot;</span>,
    sayName() {
        <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">this</span>.name);
    }
};
</code></pre>
<p>&#x422;&#x430;&#x43A;&#x438;&#x439; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;, &#x44F;&#x43A;&#x438;&#x439; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x44C; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x43E;&#x43C; <em>&#x43B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;</em>, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; <code>person</code> &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x443; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;. &#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>sayName()</code> &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x430;&#x43D;&#x43E;&#x43D;&#x456;&#x43C;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x44F;&#x43A;&#x430; &#x43C;&#x430;&#x454; &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x442;&#x430;&#x43A;&#x456; &#x436; &#x445;&#x430;&#x440;&#x430;&#x43A;&#x442;&#x435;&#x440;&#x438;&#x441;&#x442;&#x438;&#x43A;&#x438;, &#x44F;&#x43A; &#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>sayName()</code> &#x43D;&#x430;  ECMAScript 5. &#x404;&#x434;&#x438;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x43B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>super</code> (&#x439;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x456;&#x437;&#x43D;&#x456;&#x448;&#x435; &#x443; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456; &#xAB;&#x41B;&#x435;&#x433;&#x43A;&#x438;&#x439; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; super section), &#x442;&#x43E;&#x434;&#x456; &#x44F;&#x43A; &#x43D;&#x435;&#x43B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C;.</p>
<p>I&gt; &#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>name</code> &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443;, &#x449;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x454; &#x456;&#x43C;&#x2019;&#x44F;&#x43C;, &#x44F;&#x43A;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43A;&#x440;&#x443;&#x433;&#x43B;&#x438;&#x43C;&#x438; &#x434;&#x443;&#x436;&#x43A;&#x430;&#x43C;&#x438;. &#x423; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; <code>name</code> &#x434;&#x43B;&#x44F; <code>person.sayName()</code> &#x431;&#x443;&#x434;&#x435; <code>&quot;sayName&quot;</code>.</p>
<h3 id="&#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x456;-&#x456;&#x43C;&#x435;&#x43D;&#x430;-&#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;">&#x41E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;</h3>
<p>&#x423; ECMAScript 5 &#x442;&#x430; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x431;&#x443;&#x43B;&#x43E; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;, &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x44E;&#x447;&#x438; &#x457;&#x445; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x43D;&#x438;&#x445; &#x434;&#x443;&#x436;&#x43E;&#x43A; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;. &#x41A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x43D;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x437;&#x430;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; &#x442;&#x430; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438;, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;, &#x44F;&#x43A;&#x456; &#x431;&#x438; &#x441;&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x438;&#x43B;&#x438; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x443; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A;&#x431;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> person = {},
    lastName = <span class="hljs-string">&quot;last name&quot;</span>;

person[<span class="hljs-string">&quot;first name&quot;</span>] = <span class="hljs-string">&quot;Nicholas&quot;</span>;
person[lastName] = <span class="hljs-string">&quot;Zakas&quot;</span>;

<span class="hljs-built_in">console</span>.log(person[<span class="hljs-string">&quot;first name&quot;</span>]);      <span class="hljs-comment">// &quot;Nicholas&quot;</span>
<span class="hljs-built_in">console</span>.log(person[lastName]);          <span class="hljs-comment">// &quot;Zakas&quot;</span>
</code></pre>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>lastName</code> &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;last name&quot;</code>, &#x43E;&#x431;&#x438;&#x434;&#x432;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x431;&#x456;&#x43B;&#x438;, &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x447;&#x438; &#x43D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C; &#x437;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; &#x43D;&#x438;&#x445; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x43D;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x456;&#x43C;&#x2019;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;, &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; <code>&quot;first name&quot;</code> &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;Nicholas&quot;</code> &#x442;&#x430; &quot;<code>last name&quot;</code> &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;Zakas&quot;</code> &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;.</p>
<p>&#x41E;&#x43A;&#x440;&#x456;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438;, &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;, &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x456;&#x43C;&#x435;&#x43D; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;&#x432;, &#x44F;&#x43A; &#x442;&#x443;&#x442;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> person = {
    <span class="hljs-string">&quot;first name&quot;</span>: <span class="hljs-string">&quot;Nicholas&quot;</span>
};

<span class="hljs-built_in">console</span>.log(person[<span class="hljs-string">&quot;first name&quot;</span>]);      <span class="hljs-comment">// &quot;Nicholas&quot;</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x430;&#x442;&#x435;&#x440;&#x43D; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x434;&#x43B;&#x44F; &#x456;&#x43C;&#x435;&#x43D; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43E;&#x43C;&#x456; &#x43D;&#x430;&#x43F;&#x435;&#x440;&#x435;&#x434; &#x456; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x456; &#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x44F;&#x43A;&#x449;&#x43E; &#x431; &#x456;&#x43C;&apos;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>&quot;first name&quot;</code> &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x43B;&#x43E;&#x441;&#x44F; &#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; (&#x44F;&#x43A; &#x443; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;) &#x430;&#x431;&#x43E; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43B;&#x43E;&#x441;&#x44C;, &#x442;&#x43E;&#x434;&#x456; &#x43D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x431;&#x443;&#x43B;&#x43E; &#x431; &#x437;&#x430;&#x434;&#x430;&#x442;&#x438; &#x446;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; &#x443; ECMAScript 5.</p>
<p>&#x423; ECMAScript 6 &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x454; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443;, &#x456; &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x442;&#x438;&#x445; &#x441;&#x430;&#x43C;&#x438;&#x445; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x43D;&#x438;&#x445; &#x434;&#x443;&#x436;&#x43E;&#x43A;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x443; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> lastName = <span class="hljs-string">&quot;last name&quot;</span>;

<span class="hljs-keyword">var</span> person = {
    <span class="hljs-string">&quot;first name&quot;</span>: <span class="hljs-string">&quot;Nicholas&quot;</span>,
    [lastName]: <span class="hljs-string">&quot;Zakas&quot;</span>
};

<span class="hljs-built_in">console</span>.log(person[<span class="hljs-string">&quot;first name&quot;</span>]);      <span class="hljs-comment">// &quot;Nicholas&quot;</span>
<span class="hljs-built_in">console</span>.log(person[lastName]);          <span class="hljs-comment">// &quot;Zakas&quot;</span>
</code></pre>
<p>&#x41A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x43D;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x44E;&#x442;&#x44C;, &#x449;&#x43E; &#x456;&#x43C;&#x2019;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x438;&#x43C;, &#x442;&#x43E;&#x43C;&#x443; &#x439;&#x43E;&#x433;&#x43E; &#x432;&#x43C;&#x456;&#x441;&#x442; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x440;&#x44F;&#x434;&#x43E;&#x43A;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> suffix = <span class="hljs-string">&quot; name&quot;</span>;

<span class="hljs-keyword">var</span> person = {
    [<span class="hljs-string">&quot;first&quot;</span> + suffix]: <span class="hljs-string">&quot;Nicholas&quot;</span>,
    [<span class="hljs-string">&quot;last&quot;</span> + suffix]: <span class="hljs-string">&quot;Zakas&quot;</span>
};

<span class="hljs-built_in">console</span>.log(person[<span class="hljs-string">&quot;first name&quot;</span>]);      <span class="hljs-comment">// &quot;Nicholas&quot;</span>
<span class="hljs-built_in">console</span>.log(person[<span class="hljs-string">&quot;last name&quot;</span>]);       <span class="hljs-comment">// &quot;Zakas&quot;</span>
</code></pre>
<p>&#x420;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; <code>&quot;first name&quot;</code> &#x442;&#x430; <code>&quot;last name&quot;</code>, &#x456; &#x446;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x43B;&#x44F; &#x437;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x437;&#x433;&#x43E;&#x434;&#x43E;&#x43C;. &#x411;&#x443;&#x434;&#x44C;&#x2013;&#x449;&#x43E;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x431;&#x438; &#x432;&#x43A;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x434;&#x43E; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x43D;&#x438;&#x445; &#x434;&#x443;&#x436;&#x43E;&#x43A; &#x443; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x456; &#x437; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;&#x432;.</p>
<h2 id="&#x43D;&#x43E;&#x432;&#x456;-&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;">&#x41D;&#x43E;&#x432;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;</h2>
<p>&#x41E;&#x434;&#x43D;&#x456;&#x454;&#x44E; &#x437; &#x446;&#x456;&#x43B;&#x435;&#x439; ECMAScript, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; ECMAScript 5, &#x431;&#x443;&#x43B;&#x43E; &#x443;&#x43D;&#x438;&#x43A;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x43E;&#x432;&#x438;&#x445; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439; &#x442;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x443; <code>Object.prototype</code>, &#x430; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x439;&#x442;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;, &#x443; &#x44F;&#x43A;&#x438;&#x445; &#x43D;&#x43E;&#x432;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x431;&#x443;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C;&#x438;. &#x423; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;, &#x413;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; <code>Object</code> &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x432; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;, &#x443; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; &#x443;&#x441;&#x456; &#x456;&#x43D;&#x448;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x2014; &#x43D;&#x456;. ECMAScript 6 &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43F;&#x430;&#x440;&#x443; &#x43D;&#x43E;&#x432;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x443; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; <code>Object</code>, &#x44F;&#x43A;&#x456; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x441;&#x43F;&#x440;&#x43E;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x445; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-objectis">&#x41C;&#x435;&#x442;&#x43E;&#x434; Object.is()</h3>
<p>&#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x442;&#x438; &#x434;&#x432;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; JavaScript, &#x441;&#x43A;&#x43E;&#x440;&#x456;&#x448; &#x437;&#x430; &#x432;&#x441;&#x435;, &#x432;&#x438; &#x437;&#x432;&#x438;&#x43A;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x456;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; (<code>==</code>) &#x430;&#x431;&#x43E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x447;&#x43D;&#x43E;&#x457; &#x440;&#x456;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; (<code>===</code>). &#x411;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x43D;&#x430;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x430;&#x433;&#x443; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x43C;&#x443;, &#x449;&#x43E;&#x431; &#x443;&#x43D;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x43F;&#x440;&#x438;&#x43C;&#x443;&#x441;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x437;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x432;. &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x447;&#x43D;&#x43E;&#x457; &#x440;&#x456;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x454; &#x43D;&#x435; &#x437;&#x43E;&#x432;&#x441;&#x456;&#x43C; &#x442;&#x43E;&#x447;&#x43D;&#x438;&#x43C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; +0 &#x442;&#x430; -0 &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C; <code>===</code> &#x440;&#x456;&#x432;&#x43D;&#x438;&#x43C;&#x438;, &#x445;&#x43E;&#x447;&#x430; &#x440;&#x443;&#x448;&#x456;&#x457; JavaScript &#x43E;&#x43F;&#x438;&#x441;&#x443;&#x44E;&#x442;&#x44C; &#x457;&#x445; &#x44F;&#x43A; &#x440;&#x456;&#x437;&#x43D;&#x456;. &#x422;&#x430;&#x43A;&#x43E;&#x436; <code>NaN === NaN</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>false</code>, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x434;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>isNaN()</code>, &#x449;&#x43E;&#x431; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x442;&#x438; <code>NaN</code> &#x442;&#x43E;&#x447;&#x43D;&#x43E;.</p>
<p>ECMAScript 6 &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Object.is()</code>, &#x449;&#x43E;&#x431; &#x43A;&#x43E;&#x43C;&#x43F;&#x435;&#x43D;&#x441;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43D;&#x435;&#x434;&#x43E;&#x43B;&#x456;&#x43A;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x447;&#x43D;&#x43E;&#x457; &#x440;&#x456;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456;. &#x426;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x434;&#x432;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x442;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>true</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x454; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x43C;&#x438;. &#x414;&#x432;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x43E;&#x43D;&#x438; &#x454; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x456; &#x442;&#x438;&#x43F;&#x438; &#x442;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41E;&#x441;&#x44C; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;&#x432;:</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(+<span class="hljs-number">0</span> == <span class="hljs-number">-0</span>);              <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(+<span class="hljs-number">0</span> === <span class="hljs-number">-0</span>);             <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.is(+<span class="hljs-number">0</span>, <span class="hljs-number">-0</span>));     <span class="hljs-comment">// false</span>

<span class="hljs-built_in">console</span>.log(<span class="hljs-literal">NaN</span> == <span class="hljs-literal">NaN</span>);            <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-literal">NaN</span> === <span class="hljs-literal">NaN</span>);           <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.is(<span class="hljs-literal">NaN</span>, <span class="hljs-literal">NaN</span>));   <span class="hljs-comment">// true</span>

<span class="hljs-built_in">console</span>.log(<span class="hljs-number">5</span> == <span class="hljs-number">5</span>);                <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-number">5</span> == <span class="hljs-string">&quot;5&quot;</span>);              <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-number">5</span> === <span class="hljs-number">5</span>);               <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-number">5</span> === <span class="hljs-string">&quot;5&quot;</span>);             <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.is(<span class="hljs-number">5</span>, <span class="hljs-number">5</span>));       <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.is(<span class="hljs-number">5</span>, <span class="hljs-string">&quot;5&quot;</span>));     <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x423; &#x431;&#x430;&#x433;&#x430;&#x442;&#x44C;&#x43E;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x430;&#x445;, <code>Object.is()</code> &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x44F;&#x43A; &#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>===</code>. &#x404;&#x434;&#x438;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x43E;&#x43B;&#x44F;&#x433;&#x430;&#x454; &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; +0 &#x442;&#x430; -0 &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x43D;&#x435;&#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x456; &#x442;&#x430; <code>NaN</code> &#x432;&#x432;&#x430;&#x436;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x43C; &#x434;&#x43E; <code>NaN</code>. &#x41F;&#x440;&#x43E;&#x442;&#x435; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x441;&#x442;&#x430;&#x432;&#x430;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x440;&#x456;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43E;&#x432;&#x441;&#x456;&#x43C;. &#x412;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x439;&#x442;&#x435; &#x43A;&#x43E;&#x43B;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; <code>Object.is()</code> &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; <code>==</code> &#x430;&#x431;&#x43E; <code>===</code>, &#x432;&#x438;&#x445;&#x43E;&#x434;&#x44F;&#x447;&#x438; &#x437; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x438;&#x441;&#x44C; &#x432;&#x430;&#x448; &#x43A;&#x43E;&#x434;.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-objectassign">&#x41C;&#x435;&#x442;&#x43E;&#x434; Object.assign()</h3>
<p><em>&#x414;&#x43E;&#x43C;&#x456;&#x448;&#x43A;&#x438; (mixins)</em> &#x454; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x437; &#x43D;&#x430;&#x439;&#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456;&#x448;&#x438;&#x445; &#x43F;&#x430;&#x442;&#x435;&#x440;&#x43D;&#x456;&#x432; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x457; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x443; JavaScript. &#x423; &#x434;&#x43E;&#x43C;&#x456;&#x448;&#x446;&#x456; &#x43E;&#x434;&#x438;&#x43D; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x442;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x432;&#x456;&#x434; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E;. &#x411;&#x430;&#x433;&#x430;&#x442;&#x43E; JavaScript&#x2013;&#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434; mixin &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x43D;&#x430; &#x446;&#x435;&#x439;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">mixin</span>(<span class="hljs-params">receiver, supplier</span>) </span>{
    <span class="hljs-built_in">Object</span>.keys(supplier).forEach(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">key</span>) </span>{
        receiver[key] = supplier[key];
    });

    <span class="hljs-keyword">return</span> receiver;
}
</code></pre>
<p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>mixin()</code> &#x456;&#x442;&#x435;&#x440;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x445; <code>supplier</code> &#x442;&#x430; &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x454; &#x457;&#x445; &#x434;&#x43E; <code>receiver</code> (&#x43D;&#x435;&#x43F;&#x43E;&#x432;&#x43D;&#x443; &#x43A;&#x43E;&#x43F;&#x456;&#x44E;, &#x443; &#x44F;&#x43A;&#x456;&#x439; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x454; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438;, &#x442;&#x43E;&#x434;&#x456; &#x44F;&#x43A; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438;). &#x426;&#x435; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; <code>receiver</code> &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x431;&#x435;&#x437; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">EventTarget</span>(<span class="hljs-params"></span>) </span>{ <span class="hljs-comment">/*...*/</span> }
EventTarget.prototype = {
    <span class="hljs-keyword">constructor</span>: EventTarget,
    emit: function() { <span class="hljs-comment">/*...*/</span> },
    on: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{ <span class="hljs-comment">/*...*/</span> }
};

<span class="hljs-keyword">var</span> myObject = {};
mixin(myObject, EventTarget.prototype);

myObject.emit(<span class="hljs-string">&quot;somethingChanged&quot;</span>);
</code></pre>
<p>&#x422;&#x443;&#x442; <code>myObject</code> &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; <code>EventTarget.prototype</code>. &#x426;&#x435; &#x434;&#x430;&#x454; <code>myObject</code> &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x434;&#x456;&#x457; &#x442;&#x430; &#x43F;&#x456;&#x434;&#x43F;&#x438;&#x441;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x43D;&#x438;&#x445; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; <code>emit()</code> &#x442;&#x430; <code>on()</code> &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;.</p>
<p>&#x426;&#x435;&#x439; &#x43F;&#x430;&#x442;&#x435;&#x440;&#x43D; &#x441;&#x442;&#x430;&#x432; &#x434;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x43C;, &#x442;&#x43E;&#x43C;&#x443; ECMAScript 6 &#x434;&#x43E;&#x434;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Object.assign()</code>, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;. &#x417;&#x43C;&#x456;&#x43D;&#x430; &#x456;&#x43C;&#x435;&#x43D;&#x456; &#x437; <code>mixin()</code> &#x43D;&#x430; <code>assign()</code> &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x454; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44E;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>mixin()</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; (<code>=</code>), &#x432;&#x456;&#x43D; &#x43D;&#x435; &#x437;&#x43C;&#x43E;&#x436;&#x435; &#x441;&#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;-&#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x447;&#x430; &#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;&#x2013;&#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x430;. &#x406;&#x43C;&#x2019;&#x44F; <code>Object.assign()</code> &#x431;&#x443;&#x43B;&#x43E; &#x43E;&#x431;&#x440;&#x430;&#x43D;&#x435; &#x449;&#x43E;&#x431; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x442;&#x438; &#x446;&#x44E; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x437;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;, &#x449;&#x43E; <code>Object.assign()</code> &#x43D;&#x435; &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;, &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x44F;&#x43A;&#x438;&#x445; &#x454; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438;, &#x44F;&#x43A;&#x456; &#x44F; &#x43E;&#x43F;&#x438;&#x448;&#x443; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 6.</p>
<p>I&gt; &#x421;&#x445;&#x43E;&#x436;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x443; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x445; &#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x445; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43C;&#x430;&#x442;&#x438; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x456; &#x442;&#x43E;&#x433;&#x43E; &#x436; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x443;: &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x43C;&#x438; &#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x430;&#x43C;&#x438; &#x454; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; <code>extend()</code> &#x442;&#x430; <code>mix()</code>. &#x423; ECMAScript 6 &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x431;&#x443;&#x432; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Object.mixin()</code> &#x43D;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x447;&#x443; &#x434;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>Object.assign()</code>. &#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x44E; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x431;&#x443;&#x43B;&#x43E; &#x442;&#x435;, &#x449;&#x43E; <code>Object.mixin()</code> &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x454; &#x449;&#x435; &#x439; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;-&#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x438;, &#x430;&#x43B;&#x435; &#x446;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43E; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>super</code> (&#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43E; &#x443; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456; &quot;&#x41B;&#x435;&#x433;&#x43A;&#x438;&#x439; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; super&quot; &#x446;&#x456;&#x454;&#x457; &#x433;&#x43B;&#x430;&#x432;&#x438;).</p>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>Object.assign()</code> &#x443;&#x441;&#x44E;&#x434;&#x438; &#x434;&#x435;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>mixin()</code> &#x43C;&#x43E;&#x433;&#x43B;&#x430; &#x431;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">EventTarget</span>(<span class="hljs-params"></span>) </span>{ <span class="hljs-comment">/*...*/</span> }
EventTarget.prototype = {
    <span class="hljs-keyword">constructor</span>: EventTarget,
    emit: function() { <span class="hljs-comment">/*...*/</span> },
    on: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{ <span class="hljs-comment">/*...*/</span> }
}

<span class="hljs-keyword">var</span> myObject = {}
<span class="hljs-built_in">Object</span>.assign(myObject, EventTarget.prototype);

myObject.emit(<span class="hljs-string">&quot;somethingChanged&quot;</span>);
</code></pre>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Object.assign()</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x456;&#x434;&#x434;&#x430;&#x432;&#x430;&#x447;&#x456;&#x432; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;. &#x41F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x447; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x443; &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x456;&#x434;&#x434;&#x430;&#x432;&#x430;&#x447;&#x456; &#x431;&#x443;&#x43B;&#x438; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x456;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x432;&#x456;&#x434;&#x434;&#x430;&#x432;&#x430;&#x447; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x432;&#x456;&#x434;&#x434;&#x430;&#x432;&#x430;&#x447;&#x430; &#x432; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x447;&#x456;, &#x449;&#x43E; &#x439; &#x456;&#x43B;&#x44E;&#x441;&#x442;&#x440;&#x443;&#x454; &#x446;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> receiver = {};

<span class="hljs-built_in">Object</span>.assign(receiver,
    {
        type: <span class="hljs-string">&quot;js&quot;</span>,
        name: <span class="hljs-string">&quot;file.js&quot;</span>
    },
    {
        type: <span class="hljs-string">&quot;css&quot;</span>
    }
);

<span class="hljs-built_in">console</span>.log(receiver.type);     <span class="hljs-comment">// &quot;css&quot;</span>
<span class="hljs-built_in">console</span>.log(receiver.name);     <span class="hljs-comment">// &quot;file.js&quot;</span>
</code></pre>
<p>&#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; <code>receiver.type</code> &#x431;&#x443;&#x434;&#x435; <code>&quot;css&quot;</code> &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x432;&#x456;&#x434;&#x434;&#x430;&#x432;&#x430;&#x447; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x432; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E;.</p>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Object.assign()</code> &#x43D;&#x435; &#x454; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x438;&#x43C; &#x434;&#x43E;&#x43F;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43E; ECMAScript 6, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x456;&#x43D; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x454; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x44F;&#x43A;&#x430; &#x43D;&#x430;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x430;&#x433;&#x430;&#x442;&#x44C;&#x43C;&#x430; JavaScript&#x2013;&#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x43C;&#x438;.</p>
<h3 id="a-&#x440;&#x43E;&#x431;&#x43E;&#x442;&#x430;-&#x437;-&#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438;&#x2013;&#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x430;&#x43C;&#x438;">A&gt; &#x420;&#x43E;&#x431;&#x43E;&#x442;&#x430; &#x437; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438;&#x2013;&#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x430;&#x43C;&#x438;</h3>
<p>A&gt; &#x417;&#x430;&#x43F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x430;&#x439;&#x442;&#x435;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x456;&#x434;&#x434;&#x430;&#x432;&#x430;&#x447; &#x43C;&#x430;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;&#x2013;&#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x438;, &#x442;&#x43E; <code>Object.assign()</code> &#x43D;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x44C; &#x457;&#x445; &#x443; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x447;&#x456;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>Object.assign()</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;, &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x430; &#x443; &#x432;&#x456;&#x434;&#x434;&#x430;&#x432;&#x430;&#x447;&#x456; &#x441;&#x442;&#x430;&#x43D;&#x435; &#x43F;&#x43E;&#x43B;&#x435;&#x43C; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x447;&#x456;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"> <span class="hljs-keyword">var</span> receiver = {},
     supplier = {
         get name() {
             <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;file.js&quot;</span>
         }
     };

 <span class="hljs-built_in">Object</span>.assign(receiver, supplier);

 <span class="hljs-keyword">var</span> descriptor = <span class="hljs-built_in">Object</span>.getOwnPropertyDescriptor(receiver, <span class="hljs-string">&quot;name&quot;</span>);

 <span class="hljs-built_in">console</span>.log(descriptor.value);      <span class="hljs-comment">// &quot;file.js&quot;</span>
 <span class="hljs-built_in">console</span>.log(descriptor.get);        <span class="hljs-comment">// undefined</span>
</code></pre>
<p>A&gt; &#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, <code>supplier</code> &#x43C;&#x430;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;&#x2013;&#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440; &#x43F;&#x456;&#x434; &#x43D;&#x430;&#x437;&#x432;&#x43E;&#x44E; <code>name</code>. &#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>Object.assign()</code>, &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>receiver.name</code> &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x43B;&#x435;&#x43C; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; <code>&quot;file.js&quot;</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; <code>supplier.name</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; <code>&quot;file.js&quot;</code>, &#x43A;&#x43E;&#x43B;&#x438; <code>Object.assign()</code> &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x43E;.</p>
<h2 id="&#x434;&#x443;&#x431;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;-&#x443;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445;-&#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;&#x445;">&#x414;&#x443;&#x431;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;&#x445;</h2>
<p>&#x421;&#x442;&#x440;&#x43E;&#x433;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x443; ECMAScript 5 &#x432;&#x432;&#x43E;&#x434;&#x438;&#x432; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x443; &#x434;&#x443;&#x431;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;&#x445;, &#x449;&#x43E; &#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x43A;&#x443;&#x432;&#x430;&#x43B;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x434;&#x443;&#x431;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x441;&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x438;&#x432; &#x431;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-meta">&quot;use strict&quot;</span>;

<span class="hljs-keyword">var</span> person = {
    name: <span class="hljs-string">&quot;Nicholas&quot;</span>,
    name: <span class="hljs-string">&quot;Greg&quot;</span>        <span class="hljs-comment">// &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x443; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; ES5</span>
};
</code></pre>
<p>&#x41F;&#x440;&#x438; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x443; &#x443; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; ECMAScript 5, &#x434;&#x440;&#x443;&#x433;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>name</code> &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x434;&#x435; &#x434;&#x43E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x457; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;. &#x41F;&#x440;&#x43E;&#x442;&#x435; &#x443; ECMAScript 6, &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x430; &#x434;&#x443;&#x431;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x431;&#x443;&#x43B;&#x430; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x430;. &#x42F;&#x43A; &#x443; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x442;&#x430;&#x43A; &#x456; &#x432; &#x43D;&#x435;&#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x430;&#x445; &#x43A;&#x43E;&#x434; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x434;&#x443;&#x431;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x437; &#x434;&#x430;&#x43D;&#x438;&#x43C; &#x456;&#x43C;&#x2019;&#x44F;&#x43C; &#x441;&#x442;&#x430;&#x43D;&#x435; &#x430;&#x43A;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;, &#x44F;&#x43A; &#x456; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x442;&#x443;&#x442;:</p>
<pre><code class="lang-js"><span class="hljs-meta">&quot;use strict&quot;</span>;

<span class="hljs-keyword">var</span> person = {
    name: <span class="hljs-string">&quot;Nicholas&quot;</span>,
    name: <span class="hljs-string">&quot;Greg&quot;</span>        <span class="hljs-comment">// &#x43D;&#x456;&#x44F;&#x43A;&#x43E;&#x457; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x443; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; ES6</span>
};

<span class="hljs-built_in">console</span>.log(person.name);       <span class="hljs-comment">// &quot;Greg&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; <code>person.name</code> &#x431;&#x443;&#x434;&#x435; is <code>&quot;Greg&quot;</code> &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x446;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x435; &#x446;&#x456;&#x439; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;.</p>
<h2 id="&#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x439;-&#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A;-&#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x435;&#x43D;&#x43D;&#x44F;-&#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;">&#x412;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x439; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;</h2>
<p>ECMAScript 5 &#x43D;&#x435; &#x437;&#x430;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x2014; &#x446;&#x435; &#x43F;&#x43E;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x43D;&#x430; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43A;&#x456;&#x432; JavaScript&#x2013;&#x440;&#x443;&#x448;&#x456;&#x457;&#x432;. &#x41E;&#x434;&#x43D;&#x430;&#x43A; ECMAScript 6 &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x443; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44C;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x43E;&#x43D;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x440;&#x430;&#x445;&#x43E;&#x432;&#x430;&#x43D;&#x456;. &#x426;&#x435; &#x432;&#x43F;&#x43B;&#x438;&#x432;&#x430;&#x454; &#x43D;&#x430; &#x442;&#x435;, &#x44F;&#x43A; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437; <code>Object.getOwnPropertyNames()</code> &#x442;&#x430; <code>Reflect.ownKeys</code> (&#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43E; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 12). &#x426;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x43F;&#x43B;&#x438;&#x432;&#x430;&#x454; &#x43D;&#x430; &#x442;&#x435;, &#x44F;&#x43A; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>Object.assign()</code>.</p>
<p>&#x411;&#x430;&#x437;&#x43E;&#x432;&#x438;&#x439; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x43A;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x442;&#x430;&#x43A;&#x438;&#x439;:</p>
<ol>
<li>&#x412;&#x441;&#x456; &#x43D;&#x443;&#x43C;&#x435;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x437;&#x440;&#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;.</li>
<li>&#x412;&#x441;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x456; &#x434;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;.</li>
<li>&#x412;&#x441;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456; (&#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43E; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 6) &#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x456; &#x434;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;.</li>
</ol>
<p>&#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> obj = {
    a: <span class="hljs-number">1</span>,
    <span class="hljs-number">0</span>: <span class="hljs-number">1</span>,
    c: <span class="hljs-number">1</span>,
    <span class="hljs-number">2</span>: <span class="hljs-number">1</span>,
    b: <span class="hljs-number">1</span>,
    <span class="hljs-number">1</span>: <span class="hljs-number">1</span>
};

obj.d = <span class="hljs-number">1</span>;

<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.getOwnPropertyNames(obj).join(<span class="hljs-string">&quot;&quot;</span>));     <span class="hljs-comment">// &quot;012acbd&quot;</span>
</code></pre>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Object.getOwnPropertyNames()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>obj</code> &#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;: <code>0</code>, <code>1</code>, <code>2</code>, <code>a</code>, <code>c</code>, <code>b</code>, <code>d</code>. &#x417;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;, &#x449;&#x43E; &#x43D;&#x443;&#x43C;&#x435;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x437;&#x433;&#x440;&#x443;&#x43F;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x442;&#x430; &#x432;&#x456;&#x434;&#x441;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x456;, &#x445;&#x43E;&#x447;&#x430; &#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x43C;&#x443; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456; &#x432;&#x43E;&#x43D;&#x438; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x456; &#x443; &#x434;&#x43E;&#x432;&#x456;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;. &#x420;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x456;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43D;&#x443;&#x43C;&#x435;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x442;&#x430; &#x432; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x457;&#x445; &#x431;&#x443;&#x43B;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x43E; &#x434;&#x43E; <code>obj</code>. &#x41A;&#x43B;&#x44E;&#x447;&#x456; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x456; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x43C;&#x443; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456; &#x439;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x443;, &#x437;&#x430; &#x43D;&#x438;&#x43C;&#x438; &#x441;&#x43B;&#x456;&#x434;&#x443;&#x44E;&#x442;&#x44C; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x456;&#x447;&#x43D;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;, &#x449;&#x43E; &#x431;&#x443;&#x43B;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x456; &#x43F;&#x456;&#x437;&#x43D;&#x456;&#x448;&#x435; (&#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; <code>d</code>).</p>
<p>W&gt; &#x426;&#x438;&#x43A;&#x43B; <code>for-in</code> &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454; &#x43C;&#x430;&#x442;&#x438; &#x43D;&#x435;&#x437;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x439; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43D;&#x435; &#x432;&#x441;&#x456; JavaScript&#x2013;&#x440;&#x443;&#x448;&#x456;&#x457; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x44E;&#x442;&#x44C; &#x439;&#x43E;&#x433;&#x43E; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x43E;. &#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; Object.keys() &#x442;&#x430; JSON.stringify() &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438;&#x439; (&#x43D;&#x435;&#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x439;) &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A; &#x456; <code>for-in</code>.</p>
<p>&#x41F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x454; &#x43C;&#x430;&#x43B;&#x435;&#x43D;&#x44C;&#x43A;&#x43E;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x43E;&#x44E; &#x443; &#x442;&#x43E;&#x43C;&#x443; &#x44F;&#x43A; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; JavaScript, &#x430;&#x434;&#x436;&#x435; &#x434;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x432;&#x430;&#x436;&#x43A;&#x43E; &#x437;&#x43D;&#x430;&#x439;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;, &#x43A;&#x43E;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x430; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x430; &#x44F;&#x43A;&#x43E;&#x457; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x438;&#x442;&#x44C; &#x432;&#x456;&#x434; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. ECMAScript 6, &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C;&#x438;, &#x449;&#x43E; JavaScript&#x2013;&#x43A;&#x43E;&#x434;, &#x44F;&#x43A;&#x438;&#x439; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x438;&#x442;&#x44C; &#x432;&#x456;&#x434; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x43A;&#x443; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;, &#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x434;&#x435; &#x432;&#x456;&#x43D; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;.</p>
<h2 id="&#x431;&#x456;&#x43B;&#x44C;&#x448;-&#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x456;-&#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x438;">&#x411;&#x456;&#x43B;&#x44C;&#x448; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x456; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x438;</h2>
<p>&#x41F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x438; &#x454; &#x444;&#x443;&#x43D;&#x434;&#x430;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x443; JavaScript, &#x430; ECMAScript 6 &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x438;&#x43C;&#x438;. &#x41F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; JavaScript &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43D;&#x435;&#x432;&#x435;&#x43B;&#x438;&#x43A;&#x443; &#x441;&#x432;&#x43E;&#x431;&#x43E;&#x434;&#x443; &#x434;&#x456;&#x439; &#x43D;&#x430;&#x434; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438;. &#x41E;&#x434;&#x43D;&#x430;&#x43A; &#x437;&#x456; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43C;&#x43E;&#x432;&#x438; &#x442;&#x430; &#x442;&#x438;&#x43C;, &#x449;&#x43E; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x43B;&#x438; &#x43A;&#x440;&#x430;&#x449;&#x435; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438; &#x44F;&#x43A; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x438;, &#x441;&#x442;&#x430;&#x43B;&#x43E; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x43E;, &#x449;&#x43E; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x431;&#x430;&#x436;&#x430;&#x44E;&#x442;&#x44C; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x44E; &#x43D;&#x430;&#x434; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x43B;&#x435;&#x433;&#x448;&#x438;&#x445; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x456;&#x432; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x43D;&#x438;&#x43C;&#x438;. &#x42F;&#x43A; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;, ECMAScript 6 &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43F;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x44C; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x456;&#x432;.</p>
<h3 id="&#x437;&#x43C;&#x456;&#x43D;&#x430;-&#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x430;">&#x417;&#x43C;&#x456;&#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;</h3>
<p>&#x417;&#x430;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x437;&#x430;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;, &#x430;&#x431;&#x43E; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;, &#x430;&#x431;&#x43E; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Object.create()</code>. &#x406;&#x434;&#x435;&#x44F;, &#x449;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x43C; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x431;&#x443;&#x43B;&#x430; &#x43E;&#x434;&#x43D;&#x456;&#x454;&#x44E; &#x437; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x438;&#x445; &#x434;&#x43E;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x44C; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; JavaScript &#x43D;&#x430; ECMAScript 5. ECMAScript 5 &#x434;&#x43E;&#x434;&#x430;&#x432; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Object.getPrototypeOf()</code> &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43D;&#x435; &#x432;&#x438;&#x441;&#x442;&#x430;&#x447;&#x430;&#x43B;&#x43E; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457;.</p>
<p>ECMAScript 6 &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454; &#x446;&#x435; &#x434;&#x43E;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>Object.setPrototypeOf()</code>, &#x44F;&#x43A;&#x438;&#x439; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Object.setPrototypeOf()</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x434;&#x432;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;: &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x442;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;, &#x449;&#x43E; &#x441;&#x442;&#x430;&#x43D;&#x435; &#x439;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x43E;&#x43C;. &#x414;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> person = {
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Hello&quot;</span>;
    }
};

<span class="hljs-keyword">let</span> dog = {
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Woof&quot;</span>;
    }
};

<span class="hljs-comment">// person &#x2014; &#x446;&#x435; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;</span>
<span class="hljs-keyword">let</span> friend = <span class="hljs-built_in">Object</span>.create(person);
<span class="hljs-built_in">console</span>.log(friend.getGreeting());                      <span class="hljs-comment">// &quot;Hello&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.getPrototypeOf(friend) === person);  <span class="hljs-comment">// true</span>

<span class="hljs-comment">// &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x43C;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F; dog</span>
<span class="hljs-built_in">Object</span>.setPrototypeOf(friend, dog);
<span class="hljs-built_in">console</span>.log(friend.getGreeting());                      <span class="hljs-comment">// &quot;Woof&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.getPrototypeOf(friend) === dog);     <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x437;&#x430;&#x434;&#x430;&#x454; &#x434;&#x432;&#x430; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;: <code>person</code> &#x442;&#x430; <code>dog</code>. &#x41E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>getGreeting()</code>, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x440;&#x44F;&#x434;&#x43E;&#x43A;. &#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>friend</code> &#x441;&#x43F;&#x435;&#x440;&#x448;&#x443; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; <code>person</code>, &#x442;&#x43E;&#x43C;&#x443; <code>getGreeting()</code> &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; <code>&quot;Hello&quot;</code>. &#x41A;&#x43E;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x43E;&#x43C; &#x441;&#x442;&#x430;&#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>dog</code>, <code>person.getGreeting()</code> &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; <code>&quot;Woof&quot;</code> &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x435; &#x432;&#x456;&#x434;&#x43D;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x437; <code>person</code> &#x431;&#x443;&#x43B;&#x43E; &#x440;&#x43E;&#x437;&#x456;&#x440;&#x432;&#x430;&#x43D;&#x435;.</p>
<p>&#x414;&#x456;&#x439;&#x441;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x441;&#x443;&#x442;&#x43E; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x456;&#x439; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x456;&#x434; &#x43D;&#x430;&#x437;&#x432;&#x43E;&#x44E; <code>[[Prototype]]</code>. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Object.getPrototypeOf()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>[[Prototype]]</code>, &#x430; <code>Object.setPrototypeOf()</code> &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>[[Prototype]]</code>. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x446;&#x435; &#x43D;&#x435; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x434;&#x456;&#x457; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; <code>[[Prototype]]</code>.</p>
<h3 id="&#x43B;&#x435;&#x433;&#x43A;&#x438;&#x439;-&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;-&#x434;&#x43E;-&#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443;-&#x447;&#x435;&#x440;&#x435;&#x437;-&#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;-super">&#x41B;&#x435;&#x433;&#x43A;&#x438;&#x439; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; super</h3>
<p>&#x42F;&#x43A; &#x432;&#x436;&#x435; &#x437;&#x433;&#x430;&#x434;&#x443;&#x432;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435;, &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x438; &#x434;&#x443;&#x436;&#x435; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x456; &#x434;&#x43B;&#x44F; JavaScript &#x456; &#x443; ECMAScript 6 &#x431;&#x443;&#x43B;&#x43E; &#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x43E; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x457;&#x445; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43B;&#x435;&#x433;&#x448;&#x438;&#x43C;. &#x429;&#x435; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x43F;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x454; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; <code>super</code>, &#x44F;&#x43A;&#x435; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x43B;&#x435;&#x433;&#x448;&#x438;&#x43C; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x443; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x449;&#x43E;&#x431; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x443; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;, &#x449;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x456;&#x43C;&#x2019;&#x44F;&#x43C;, &#x43D;&#x430; ECMAScript 5 &#x432;&#x438; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x43B;&#x438; &#x431; &#x449;&#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;&#x435;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> person = {
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Hello&quot;</span>;
    }
};

<span class="hljs-keyword">let</span> dog = {
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Woof&quot;</span>;
    }
};


<span class="hljs-keyword">let</span> friend = {
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-built_in">Object</span>.getPrototypeOf(<span class="hljs-keyword">this</span>).getGreeting.call(<span class="hljs-keyword">this</span>) + <span class="hljs-string">&quot;, hi!&quot;</span>;
    }
};

<span class="hljs-comment">// &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x43C;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F; person</span>
<span class="hljs-built_in">Object</span>.setPrototypeOf(friend, person);
<span class="hljs-built_in">console</span>.log(friend.getGreeting());                      <span class="hljs-comment">// &quot;Hello, hi!&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.getPrototypeOf(friend) === person);  <span class="hljs-comment">// true</span>

<span class="hljs-comment">// &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x43C;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F; dog</span>
<span class="hljs-built_in">Object</span>.setPrototypeOf(friend, dog);
<span class="hljs-built_in">console</span>.log(friend.getGreeting());                      <span class="hljs-comment">// &quot;Woof, hi!&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.getPrototypeOf(friend) === dog);     <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, <code>getGreeting()</code> &#x443; <code>friend</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x430; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x456;&#x43C;&#x2019;&#x44F;&#x43C;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Object.getPrototypeOf()</code> &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x454; &#x447;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;, &#x430; &#x442;&#x43E;&#x434;&#x456; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x443;. &#x414;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; <code>.call(this)</code> &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x454; &#x447;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>this</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43E; &#x43A;&#x43E;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;.</p>
<p>&#x41D;&#x435; &#x437;&#x430;&#x431;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>Object.getPrototypeOf()</code> &#x442;&#x430; <code>.call(this)</code> &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x2014; &#x446;&#x435; &#x434;&#x435;&#x449;&#x43E; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;, &#x442;&#x43E;&#x43C;&#x443; ECMAScript 6 &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; <code>super</code>. &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x442;&#x430; &#x43F;&#x43E;&#x43B;&#x44F;&#x433;&#x430;&#x454; &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; <code>super</code> &#x2014; &#x446;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x456;&#x432;&#x43D;&#x438;&#x43A; &#x43D;&#x430; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;, &#x444;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>Object.getPrototypeOf(this)</code>. &#x417;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x446;&#x435;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>getGreeting()</code> &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> friend = {
    getGreeting() {
        <span class="hljs-comment">// &#x443; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x446;&#x435; &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435;, &#x449;&#x43E;:</span>
        <span class="hljs-comment">// Object.getPrototypeOf(this).getGreeting.call(this)</span>
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">super</span>.getGreeting() + <span class="hljs-string">&quot;, hi!&quot;</span>;
    }
};
</code></pre>
<p>&#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>super.getGreeting()</code> &#x2014; &#x446;&#x435; &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435;, &#x449;&#x43E; <code>Object.getPrototypeOf(this).getGreeting.call(this)</code> &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43A;&#x441;&#x442;&#x456;. &#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; <code>super</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443;. &#x421;&#x43F;&#x440;&#x43E;&#x431;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; <code>super</code> &#x43F;&#x43E;&#x437;&#x430; &#x43B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x438;&#x43C;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x434;&#x435; &#x434;&#x43E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x457; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;, &#x44F;&#x43A; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> friend = {
    getGreeting: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">super</span>.getGreeting() + <span class="hljs-string">&quot;, hi!&quot;</span>;
    }
};

friend.getGreeting();       <span class="hljs-comment">// &#x43A;&#x438;&#x43D;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;!</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x456;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x437; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>friend.getGreeting()</code> &#x43A;&#x438;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>super</code> &#x43D;&#x435; &#x454; &#x432;&#x430;&#x43B;&#x456;&#x434;&#x43D;&#x438;&#x43C; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43A;&#x441;&#x442;&#x456;.</p>
<p>&#x41F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; <code>super</code> &#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x454; &#x434;&#x443;&#x436;&#x435; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x438;&#x43C;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x440;&#x456;&#x432;&#x43D;&#x456;&#x432; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, <code>Object.getPrototypeOf()</code> &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x456;&#x432;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> person = {
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Hello&quot;</span>;
    }
};

<span class="hljs-comment">// person &#x2014; &#x446;&#x435; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;</span>
<span class="hljs-keyword">let</span> friend = {
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-built_in">Object</span>.getPrototypeOf(<span class="hljs-keyword">this</span>).getGreeting.call(<span class="hljs-keyword">this</span>) + <span class="hljs-string">&quot;, hi!&quot;</span>;
    }
};
<span class="hljs-built_in">Object</span>.setPrototypeOf(friend, person);


<span class="hljs-comment">// friend &#x2014; &#x446;&#x435; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;</span>
<span class="hljs-keyword">let</span> relative = <span class="hljs-built_in">Object</span>.create(friend);

<span class="hljs-built_in">console</span>.log(person.getGreeting());                  <span class="hljs-comment">// &quot;Hello&quot;</span>
<span class="hljs-built_in">console</span>.log(friend.getGreeting());                  <span class="hljs-comment">// &quot;Hello, hi!&quot;</span>
<span class="hljs-built_in">console</span>.log(relative.getGreeting());                <span class="hljs-comment">// error!</span>
</code></pre>
<p>&#x417;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; <code>Object.getPrototypeOf()</code> &#x441;&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; <code>relative.getGreeting()</code> &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x438;&#x439;. &#x426;&#x435; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; <code>this</code> &#x454; <code>relative</code>, &#x430; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x43E;&#x43C; <code>relative</code> &#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>friend</code>. &#x41A;&#x43E;&#x43B;&#x438; <code>friend.getGreeting().call()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; <code>relative</code> &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; <code>this</code>, &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x43E;&#x432;&#x443; &#x456; &#x437;&#x43D;&#x43E;&#x432;&#x443; &#x442;&#x430; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x440;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x43E; &#x434;&#x43E;&#x43A;&#x438; &#x43D;&#x435; &#x432;&#x438;&#x43D;&#x438;&#x43A;&#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x442;&#x435;&#x43A;&#x443;.</p>
<p>&#x426;&#x44E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443; &#x432;&#x430;&#x436;&#x43A;&#x43E; &#x432;&#x438;&#x440;&#x456;&#x448;&#x438;&#x442;&#x438; &#x443; ECMAScript 5, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x437; ECMAScript 6 &#x442;&#x430; <code>super</code> &#x446;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> person = {
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Hello&quot;</span>;
    }
};

<span class="hljs-comment">// person &#x2014; &#x446;&#x435; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;</span>
<span class="hljs-keyword">let</span> friend = {
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">super</span>.getGreeting() + <span class="hljs-string">&quot;, hi!&quot;</span>;
    }
};
<span class="hljs-built_in">Object</span>.setPrototypeOf(friend, person);


<span class="hljs-comment">// friend &#x2014; &#x446;&#x435; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;</span>
<span class="hljs-keyword">let</span> relative = <span class="hljs-built_in">Object</span>.create(friend);

<span class="hljs-built_in">console</span>.log(person.getGreeting());                  <span class="hljs-comment">// &quot;Hello&quot;</span>
<span class="hljs-built_in">console</span>.log(friend.getGreeting());                  <span class="hljs-comment">// &quot;Hello, hi!&quot;</span>
<span class="hljs-built_in">console</span>.log(relative.getGreeting());                <span class="hljs-comment">// &quot;Hello, hi!&quot;</span>
</code></pre>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; <code>super</code> &#x43D;&#x435; &#x454; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x456;&#x447;&#x43D;&#x438;&#x43C;, &#x432;&#x43E;&#x43D;&#x43E; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x454; &#x43D;&#x430; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;. &#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, <code>super.getGreeting()</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438;&#x43C;&#x435; <code>person.getGreeting()</code>, &#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E; &#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x44E;&#x442;&#x44C; &#x446;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434;.</p>
<h2 id="&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x435;-&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;-&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;">&#x424;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;</h2>
<p>&#x414;&#x43E; ECMAScript 6 &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x442;&#x44F; &#xAB;&#x43C;&#x435;&#x442;&#x43E;&#x434;&#xBB; &#x43D;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x43C;. &#x41C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x43B;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x434;&#x430;&#x43D;&#x438;&#x445;. ECMAScript 6 &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x44F;&#x43A; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x449;&#x43E; &#x43C;&#x430;&#x454; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>[[HomeObject]]</code>, &#x44F;&#x43A;&#x430; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;, &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x446;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x438;&#x442;&#x44C;. &#x420;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> person = {

    <span class="hljs-comment">// &#x43C;&#x435;&#x442;&#x43E;&#x434;</span>
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Hello&quot;</span>;
    }
};

<span class="hljs-comment">// &#x43D;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434;</span>
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">shareGreeting</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Hi!&quot;</span>;
}
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x437;&#x430;&#x434;&#x430;&#x454; <code>person</code> &#x437; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43C; <code>getGreeting()</code>. <code>[[HomeObject]]</code> &#x434;&#x43B;&#x44F; <code>getGreeting()</code> &#x431;&#x443;&#x434;&#x435; <code>person</code> &#x432;&#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x43A; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x446;&#x456;&#x454;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x43D;&#x44C;&#x43E; &#x434;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;. &#x417; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x431;&#x43E;&#x43A;&#x443;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>shareGreeting()</code>, &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x43E;&#x433;&#x43E; <code>[[HomeObject]]</code> &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x430; &#x43D;&#x435; &#x431;&#x443;&#x43B;&#x430; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;. &#x423; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x456;&#x432;, &#x446;&#x44F; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43D;&#x435; &#x454; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x44E;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x43E;&#x43D;&#x430; &#x441;&#x442;&#x430;&#x454; &#x434;&#x443;&#x436;&#x435; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x44E; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; <code>super</code>.</p>
<p>&#x411;&#x443;&#x434;&#x44C;&#x2014;&#x44F;&#x43A;&#x435; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; <code>super</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; <code>[[HomeObject]]</code> &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x438;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x43C; &#x43A;&#x440;&#x43E;&#x43A;&#x43E;&#x43C; &#x454; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>Object.getPrototypeOf()</code> &#x434;&#x43B;&#x44F; <code>[[HomeObject]]</code>, &#x449;&#x43E;&#x431; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;. &#x41F;&#x43E;&#x442;&#x456;&#x43C; &#x443; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x456; &#x448;&#x443;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x456;&#x43C;&#x2019;&#x44F;&#x43C;. &#x41D;&#x430;&#x440;&#x435;&#x448;&#x442;&#x456; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>this</code>-&#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;. &#x42F;&#x43A;&#x449;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43D;&#x435; &#x43C;&#x430;&#x454; <code>[[HomeObject]]</code>, &#x430;&#x431;&#x43E; &#x43C;&#x430;&#x454; &#x432;&#x456;&#x434;&#x43C;&#x43D;&#x456;&#x43D;&#x43D;&#x438;&#x439; <code>[[HomeObject]]</code> &#x432;&#x456;&#x434; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E;, &#x442;&#x43E;&#x434;&#x456; &#x446;&#x435;&#x439; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441; &#x43F;&#x440;&#x438;&#x43F;&#x438;&#x43D;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x456; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;, &#x44F;&#x43A; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x448;&#x43C;&#x430;&#x442;&#x43E;&#x447;&#x43A;&#x443; &#x43A;&#x43E;&#x434;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> person = {
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Hello&quot;</span>;
    }
};

<span class="hljs-comment">// person &#x2014; &#x446;&#x435; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;</span>
<span class="hljs-keyword">let</span> friend = {
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">super</span>.getGreeting() + <span class="hljs-string">&quot;, hi!&quot;</span>;
    }
};
<span class="hljs-built_in">Object</span>.setPrototypeOf(friend, person);

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">getGlobalGreeting</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">super</span>.getGreeting() + <span class="hljs-string">&quot;, yo!&quot;</span>;
}

<span class="hljs-built_in">console</span>.log(friend.getGreeting());  <span class="hljs-comment">// &quot;Hello, hi!&quot;</span>

getGlobalGreeting();                <span class="hljs-comment">// &#x43A;&#x438;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;</span>
</code></pre>
<p>&#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>friend.getGreeting()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x442;&#x43E;&#x434;&#x456; &#x44F;&#x43A; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>getGlobalGreeting()</code> &#x43A;&#x438;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x43F;&#x440;&#x43E; &#x43D;&#x435;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>super</code>. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>getGlobalGreeting()</code> &#x43D;&#x435; &#x43C;&#x430;&#x454; <code>[[HomeObject]]</code>, &#x43D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x443; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443;.</p>
<p>&#x426;&#x456;&#x43A;&#x430;&#x432;&#x43E;, &#x449;&#x43E; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x456;&#x44F; &#x43D;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x44C;&#x441;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; <code>getGlobalGreeting()</code> &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x457;&#x442;&#x438; &#x44F;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; <code>friend</code>, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// prototype is person</span>
<span class="hljs-keyword">let</span> friend = {
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">super</span>.getGreeting() + <span class="hljs-string">&quot;, hi!&quot;</span>;
    }
};
<span class="hljs-built_in">Object</span>.setPrototypeOf(friend, person);

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">getGlobalGreeting</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">super</span>.getGreeting() + <span class="hljs-string">&quot;, yo!&quot;</span>;
}

<span class="hljs-built_in">console</span>.log(friend.getGreeting());  <span class="hljs-comment">// &quot;Hello, hi!&quot;</span>

<span class="hljs-comment">// &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x43C;&#x43E; getGreeting &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;</span>
friend.getGreeting = getGlobalGreeting;

friend.getGreeting();               <span class="hljs-comment">// &#x43A;&#x438;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;</span>
</code></pre>
<p>&#x422;&#x443;&#x442; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>getGlobalGreeting()</code> &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x454; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>getGreeting()</code> &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; <code>friend</code>. &#x417;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; <code>friend.getGreeting()</code>, &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x434;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x442;&#x435;&#x43F;&#x435;&#x440; <code>getGlobalGreeting()</code> &#x431;&#x443;&#x434;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43C;, &#x44F;&#x43A;&#x438;&#x439; &#x43D;&#x435; &#x43C;&#x430;&#x454; <code>[[HomeObject]]</code>. &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>[[HomeObject]]</code> &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x435; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x442;&#x43E;&#x436; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x434;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x43D;&#x435; &#x432;&#x438;&#x440;&#x456;&#x448;&#x443;&#x454; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438;.</p>
<h2 id="&#x43F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;">&#x41F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;</h2>
<p>&#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x454; &#x441;&#x442;&#x43E;&#x432;&#x43F;&#x43E;&#x43C; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; JavaScript, &#x430; ECMAScript 6 &#x437;&#x440;&#x43E;&#x431;&#x438;&#x432; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x445; &#x437;&#x43C;&#x456;&#x43D; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x449;&#x43E; &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x442;&#x44C; &#x457;&#x445; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x456;&#x448;&#x438;&#x43C;&#x438; &#x442;&#x430; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C;&#x438;.</p>
<p>ECMAScript 6 &#x432;&#x43D;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x437;&#x43C;&#x456;&#x43D; &#x434;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;&#x432;. &#x421;&#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;  &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x441;&#x43F;&#x440;&#x43E;&#x449;&#x443;&#x454; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x437; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x457; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;. &#x41E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43D;&#x435;&#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x456;&#x43C;&#x435;&#x43D; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x442;&#x430;&#x43A;, &#x44F;&#x43A; &#x446;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x432; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430;&#x445; &#x43C;&#x43E;&#x432;&#x438;. &#x41B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x43D;&#x43E; &#x43C;&#x435;&#x43D;&#x448;&#x435; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;&#x445;, &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C; &#x443;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x432;&#x43E;&#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x438; &#x442;&#x430; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>function</code>. ECMAScript 6 &#x43F;&#x43E;&#x441;&#x43B;&#x430;&#x431;&#x43B;&#x44E;&#x454; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x443; &#x434;&#x443;&#x431;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x456;&#x43C;&#x435;&#x43D; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;&#x445;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43C;&#x430;&#x442;&#x438; &#x434;&#x432;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x437; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x430;&#x43C;&#x438; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x43C;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456; &#x431;&#x435;&#x437; &#x432;&#x438;&#x43D;&#x438;&#x43A;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;.</p>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Object.assign()</code> &#x441;&#x43F;&#x440;&#x43E;&#x449;&#x443;&#x454; &#x437;&#x43C;&#x456;&#x43D;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x43E;&#x434;&#x43D;&#x43E;&#x447;&#x430;&#x441;&#x43D;&#x43E;. &#x412;&#x456;&#x43D; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x44F;&#x432;&#x438;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x443;&#x436;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43C;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x454;&#x442;&#x435;&#x441;&#x44C; mixin&#x2013;&#x43F;&#x430;&#x442;&#x435;&#x440;&#x43D;&#x43E;&#x43C;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Object.is()</code> &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x454; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x443; &#x440;&#x456;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x431;&#x443;&#x434;&#x443;&#x447;&#x438; &#x435;&#x444;&#x435;&#x43A;&#x442;&#x43D;&#x438;&#x432;&#x43D;&#x43E;&#x44E; &#x442;&#x430; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x456;&#x448;&#x43E;&#x44E; &#x432;&#x435;&#x440;&#x441;&#x456;&#x454;&#x44E; <code>===</code> &#x43F;&#x440;&#x438; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x456; &#x437;&#x456; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; JavaScript.</p>
<p>&#x423; ECMAScript 6 &#x442;&#x435;&#x43F;&#x435;&#x440; &#x447;&#x456;&#x442;&#x43A;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;. &#x41F;&#x440;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x435;&#x43D;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x43D;&#x443;&#x43C;&#x435;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x439;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x443; &#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x437;&#x440;&#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;, &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x439;&#x434;&#x443;&#x442;&#x44C; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x417;&#x430;&#x432;&#x434;&#x44F;&#x43A;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>Object.setPrototypeOf()</code> &#x442;&#x435;&#x43F;&#x435;&#x440; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x431;&#x443;&#x43B;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E;.</p>
<p>&#x41D;&#x430;&#x440;&#x435;&#x448;&#x442;&#x456;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>super</code> &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;. &#x412;&#x456;&#x43D; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x44F;&#x43A; &#x441;&#x430;&#x43C;&#x43E;&#x441;&#x442;&#x456;&#x439;&#x43D;&#x43E;, &#x442;&#x430;&#x43A; &#x456; &#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43C;, &#x44F;&#x43A; &#x43E;&#x442; <code>super()</code>, &#x430;&#x431;&#x43E; &#x437; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43E; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x430;, &#x44F;&#x43A; &#x43E;&#x442; <code>super.getGreeting()</code>. &#x412; &#x43E;&#x431;&#x43E;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x430;&#x445;, <code>this</code>-&#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x435; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43E; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; <code>this</code>.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="03-Functions.html" class="navigation navigation-prev " aria-label="Previous page: Глава 3: Функції">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="05-Destructuring.html" class="navigation navigation-next " aria-label="Next page: Глава 5: Деструктурування для легшого доступу до даних">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Глава 4: Розширена функціональність об’єктів","level":"1.6","depth":1,"next":{"title":"Глава 5: Деструктурування для легшого доступу до даних","level":"1.7","depth":1,"path":"manuscript/05-Destructuring.md","ref":"manuscript/05-Destructuring.md","articles":[]},"previous":{"title":"Глава 3: Функції","level":"1.5","depth":1,"path":"manuscript/03-Functions.md","ref":"manuscript/03-Functions.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","yametrika","ga","rss","github-buttons"],"pluginsConfig":{"yametrika":{},"github":{"url":"https://github.com/LambdaBooks/understandinges6ua"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Рoзуміння ECMAScript 6","description":"Український переклад книги «Understanding ES6».","author":"Denys Dovhan","site_url":"http://understandinges6.denysdovhan.com/","feed_url":"http://understandinges6.denysdovhan.com/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"github-buttons":{"repo":"LambdaBooks/understandinges6ua","types":["star"],"size":"small"},"ga":{"configuration":"auto","token":"UA-40496885-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/LambdaBooks/understandinges6ua/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"manuscript/04-Objects.md","mtime":"2017-02-13T13:54:59.746Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-02-13T13:56:37.309Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-yametrika/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

