
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Глава 5: Деструктурування для легшого доступу до даних · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="06-Symbols.html" />
    
    
    <link rel="prev" href="04-Objects.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"denysdovhan/understandinges6ua","types":["star"],"size":"small"};
    </script>

    <link href="http://understandinges6.denysdovhan.com/rss.xml" title="Рoзуміння ECMAScript 6" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Рoзуміння ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-Block-Bindings.html">
            
                <a href="01-Block-Bindings.html">
            
                    
                    Глава 1: Блочне зв’язування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02-Strings-and-Regular-Expressions.html">
            
                <a href="02-Strings-and-Regular-Expressions.html">
            
                    
                    Глава 2: Рядки та регулярні вирази
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03-Functions.html">
            
                <a href="03-Functions.html">
            
                    
                    Глава 3: Функції
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="04-Objects.html">
            
                <a href="04-Objects.html">
            
                    
                    Глава 4: Розширена функціональність об’єктів
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="05-Destructuring.html">
            
                <a href="05-Destructuring.html">
            
                    
                    Глава 5: Деструктурування для легшого доступу до даних
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="06-Symbols.html">
            
                <a href="06-Symbols.html">
            
                    
                    Глава 6: Символи та їх властивості
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="07-Sets-And-Maps.html">
            
                <a href="07-Sets-And-Maps.html">
            
                    
                    Глава 7: Множини та мапи
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="08-Iterators-And-Generators.html">
            
                <a href="08-Iterators-And-Generators.html">
            
                    
                    Глава 8: Ітератори та генератори
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="09-Classes.html">
            
                <a href="09-Classes.html">
            
                    
                    Глава 9: Знайомство з класами у JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10-Arrays.html">
            
                <a href="10-Arrays.html">
            
                    
                    Глава 10: Покращені можливості масивів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11-Promises.html">
            
                <a href="11-Promises.html">
            
                    
                    Глава 11: Проміси та асинхронне програмування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12-Proxies-and-Reflection.html">
            
                <a href="12-Proxies-and-Reflection.html">
            
                    
                    Глава 12: Проксі та АРІ рефлексії
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13-Modules.html">
            
                <a href="13-Modules.html">
            
                    
                    Глава 13: Інкапсуляція коду через модулі
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" >
            
                <span>
            
                    
                    Додаток А: Дрібніші зміни у ECMAScript 6
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" >
            
                <span>
            
                    
                    Додаток Б: Розуміння ECMAScript 7 (2016)
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Глава 5: Деструктурування для легшого доступу до даних</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x434;&#x43B;&#x44F;-&#x43B;&#x435;&#x433;&#x448;&#x43E;&#x433;&#x43E;-&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443;-&#x434;&#x43E;-&#x434;&#x430;&#x43D;&#x438;&#x445;">&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43B;&#x435;&#x433;&#x448;&#x43E;&#x433;&#x43E; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x434;&#x43E; &#x434;&#x430;&#x43D;&#x438;&#x445;</h1>
<p>&#x41C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x442;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438; - &#x434;&#x432;&#x430; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x432;&#x436;&#x438;&#x432;&#x430;&#x43D;&#x456; &#x432;&#x438;&#x434;&#x438; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;, &#x430; &#x437;&#x430;&#x432;&#x434;&#x44F;&#x43A;&#x438; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x443; &#x434;&#x430;&#x43D;&#x438;&#x445; JSON &#x432;&#x43E;&#x43D;&#x438; &#x441;&#x442;&#x430;&#x43B;&#x438; &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x43E; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; &#x43C;&#x43E;&#x432;&#x438;. &#x426;&#x435; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x456; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x430; &#x437;&#x433;&#x43E;&#x434;&#x43E;&#x43C; &#x456; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E;&#x457; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x456; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;&#x457; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x457; &#x434;&#x43E; &#x446;&#x438;&#x445; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;. ECMAScript 6 &#x441;&#x43F;&#x440;&#x43E;&#x449;&#x443;&#x454; &#x446;&#x435;&#x439; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441; &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; <em>&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; (destructuring)</em> &#x2014; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x443; &#x440;&#x43E;&#x437;&#x431;&#x438;&#x442;&#x442;&#x44F; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x43D;&#x430; &#x43C;&#x435;&#x43D;&#x448;&#x456; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438;. &#x426;&#x44F; &#x433;&#x43B;&#x430;&#x432;&#x430; &#x43F;&#x43E;&#x43A;&#x430;&#x436;&#x435;, &#x44F;&#x43A; &#x43F;&#x440;&#x438;&#x431;&#x43E;&#x440;&#x43A;&#x430;&#x442;&#x438; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x44F;&#x43A; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x442;&#x430;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;.</p>
<h2 id="&#x447;&#x43E;&#x43C;&#x443;-&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x435;">&#x427;&#x43E;&#x43C;&#x443; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x435;?</h2>
<p>&#x423; ECMAScript 5 &#x442;&#x430; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x430; &#x437;&#x447;&#x438;&#x442;&#x430;&#x442;&#x438; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x447;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x432; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; &#x43C;&#x43E;&#x433;&#x43B;&#x430; &#x432;&#x438;&#x43B;&#x438;&#x442;&#x438;&#x441;&#x44C; &#x443; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> options = {
        repeat: <span class="hljs-literal">true</span>,
        save: <span class="hljs-literal">false</span>
    };

<span class="hljs-comment">// &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;</span>
<span class="hljs-keyword">let</span> repeat = options.repeat,
    save = options.save;
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x43B;&#x456;&#x432; <code>repeat</code> &#x442;&#x430; <code>save</code> &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; <code>options</code> &#x442;&#x430; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x446;&#x456; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; &#x437; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x43C;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x430;&#x43C;&#x438;. &#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;, &#x430;&#x43B;&#x435; &#x443;&#x44F;&#x432;&#x456;&#x442;&#x44C;, &#x44F;&#x43A;&#x431;&#x438; &#x432;&#x438; &#x43C;&#x430;&#x43B;&#x438; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x442;&#x430; &#x43F;&#x43E;&#x43B;&#x456;&#x432;, &#x432;&#x430;&#x43C; &#x431;&#x438; &#x434;&#x43E;&#x432;&#x435;&#x43B;&#x43E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x432;&#x441;&#x456;&#x445; &#x457;&#x445; &#x43E;&#x434;&#x43D;&#x435; &#x43E;&#x434;&#x43D;&#x43E;&#x43C;&#x443;. &#x410; &#x44F;&#x43A;&#x449;&#x43E; &#x434;&#x430;&#x43D;&#x456; &#x431;&#x443;&#x43B;&#x438; &#x431; &#x449;&#x435; &#x439; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x438;&#x43C;&#x438;, &#x432;&#x430;&#x43C; &#x431;&#x438; &#x434;&#x43E;&#x432;&#x435;&#x43B;&#x43E;&#x441;&#x44C; &#x201C;&#x43F;&#x440;&#x43E;&#x43A;&#x43E;&#x43F;&#x430;&#x442;&#x438;&#x201D; &#x432;&#x441;&#x44E; &#x446;&#x44E; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443; &#x43B;&#x438;&#x448;&#x435; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x437;&#x43D;&#x430;&#x439;&#x442;&#x438; &#x43E;&#x434;&#x43D;&#x443; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43A;&#x443; &#x434;&#x430;&#x43D;&#x438;&#x445;.</p>
<p>&#x41E;&#x441;&#x44C; &#x447;&#x43E;&#x43C;&#x443; ECMAScript 6 &#x434;&#x43E;&#x434;&#x430;&#x454; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x42F;&#x43A;&#x449;&#x43E; &#x440;&#x43E;&#x437;&#x431;&#x438;&#x432;&#x430;&#x442;&#x438; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x43D;&#x430; &#x434;&#x440;&#x456;&#x431;&#x43D;&#x456;&#x448;&#x456; &#x448;&#x43C;&#x430;&#x442;&#x43E;&#x447;&#x43A;&#x438;, &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E;&#x457; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x457; &#x431;&#x443;&#x434;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x43D;&#x43E; &#x43B;&#x435;&#x433;&#x448;&#x438;&#x43C;. &#x411;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x43C;&#x43E;&#x432; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443;&#x44E;&#x442;&#x44C; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437; &#x43C;&#x456;&#x43D;&#x456;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x43E;&#x43C;, &#x449;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x446;&#x435;&#x439; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;. &#x406;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x44F; ECMAScript 6 &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;, &#x437; &#x44F;&#x43A;&#x438;&#x43C; &#x432;&#x438; &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x432;&#x436;&#x435; &#x437;&#x43D;&#x430;&#x439;&#x43E;&#x43C;&#x456;: &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;&#x432;.</p>
<h2 id="&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x456;&#x432;">&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;</h2>
<p>&#x421;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x439; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B; &#x437; &#x43B;&#x456;&#x432;&#x43E;&#x433;&#x43E; &#x431;&#x43E;&#x43A;&#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> node = {
        type: <span class="hljs-string">&quot;Identifier&quot;</span>,
        name: <span class="hljs-string">&quot;foo&quot;</span>
    };

<span class="hljs-keyword">let</span> { type, name } = node;

<span class="hljs-built_in">console</span>.log(type);      <span class="hljs-comment">// &quot;Identifier&quot;</span>
<span class="hljs-built_in">console</span>.log(name);      <span class="hljs-comment">// &quot;foo&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>node.type</code> &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; <code>type</code>, &#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>node.name</code> &#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; <code>name</code>. &#x426;&#x435;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x441;&#x430;&#x43C;&#x438;&#x439;, &#x44F;&#x43A; &#x456; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;&#x445;, &#x43F;&#x440;&#x43E; &#x44F;&#x43A;&#x435; &#x43C;&#x438; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x43B;&#x438; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 4. &#x406;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x438; <code>type</code> &#x442;&#x430; <code>name</code> &#x454; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x442;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; <code>options</code> &#x437; &#x44F;&#x43A;&#x438;&#x445; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x43D;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<h4 id="a-&#x43D;&#x435;-&#x437;&#x430;&#x431;&#x443;&#x434;&#x44C;&#x442;&#x435;-&#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x442;&#x43E;&#x440;">A&gt; &#x41D;&#x435; &#x437;&#x430;&#x431;&#x443;&#x434;&#x44C;&#x442;&#x435; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x442;&#x43E;&#x440;</h4>
<p>&#x410;&gt; &#x41F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; <code>var</code>, <code>let</code> &#x430;&#x431;&#x43E; <code>const</code>, &#x432;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x442;&#x43E;&#x440; (&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x437;&#x43D;&#x430;&#x43A;&#x443; &#x440;&#x456;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456;). &#x412;&#x441;&#x456; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x43A;&#x43E;&#x434;&#x443; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43A;&#x438;&#x434;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x441;&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x435;&#x43D;&#x443; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x438;&#x43C; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// syntax error!</span>
<span class="hljs-keyword">var</span> { type, name };

<span class="hljs-comment">// syntax error!</span>
<span class="hljs-keyword">let</span> { type, name };

<span class="hljs-comment">// syntax error!</span>
<span class="hljs-keyword">const</span> { type, name };
</code></pre>
<p>A&gt; &#x42F;&#x43A;&#x449;&#x43E; <code>const</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x454; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x437;&#x430; &#x443;&#x43C;&#x43E;&#x432;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x435;&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x43E;&#x432;&#x43D;&#x438;&#x445; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;, <code>var</code> &#x442;&#x430; <code>let</code> &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x44E;&#x442;&#x44C; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x43B;&#x438;&#x448;&#x435; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;.</p>
<h4 id="&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435;-&#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;">&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;</h4>
<p>&#x41F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x449;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;&#x43C;. &#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x440;&#x456;&#x448;&#x438;&#x442;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x456;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> node = {
        type: <span class="hljs-string">&quot;Identifier&quot;</span>,
        name: <span class="hljs-string">&quot;foo&quot;</span>
    },
    type = <span class="hljs-string">&quot;Literal&quot;</span>,
    name = <span class="hljs-number">5</span>;

<span class="hljs-comment">// &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x447;&#x435;&#x440;&#x435;&#x437; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</span>
({ type, name } = node);

<span class="hljs-built_in">console</span>.log(type);      <span class="hljs-comment">// &quot;Identifier&quot;</span>
<span class="hljs-built_in">console</span>.log(name);      <span class="hljs-comment">// &quot;foo&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, <code>type</code> &#x442;&#x430; <code>name</code> &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;, &#x434;&#x430;&#x43B;&#x456; &#x434;&#x432;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C;&#x438; &#x436; &#x456;&#x43C;&#x435;&#x43D;&#x430;&#x43C;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;. &#x41D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x446;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; <code>node</code>. &#x417;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;, &#x449;&#x43E; &#x432;&#x430;&#x43C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E; &#x432;&#x437;&#x44F;&#x442;&#x438; &#x432;&#x438;&#x440;&#x430;&#x437; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x443; &#x43A;&#x440;&#x443;&#x433;&#x43B;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438;. &#x426;&#x435; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x44E;&#x447;&#x456; &#x444;&#x456;&#x433;&#x443;&#x440;&#x43D;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x441;&#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43E;&#x43A; &#x431;&#x43B;&#x43E;&#x43A;&#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;, &#x430; &#x431;&#x43B;&#x43E;&#x43A; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x441;&#x442;&#x43E;&#x44F;&#x442;&#x438; &#x443; &#x43B;&#x456;&#x432;&#x456;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x456; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;. &#x41A;&#x440;&#x443;&#x433;&#x43B;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x441;&#x438;&#x433;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x44E;&#x442;&#x44C; &#x43F;&#x440;&#x43E; &#x442;&#x435;, &#x449;&#x43E; &#x444;&#x456;&#x433;&#x443;&#x440;&#x43D;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438;, &#x44F;&#x43A;&#x456; &#x441;&#x43B;&#x456;&#x434;&#x443;&#x44E;&#x442;&#x44C; &#x437;&#x430; &#x43D;&#x438;&#x43C;&#x438;, &#x43D;&#x435; &#x454; &#x431;&#x43B;&#x43E;&#x43A;&#x43E;&#x43C; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x456; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x44F;&#x43A; &#x432;&#x438;&#x440;&#x430;&#x437;, &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x447;&#x438; &#x442;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x412;&#x438;&#x440;&#x430;&#x437; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x430;&#x432;&#x43E;&#x457; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443; (&#x43F;&#x456;&#x441;&#x43B;&#x44F; <code>=</code>). &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x432;&#x441;&#x44E;&#x434;&#x438;, &#x434;&#x435; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43F;&#x440;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> node = {
        type: <span class="hljs-string">&quot;Identifier&quot;</span>,
        name: <span class="hljs-string">&quot;foo&quot;</span>
    },
    type = <span class="hljs-string">&quot;Literal&quot;</span>,
    name = <span class="hljs-number">5</span>;

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">outputInfo</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value === node);        <span class="hljs-comment">// true</span>
}

outputInfo({ type, name } = node);

<span class="hljs-built_in">console</span>.log(type);      <span class="hljs-comment">// &quot;Identifier&quot;</span>
<span class="hljs-built_in">console</span>.log(name);      <span class="hljs-comment">// &quot;foo&quot;</span>
</code></pre>
<p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>outputInfo()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x432;&#x438;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;. &#x412;&#x438;&#x440;&#x430;&#x437; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>node</code>, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x43E;&#x43D;&#x43E; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43F;&#x440;&#x430;&#x432;&#x456;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;. &#x41F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x432; <code>type</code> &#x442;&#x430; <code>name</code> &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; <code>node</code>&#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; <code>outputInfo()</code>.</p>
<p>W&gt; &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x440;&#x430;&#x432;&#x430; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; (&#x432;&#x438;&#x440;&#x430;&#x437; &#x43F;&#x456;&#x441;&#x43B;&#x44F; <code>=</code>) &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>null</code> &#x430;&#x431;&#x43E; <code>undefined</code>, &#x446;&#x435; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x434;&#x435; &#x434;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;. &#x426;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x430; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x430; &#x437;&#x447;&#x438;&#x442;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x437; <code>null</code> &#x430;&#x431;&#x43E; <code>undefined</code> &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x434;&#x435; &#x434;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;.</p>
<h4 id="&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;-&#x437;&#x430;-&#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;">&#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;</h4>
<p>&#x417;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454;&#x442;&#x435; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; &#x437; &#x456;&#x43C;&#x2019;&#x44F;&#x43C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;, &#x449;&#x43E; &#x43D;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;, &#x442;&#x43E;&#x434;&#x456; &#x446;&#x456;&#x439; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x439; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>undefined</code>. &#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> node = {
        type: <span class="hljs-string">&quot;Identifier&quot;</span>,
        name: <span class="hljs-string">&quot;foo&quot;</span>
    };

<span class="hljs-keyword">let</span> { type, name, value } = node;

<span class="hljs-built_in">console</span>.log(type);      <span class="hljs-comment">// &quot;Identifier&quot;</span>
<span class="hljs-built_in">console</span>.log(name);      <span class="hljs-comment">// &quot;foo&quot;</span>
<span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// undefined</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x437;&#x430;&#x434;&#x430;&#x454; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x443; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; <code>value</code> &#x442;&#x430; &#x43D;&#x430;&#x43C;&#x430;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x457;&#x442;&#x438; &#x457;&#x439; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456; <code>node</code> &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>value</code>, &#x442;&#x43E;&#x43C;&#x443; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43E;, &#x449;&#x43E; &#x446;&#x456;&#x439; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>undefined</code>.</p>
<p>&#x417;&#x430; &#x431;&#x430;&#x436;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x432;&#x43D;&#x43E;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43D;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x454;. &#x429;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x446;&#x435;, &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44C; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C; &#x440;&#x456;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; (<code>=</code>) &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x456;&#x43C;&#x2019;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x442;&#x430; &#x432;&#x43A;&#x430;&#x436;&#x456;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> node = {
        type: <span class="hljs-string">&quot;Identifier&quot;</span>,
        name: <span class="hljs-string">&quot;foo&quot;</span>
    };

<span class="hljs-keyword">let</span> { type, name, value = <span class="hljs-literal">true</span> } = node;

<span class="hljs-built_in">console</span>.log(type);      <span class="hljs-comment">// &quot;Identifier&quot;</span>
<span class="hljs-built_in">console</span>.log(name);      <span class="hljs-comment">// &quot;foo&quot;</span>
<span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; <code>value</code> &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>true</code> &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x426;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x435; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x432; <code>node</code>, &#x430;&#x431;&#x43E; &#x432;&#x43E;&#x43D;&#x430; &#x43C;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>undefined</code>. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>node.value</code> &#x43D;&#x435;&#x43C;&#x430;&#x454;, &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>value</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x426;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439;, &#x44F;&#x43A;&#x456; &#x43C;&#x438; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x443;&#x43B;&#x438; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 3.</p>
<h4 id="&#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;-&#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;-&#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x43C;-&#x437;-&#x456;&#x43D;&#x448;&#x438;&#x43C;&#x438;-&#x456;&#x43C;&#x435;&#x43D;&#x430;&#x43C;&#x438;">&#x41F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x43C; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x43C;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x430;&#x43C;&#x438;</h4>
<p>&#x414;&#x43E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x44E;&#x447;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x432; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43D;&#x430;&#x437;&#x432; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;: &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>node.type</code> &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; <code>type</code>. &#x426;&#x435; &#x447;&#x443;&#x434;&#x43E;&#x432;&#x43E;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x442;&#x430;&#x43A;&#x435; &#x436; &#x441;&#x430;&#x43C;&#x435; &#x456;&#x43C;&#x2019;&#x44F;, &#x430;&#x43B;&#x435; &#x449;&#x43E; &#x44F;&#x43A;&#x449;&#x43E; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x441; &#x446;&#x435; &#x43D;&#x435;&#x431;&#x430;&#x436;&#x430;&#x43D;&#x43E;? ECMAScript 6 &#x43C;&#x430;&#x454; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;, &#x449;&#x43E; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x43C; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x43C;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x430;&#x43C;&#x438;, &#x456; &#x432;&#x456;&#x43D; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x442;&#x430;&#x43A;, &#x44F;&#x43A; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x439; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B; &#x431;&#x435;&#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443; &#x434;&#x43B;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> node = {
        type: <span class="hljs-string">&quot;Identifier&quot;</span>,
        name: <span class="hljs-string">&quot;foo&quot;</span>
    };

<span class="hljs-keyword">let</span> { type: localType, name: localName } = node;

<span class="hljs-built_in">console</span>.log(localType);     <span class="hljs-comment">// &quot;Identifier&quot;</span>
<span class="hljs-built_in">console</span>.log(localName);     <span class="hljs-comment">// &quot;foo&quot;</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E;&#x431; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x441;&#x438;&#x442;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; <code>localType</code> &#x442;&#x430; <code>localName</code>, &#x44F;&#x43A;&#x456; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; <code>node.type</code> &#x442;&#x430; <code>node.name</code>, &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;. &#x417;&#x430;&#x43F;&#x438;&#x441; <code>type: localType</code> &#x43A;&#x430;&#x436;&#x435;, &#x449;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x437;&#x447;&#x438;&#x442;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x437; &#x456;&#x43C;&#x2019;&#x44F;&#x43C; <code>type</code> &#x442;&#x430; &#x437;&#x431;&#x435;&#x440;&#x435;&#x433;&#x442;&#x438; &#x457;&#x457; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; <code>localType</code>. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x454; &#x435;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x438;&#x43B;&#x435;&#x436;&#x43D;&#x438;&#x43C; &#x434;&#x43E; &#x442;&#x440;&#x430;&#x434;&#x438;&#x446;&#x456;&#x439;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;&#x432;, &#x432; &#x44F;&#x43A;&#x438;&#x445; &#x456;&#x43C;&#x2019;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x456;&#x432;&#x43E;&#x440;&#x443;&#x447; &#x432;&#x456;&#x434; &#x434;&#x432;&#x43E;&#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x438;, &#x430; &#x457;&#x457; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x2014; &#x43F;&#x440;&#x430;&#x432;&#x43E;&#x440;&#x443;&#x447;. &#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x456;&#x43C;&#x2019;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x430;&#x432;&#x43E;&#x440;&#x443;&#x447; &#x432;&#x456;&#x434; &#x434;&#x432;&#x43E;&#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x438;, &#x430; &#x43F;&#x43E;&#x43B;&#x435; &#x437; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x437;&#x447;&#x438;&#x442;&#x430;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x456;&#x432;&#x43E;&#x440;&#x443;&#x447;.</p>
<p>&#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;. &#x417;&#x43D;&#x430;&#x43A; &#x440;&#x456;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x442;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x438;&#x43C;&#x443;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x456;&#x43C;&#x2019;&#x44F; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> node = {
        type: <span class="hljs-string">&quot;Identifier&quot;</span>
    };

<span class="hljs-keyword">let</span> { type: localType, name: localName = <span class="hljs-string">&quot;bar&quot;</span> } = node;

<span class="hljs-built_in">console</span>.log(localType);     <span class="hljs-comment">// &quot;Identifier&quot;</span>
<span class="hljs-built_in">console</span>.log(localName);     <span class="hljs-comment">// &quot;bar&quot;</span>
</code></pre>
<p>&#x422;&#x443;&#x442;, &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>localName</code> &#x43C;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; <code>&quot;bar&quot;</code>. &#x426;&#x456;&#x439; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>node.name</code> &#x43D;&#x435;&#x43C;&#x430;&#x454;.</p>
<p>&#x412;&#x438; &#x432;&#x436;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x439;&#x43E;&#x43C;&#x438;&#x43B;&#x438;&#x441;&#x44C; &#x437; &#x442;&#x438;&#x43C;, &#x44F;&#x43A; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x44F;&#x43A;&#x438;&#x445; &#x454; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;. &#x41F;&#x440;&#x43E;&#x442;&#x435; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x43C;&#x43E;&#x436;&#x435; &#x434;&#x456;&#x441;&#x442;&#x430;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x456; &#x437; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x438;&#x445; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;.</p>
<h4 id="&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x432;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x438;&#x445;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x456;&#x432;">&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;</h4>
<p>&#x417; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443;, &#x449;&#x43E; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x43D;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x456;&#x441;&#x442;&#x430;&#x432;&#x430;&#x442;&#x438; &#x437; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x442;&#x443; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E;, &#x44F;&#x43A;&#x430; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x430;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> node = {
        type: <span class="hljs-string">&quot;Identifier&quot;</span>,
        name: <span class="hljs-string">&quot;foo&quot;</span>,
        loc: {
            start: {
                line: <span class="hljs-number">1</span>,
                column: <span class="hljs-number">1</span>
            },
            end: {
                line: <span class="hljs-number">1</span>,
                column: <span class="hljs-number">4</span>
            }
        }
    };

<span class="hljs-keyword">let</span> { loc: { start }} = node;

<span class="hljs-built_in">console</span>.log(start.line);        <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(start.column);      <span class="hljs-comment">// 1</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x444;&#x456;&#x433;&#x443;&#x440;&#x43D;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438;, &#x44F;&#x43A;&#x456; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x44E;&#x442;&#x44C;, &#x449;&#x43E; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x443; &#x441;&#x43B;&#x456;&#x434; &#x441;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x438;&#x441;&#x44C; &#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>loc</code> &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; <code>node</code> &#x442;&#x430; &#x437;&#x43D;&#x430;&#x439;&#x442;&#x438; &#x442;&#x430;&#x43C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>start</code>. &#x41F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x430;&#x439;&#x442;&#x435; &#x437; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x443; &#x43F;&#x440;&#x43E; &#x442;&#x435;, &#x449;&#x43E; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x456; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x432;&#x43E;&#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x430;, &#x446;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x434;&#x432;&#x43E;&#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x43E;&#x44E; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x43C;&#x456;&#x441;&#x446;&#x435; &#x437;&#x432;&#x456;&#x434;&#x43A;&#x438; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x434;&#x456;&#x441;&#x442;&#x430;&#x442;&#x438; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E;, &#x430; &#x43F;&#x440;&#x430;&#x432;&#x456;&#x439; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x456; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x434;&#x432;&#x43E;&#x43A;&#x440;&#x430;&#x43F;&#x43A;&#x438; &#x441;&#x442;&#x43E;&#x457;&#x442;&#x44C; &#x444;&#x456;&#x433;&#x443;&#x440;&#x43D;&#x430; &#x434;&#x443;&#x436;&#x43A;&#x430;, &#x446;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;.</p>
<p>&#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x433;&#x43B;&#x438;&#x431;&#x43B;&#x44E;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x456;&#x43D;&#x448;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> node = {
        type: <span class="hljs-string">&quot;Identifier&quot;</span>,
        name: <span class="hljs-string">&quot;foo&quot;</span>,
        loc: {
            start: {
                line: <span class="hljs-number">1</span>,
                column: <span class="hljs-number">1</span>
            },
            end: {
                line: <span class="hljs-number">1</span>,
                column: <span class="hljs-number">4</span>
            }
        }
    };

<span class="hljs-comment">// &#x434;&#x456;&#x441;&#x442;&#x430;&#x454;&#x43C;&#x43E; node.loc.start</span>
<span class="hljs-keyword">let</span> { loc: { start: localStart }} = node;

<span class="hljs-built_in">console</span>.log(localStart.line);   <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(localStart.column); <span class="hljs-comment">// 1</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, <code>node.loc.start</code> &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43D;&#x43E;&#x432;&#x456;&#x439; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x439; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; &#x437; &#x456;&#x43C;&#x2019;&#x44F;&#x43C; <code>localStart</code>. &#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x432;&#x456;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x440;&#x456;&#x432;&#x435;&#x43D;&#x44C; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x435;&#x43D;&#x43E;&#x441;&#x442;&#x456;, &#x437; &#x443;&#x441;&#x456;&#x43C;&#x430; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438;, &#x449;&#x43E; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x43D;&#x430; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x43C;&#x443; &#x437; &#x440;&#x456;&#x432;&#x43D;&#x456;&#x432;.</p>
<p>&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x454; &#x434;&#x443;&#x436;&#x435; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x438;&#x43C; &#x456; &#x43C;&#x430;&#x454; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x43E;&#x43F;&#x446;&#x456;&#x439;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43F;&#x440;&#x43E;&#x43F;&#x43E;&#x43D;&#x443;&#x454; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;, &#x449;&#x43E; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x434;&#x456;&#x441;&#x442;&#x430;&#x432;&#x430;&#x442;&#x438; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;.</p>
<h4 id="a-&#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x430;-&#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;">A&gt; &#x421;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x430; &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;</h4>
<p>A&gt; &#x411;&#x443;&#x434;&#x44C;&#x442;&#x435; &#x43E;&#x431;&#x435;&#x440;&#x435;&#x436;&#x43D;&#x456; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43D;&#x435;&#x43D;&#x430;&#x440;&#x43E;&#x43A;&#x43E;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x449;&#x43E; &#x43D;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x436;&#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x435;&#x444;&#x435;&#x43A;&#x442;&#x443;. &#x41F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x456; &#x444;&#x456;&#x433;&#x443;&#x440;&#x43D;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x435;&#x43D;&#x456; &#x43F;&#x440;&#x438; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x43E;&#x434;&#x43D;&#x430;&#x43A; &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x442;&#x44C; &#x43D;&#x456;&#x447;&#x43E;&#x433;&#x43E;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x43D;&#x435; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x443;&#x454; &#x436;&#x43E;&#x434;&#x43D;&#x43E;&#x457; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;!</span>
<span class="hljs-keyword">let</span> { loc: {} } = node;
</code></pre>
<p>A&gt; &#x41D;&#x435;&#x43C;&#x430;&#x454; &#x436;&#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x441;&#x43F;&#x440;&#x430;&#x432;&#x430; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x444;&#x456;&#x433;&#x443;&#x440;&#x43D;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438;, <code>loc</code> &#x441;&#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x432;&#x43A;&#x430;&#x437;&#x456;&#x432;&#x43A;&#x430; &#x434;&#x435; &#x448;&#x443;&#x43A;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x430; &#x43D;&#x435; &#x44F;&#x43A; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430;, &#x44F;&#x43A;&#x443; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438;. &#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x439;&#x43C;&#x43E;&#x432;&#x456;&#x440;&#x43D;&#x43E; &#x431;&#x443;&#x43B;&#x430; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; <code>=</code>, &#x43D;&#x456;&#x436; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>:</code>, &#x44F;&#x43A;&#x430; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x434;&#x435; &#x448;&#x443;&#x43A;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;. &#x426;&#x456;&#x43B;&#x43A;&#x43E;&#x43C; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x449;&#x43E; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x431;&#x443;&#x434;&#x435; &#x437;&#x430;&#x431;&#x43E;&#x440;&#x43E;&#x43D;&#x435;&#x43D;&#x438;&#x43C; &#x443; &#x43C;&#x430;&#x439;&#x431;&#x443;&#x442;&#x43D;&#x44C;&#x43E;&#x43C;&#x443;, &#x43F;&#x440;&#x43E;&#x442;&#x435;, &#x437;&#x430;&#x440;&#x430;&#x437; &#x2014; &#x446;&#x435; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x430; &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;.</p>
<h2 id="&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;">&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;</h2>
<p>&#x421;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x434;&#x435;&#x43A;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x434;&#x443;&#x436;&#x435; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x43D;&#x430; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x456; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x438;&#x43C;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;&#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;&#x432;. &#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x43F;&#x435;&#x440;&#x443;&#x454; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x44F;&#x43C;&#x438; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x456;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x44F;&#x43A;&#x456; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x445;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> colors = [ <span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span>, <span class="hljs-string">&quot;blue&quot;</span> ];

<span class="hljs-keyword">let</span> [ firstColor, secondColor ] = colors;

<span class="hljs-built_in">console</span>.log(firstColor);        <span class="hljs-comment">// &quot;red&quot;</span>
<span class="hljs-built_in">console</span>.log(secondColor);       <span class="hljs-comment">// &quot;green&quot;</span>
</code></pre>
<p>&#x422;&#x443;&#x442; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x432;&#x438;&#x442;&#x44F;&#x433;&#x443;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;red&quot;</code> &#x442;&#x430; <code>&quot;green&quot;</code> &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; <code>colors</code> &#x456; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x457;&#x445; &#x432; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; <code>firstColor</code> &#x442;&#x430; <code>secondColor</code>. &#x426;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x431;&#x440;&#x430;&#x43D;&#x456; &#x447;&#x435;&#x440;&#x435;&#x437; &#x457;&#x445;&#x43D;&#x456; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x457; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;, &#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x43C;&#x438;. &#x415;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;, &#x44F;&#x43A;&#x456; &#x43D;&#x435; &#x431;&#x443;&#x43B;&#x438; &#x44F;&#x432;&#x43D;&#x43E; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x456; &#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x456; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x456;&#x433;&#x43D;&#x43E;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x456;. &#x422;&#x430;&#x43A;&#x43E;&#x436; &#x437;&#x430;&#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x430;&#x439;&#x442;&#x435;, &#x449;&#x43E; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x436;&#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;.</p>
<p>&#x412;&#x438;, &#x442;&#x430;&#x43A;&#x43E;&#x436;, &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x443;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x438; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x456; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x456; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x456;&#x43C;&#x2019;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;, &#x44F;&#x43A;&#x430; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x430;. &#x42F;&#x43A;&#x449;&#x43E;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x438;&#x439; &#x442;&#x440;&#x435;&#x442;&#x456;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x438; &#x43F;&#x456;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x442;&#x430; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;. &#x41E;&#x441;&#x44C; &#x44F;&#x43A; &#x446;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> colors = [ <span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span>, <span class="hljs-string">&quot;blue&quot;</span> ];

<span class="hljs-keyword">let</span> [ , , thirdColor ] = colors;

<span class="hljs-built_in">console</span>.log(thirdColor);        <span class="hljs-comment">// &quot;blue&quot;</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E;&#x431; &#x434;&#x456;&#x441;&#x442;&#x430;&#x442;&#x438; &#x442;&#x440;&#x435;&#x442;&#x456;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x437; <code>colors</code>. &#x41A;&#x43E;&#x43C;&#x438;, &#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x443;&#x44E;&#x442;&#x44C; <code>thirdColor</code> &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x456;, &#x437;&#x430;&#x439;&#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x456;&#x441;&#x446;&#x435; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;, &#x449;&#x43E; &#x439;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43D;&#x438;&#x43C;. &#x412;&#x438;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x435; &#x446;&#x435;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434;, &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x43E;&#x457; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43E;&#x43C;&#x456;&#x440;&#x43E;&#x43A; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x431;&#x435;&#x437; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x434;&#x43B;&#x44F; &#x43D;&#x438;&#x445;.</p>
<p>W&gt; &#x42F;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438;, &#x432;&#x438; &#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x43E; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x438;&#x442;&#x438; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x437; <code>var</code>, <code>let</code> &#x430;&#x431;&#x43E; <code>const</code>.</p>
<h4 id="&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435;-&#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;">&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;</h4>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x456; &#x432; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43A;&#x441;&#x442;&#x456; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;, &#x43F;&#x440;&#x43E;&#x442;&#x435;, &#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x438; &#x431;&#x440;&#x430;&#x442;&#x438; &#x432;&#x438;&#x440;&#x430;&#x437; &#x443; &#x43A;&#x440;&#x443;&#x433;&#x43B;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> colors = [ <span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span>, <span class="hljs-string">&quot;blue&quot;</span> ],
    firstColor = <span class="hljs-string">&quot;black&quot;</span>,
    secondColor = <span class="hljs-string">&quot;purple&quot;</span>;

[ firstColor, secondColor ] = colors;

<span class="hljs-built_in">console</span>.log(firstColor);        <span class="hljs-comment">// &quot;red&quot;</span>
<span class="hljs-built_in">console</span>.log(secondColor);       <span class="hljs-comment">// &quot;green&quot;</span>
</code></pre>
<p>&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x432; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x404;&#x434;&#x438;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x43E;&#x43B;&#x44F;&#x433;&#x430;&#x454; &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; <code>firstColor</code> &#x442;&#x430; <code>secondColor</code> &#x432;&#x436;&#x435; &#x431;&#x443;&#x43B;&#x438; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x456;. &#x423; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x456;&#x432;, &#x446;&#x435; &#x432;&#x441;&#x435;, &#x449;&#x43E; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x437;&#x43D;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x454; &#x449;&#x435; &#x434;&#x435;&#x449;&#x43E;, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x441; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43C;.</p>
<p>&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x43C;&#x456;&#x441;&#x446;&#x44F;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x434;&#x432;&#x43E;&#x445; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;. &#x417;&#x43C;&#x456;&#x43D;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x43C;&#x456;&#x441;&#x446;&#x44F;&#x43C;&#x438; &#x454; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x44E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x454;&#x44E; &#x432; &#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;&#x430;&#x445; &#x441;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x412; ECMAScript 5, &#x449;&#x43E;&#x431; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x43C;&#x456;&#x441;&#x446;&#x44F;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x432;&#x43E;&#x445; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;, &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x438; &#x442;&#x440;&#x435;&#x442;&#x44E;, &#x442;&#x438;&#x43C;&#x447;&#x430;&#x441;&#x43E;&#x432;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443;, &#x44F;&#x43A; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x417;&#x43C;&#x456;&#x43D;&#x430; &#x43C;&#x456;&#x441;&#x446;&#x44F;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x443; ECMAScript 5</span>
<span class="hljs-keyword">let</span> a = <span class="hljs-number">1</span>,
    b = <span class="hljs-number">2</span>,
    tmp;

tmp = a;
a = b;
b = tmp;

<span class="hljs-built_in">console</span>.log(a);     <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(b);     <span class="hljs-comment">// 1</span>
</code></pre>
<p>&#x422;&#x438;&#x43C;&#x447;&#x430;&#x441;&#x43E;&#x432;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>tmp</code> &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x43C;&#x456;&#x441;&#x446;&#x44F;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; <code>a</code> &#x442;&#x430; <code>b</code>. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x438;&#x43A;&#x430;&#x454; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x430; &#x432; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456;&#x439; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439;. &#x41E;&#x441;&#x44C; &#x44F;&#x43A; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x438; &#x43C;&#x456;&#x441;&#x446;&#x44F;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; ECMAScript 6:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x417;&#x43C;&#x456;&#x43D;&#x430; &#x43C;&#x456;&#x441;&#x446;&#x44F;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x443; ECMAScript 6</span>
<span class="hljs-keyword">let</span> a = <span class="hljs-number">1</span>,
    b = <span class="hljs-number">2</span>;

[ a, b ] = [ b, a ];

<span class="hljs-built_in">console</span>.log(a);     <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(b);     <span class="hljs-comment">// 1</span>
</code></pre>
<p>&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x44F;&#x43A; &#x434;&#x437;&#x435;&#x440;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x435; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F;. &#x41B;&#x456;&#x432;&#x430; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; (&#x434;&#x43E; &#x437;&#x43D;&#x430;&#x43A;&#x443; &#x440;&#x456;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456;) &#x454; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x43C; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x443; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x445; &#x437; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x41F;&#x440;&#x430;&#x432;&#x430; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x454; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x43E;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x449;&#x43E; &#x442;&#x438;&#x43C;&#x447;&#x430;&#x441;&#x43E;&#x432;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x43C;&#x456;&#x441;&#x446;&#x44F;&#x43C;&#x438;. &#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430;&#x434; &#x442;&#x438;&#x43C;&#x447;&#x430;&#x441;&#x43E;&#x432;&#x438;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>b</code> &#x442;&#x430; <code>a</code> &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x442;&#x430; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443;. &#x420;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C; &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x438;&#x445; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x43C;&#x456;&#x43D;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x456;&#x441;&#x446;&#x44F;&#x43C;&#x438;.</p>
<p>W&gt; &#x42F;&#x43A; &#x456; &#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; &#x437; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x440;&#x430;&#x432;&#x430; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>null</code> &#x430;&#x431;&#x43E; <code>undefined</code> &#x446;&#x435; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x434;&#x435; &#x434;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;.</p>
<h4 id="&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;-&#x437;&#x430;-&#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;">&#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;</h4>
<p>&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x443; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x456;&#x439; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x457; &#x43D;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x454;, &#x430;&#x431;&#x43E; &#x457;&#x457; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x440;&#x456;&#x432;&#x43D;&#x435; <code>undefined</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> colors = [ <span class="hljs-string">&quot;red&quot;</span> ];

<span class="hljs-keyword">let</span> [ firstColor, secondColor = <span class="hljs-string">&quot;green&quot;</span> ] = colors;

<span class="hljs-built_in">console</span>.log(firstColor);        <span class="hljs-comment">// &quot;red&quot;</span>
<span class="hljs-built_in">console</span>.log(secondColor);       <span class="hljs-comment">// &quot;green&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432; <code>colors</code> &#x43C;&#x430;&#x454; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;, &#x442;&#x43E;&#x43C;&#x443; &#x436;&#x43E;&#x434;&#x435;&#x43D; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x435; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; <code>secondColor</code>. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; <code>secondColor</code>, &#x439;&#x43E;&#x43C;&#x443; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;green&quot;</code> &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; <code>undefined</code>.</p>
<h4 id="&#x432;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x435;-&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;">&#x412;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x435; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</h4>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x436;&#x435; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x44F;&#x43A; &#x446;&#x435; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x438; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x433;&#x43B;&#x438;&#x431;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x443; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> colors = [ <span class="hljs-string">&quot;red&quot;</span>, [ <span class="hljs-string">&quot;green&quot;</span>, <span class="hljs-string">&quot;lightgreen&quot;</span> ], <span class="hljs-string">&quot;blue&quot;</span> ];

<span class="hljs-comment">// &#x43F;&#x43E;&#x442;&#x456;&#x43C;</span>

<span class="hljs-keyword">let</span> [ firstColor, [ secondColor ] ] = colors;

<span class="hljs-built_in">console</span>.log(firstColor);        <span class="hljs-comment">// &quot;red&quot;</span>
<span class="hljs-built_in">console</span>.log(secondColor);       <span class="hljs-comment">// &quot;green&quot;</span>
</code></pre>
<p>&#x422;&#x443;&#x442; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>secondColor</code> &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;green&quot;</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; <code>colors</code>. &#x426;&#x435;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x442;&#x43E;&#x43C;&#x443; &#x443; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x44E;&#x447;&#x43E;&#x43C;&#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x456; &#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x456; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x43D;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x434;&#x43E;&#x432;&#x43A;&#x43E;&#x43B;&#x430; <code>secondColor</code>. &#x42F;&#x43A; &#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438;, &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x432;&#x456;&#x43B;&#x44C;&#x43D;&#x443; &#x433;&#x43B;&#x438;&#x431;&#x438;&#x43D;&#x443;.</p>
<h4 id="&#x437;&#x430;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x432;&#x456;-rest-&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;">&#x417;&#x430;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x432;&#x456; (rest) &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;</h4>
<p>&#x413;&#x43B;&#x430;&#x432;&#x430; 3 &#x432;&#x432;&#x43E;&#x434;&#x438;&#x43B;&#x430; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x442;&#x44F; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x432;&#x438;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432; (rest&#x2013;&#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432;) &#x434;&#x43B;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439;. &#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43C;&#x430;&#x454; &#x441;&#x445;&#x43E;&#x436;&#x443; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x446;&#x456;&#x44E; &#x2014; <em>&#x437;&#x430;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x432;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;</em> &#x430;&#x431;&#x43E; (<em>rest&#x2013;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;</em>). &#x417;&#x430;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x432;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; <code>...</code> &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;, &#x449;&#x43E; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x438;&#x43B;&#x438;&#x441;&#x44C; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x43F;&#x435;&#x432;&#x43D;&#x456;&#x439; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> colors = [ <span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span>, <span class="hljs-string">&quot;blue&quot;</span> ];

<span class="hljs-keyword">let</span> [ firstColor, ...restColors ] = colors;

<span class="hljs-built_in">console</span>.log(firstColor);        <span class="hljs-comment">// &quot;red&quot;</span>
<span class="hljs-built_in">console</span>.log(restColors.length); <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(restColors[<span class="hljs-number">0</span>]);     <span class="hljs-comment">// &quot;green&quot;</span>
<span class="hljs-built_in">console</span>.log(restColors[<span class="hljs-number">1</span>]);     <span class="hljs-comment">// &quot;blue&quot;</span>
</code></pre>
<p>&#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; <code>colors</code> &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>firstColor</code>, &#x430; &#x440;&#x435;&#x448;&#x442;&#x430; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; <code>restColors</code>. &#x412;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432; <code>restColors</code> &#x43C;&#x430;&#x454; &#x434;&#x432;&#x430; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;: <code>&quot;green&quot;</code> &#x442;&#x430; <code>&quot;blue&quot;</code>. &#x417;&#x430;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x432;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x434;&#x456;&#x441;&#x442;&#x430;&#x432;&#x430;&#x442;&#x438; &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x43F;&#x435;&#x432;&#x43D;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x456; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x442;&#x438; &#x440;&#x435;&#x448;&#x442;&#x443; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C;&#x438;, &#x43F;&#x440;&#x43E;&#x442;&#x435;, &#x454; &#x449;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x41E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x438;&#x43C; &#x43D;&#x435;&#x434;&#x43E;&#x43B;&#x456;&#x43A;&#x43E;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x443; JavaScript &#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x457;&#x445; &#x43B;&#x435;&#x433;&#x43A;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x423; ECMAScript 5 &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>concat()</code> &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43B;&#x435;&#x433;&#x43A;&#x43E;&#x433;&#x43E; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x443; &#x43A;&#x43B;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x414;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x43A;&#x43B;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; ECMAScript 5</span>
<span class="hljs-keyword">var</span> colors = [ <span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span>, <span class="hljs-string">&quot;blue&quot;</span> ];
<span class="hljs-keyword">var</span> clonedColors = colors.concat();

<span class="hljs-built_in">console</span>.log(clonedColors);      <span class="hljs-comment">//&quot;[red,green,blue]&quot;</span>
</code></pre>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>concat()</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43D;&#x43A;&#x430;&#x442;&#x438;&#x43D;&#x430;&#x446;&#x456;&#x457; &#x434;&#x432;&#x43E;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x439;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x431;&#x435;&#x437; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; &#x43A;&#x43E;&#x43F;&#x456;&#x44E; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x423; ECMAScript 6 &#x434;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x432;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;. &#x426;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x43A;&#x43B;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; ECMAScript 6</span>
<span class="hljs-keyword">let</span> colors = [ <span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span>, <span class="hljs-string">&quot;blue&quot;</span> ];
<span class="hljs-keyword">let</span> [ ...clonedColors ] = colors;

<span class="hljs-built_in">console</span>.log(clonedColors);      <span class="hljs-comment">//&quot;[red,green,blue]&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x437;&#x430;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x432;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; <code>colors</code> &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432; <code>clonedColors</code>. &#x425;&#x43E;&#x447;&#x430; &#x446;&#x435; &#x439; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x438;&#x442;&#x44C; &#x432;&#x456;&#x434; &#x441;&#x43F;&#x440;&#x438;&#x439;&#x43D;&#x44F;&#x442;&#x442;&#x44F;, &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x437;&#x43D;&#x430;&#x447;&#x43D;&#x43E; &#x43A;&#x440;&#x430;&#x449;&#x435; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x454; &#x43D;&#x430;&#x43C;&#x456;&#x440;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;, &#x43D;&#x456;&#x436; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>concat()</code>. &#x426;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x430; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;, &#x43F;&#x440;&#x43E; &#x44F;&#x43A;&#x443; &#x432;&#x430;&#x43C; &#x441;&#x43B;&#x456;&#x434; &#x437;&#x43D;&#x430;&#x442;&#x438;.</p>
<p>W&gt; &#x417;&#x430;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x432;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x439;&#x442;&#x438; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456;&#x43C;&#x438; &#x43F;&#x440;&#x438; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x2014; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43D;&#x438;&#x445; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x43A;&#x43E;&#x43C;&#x438;. &#x41A;&#x43E;&#x43C;&#x430; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x432;&#x438;&#x445; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x434;&#x435; &#x434;&#x43E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x457; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;.</p>
<h2 id="&#x437;&#x43C;&#x456;&#x448;&#x430;&#x43D;&#x435;-&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;">&#x417;&#x43C;&#x456;&#x448;&#x430;&#x43D;&#x435; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</h2>
<p>&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x440;&#x430;&#x437;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x434;&#x456;&#x441;&#x442;&#x430;&#x432;&#x430;&#x442;&#x438; &#x442;&#x443; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x457;, &#x44F;&#x43A;&#x430; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x430;, &#x437; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x43E;&#x457; &#x43A;&#x43E;&#x43C;&#x431;&#x456;&#x43D;&#x430;&#x446;&#x456;&#x457; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x414;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> node = {
        type: <span class="hljs-string">&quot;Identifier&quot;</span>,
        name: <span class="hljs-string">&quot;foo&quot;</span>,
        loc: {
            start: {
                line: <span class="hljs-number">1</span>,
                column: <span class="hljs-number">1</span>
            },
            end: {
                line: <span class="hljs-number">1</span>,
                column: <span class="hljs-number">4</span>
            }
        },
        range: [<span class="hljs-number">0</span>, <span class="hljs-number">3</span>]
    };

<span class="hljs-keyword">let</span> {
    loc: { start },
    range: [ startIndex ]
} = node;

<span class="hljs-built_in">console</span>.log(start.line);        <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(start.column);      <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(startIndex);        <span class="hljs-comment">// 0</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x434;&#x456;&#x441;&#x442;&#x430;&#x454; <code>node.loc.start</code> &#x442;&#x430; <code>node.range[0]</code> &#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; <code>start</code> &#x442;&#x430; <code>startIndex</code> &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;. &#x41F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x430;&#x439;&#x442;&#x435;, &#x449;&#x43E; <code>loc:</code> &#x442;&#x430; <code>range:</code> &#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x456; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x454; &#x43B;&#x438;&#x448;&#x435; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x43C;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; <code>node</code>. &#x41D;&#x435;&#x43C;&#x430;&#x454; &#x442;&#x430;&#x43A;&#x43E;&#x457; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; <code>node</code>, &#x44F;&#x43A;&#x443; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x431;&#x443;&#x43B;&#x43E; &#x431;&#x438; &#x434;&#x456;&#x441;&#x442;&#x430;&#x442;&#x438; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x431;&#x456;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434;, &#x437;&#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x430;, &#x437;&#x440;&#x443;&#x447;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x437; JSON &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;, &#x431;&#x435;&#x437; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x443; &#x43F;&#x43E; &#x432;&#x441;&#x456;&#x439; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x456;.</p>
<h2 id="&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x456;-&#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438;">&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438;</h2>
<p>&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x454; &#x449;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x2014; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;. &#x41A;&#x43E;&#x43B;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x443; JavaScript &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432;, &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43F;&#x440;&#x438;&#x439;&#x43D;&#x44F;&#x442;&#x438;&#x43C; &#x454; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; <code>options</code>, &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; options &#x454; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430;&#x43C;&#x438;</span>
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">setCookie</span>(<span class="hljs-params">name, value, options</span>) </span>{

    options = options || {};

    <span class="hljs-keyword">let</span> secure = options.secure,
        path = options.path,
        domain = options.domain,
        expires = options.expires;

    <span class="hljs-comment">// &#x43A;&#x43E;&#x434;, &#x449;&#x43E; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454; cookie</span>
}

<span class="hljs-comment">// &#x442;&#x440;&#x435;&#x442;&#x456;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x443; &#x43E;&#x43F;&#x446;&#x456;&#x457;</span>
setCookie(<span class="hljs-string">&quot;type&quot;</span>, <span class="hljs-string">&quot;js&quot;</span>, {
    secure: <span class="hljs-literal">true</span>,
    expires: <span class="hljs-number">60000</span>
});
</code></pre>
<p>&#x411;&#x430;&#x433;&#x430;&#x442;&#x43E; JavaScript&#x2013;&#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x449;&#x43E; &#x441;&#x445;&#x43E;&#x436;&#x456; &#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; <code>setCookie()</code>. &#x423; &#x446;&#x456;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; <code>name</code> &#x442;&#x430; <code>value</code> &#x454; &#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x43C;&#x438;, &#x43F;&#x440;&#x43E;&#x442;&#x435; <code>secure</code>, <code>path</code>, <code>domain</code> &#x442;&#x430; <code>expires</code> &#x2014; &#x43D;&#x456;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x43A; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x445; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x43D;&#x435; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x439;, &#x435;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E; &#x431;&#x443;&#x43B;&#x43E; &#x431; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43C;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>options</code> &#x437; &#x456;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438;, &#x430;&#x43D;&#x456;&#x436; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x445; &#x456;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432;. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;, &#x430;&#x43B;&#x435; &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438;, &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x432;&#x432;&#x43E;&#x434;&#x443; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x43E;&#x434;&#x438;&#x432;&#x438;&#x442;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x457;&#x457; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x2014; &#x432;&#x430;&#x43C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E; &#x447;&#x438;&#x442;&#x430;&#x442;&#x438; &#x442;&#x456;&#x43B;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;.</p>
<p>&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x43F;&#x440;&#x43E;&#x43F;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C; &#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x443;, &#x44F;&#x43A;&#x430; &#x43A;&#x440;&#x430;&#x449;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x44F;&#x43A;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;. &#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x430;&#x431;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x43D;&#x430; &#x43C;&#x456;&#x441;&#x446;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x443;. &#x429;&#x43E;&#x431; &#x43F;&#x43E;&#x431;&#x430;&#x447;&#x438;&#x442;&#x438; &#x446;&#x435; &#x443; &#x434;&#x456;&#x457;, &#x43F;&#x43E;&#x434;&#x438;&#x432;&#x456;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x443; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; <code>setCookie()</code> &#x437; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">setCookie</span>(<span class="hljs-params">name, value, { secure, path, domain, expires }</span>) </span>{

    <span class="hljs-comment">// &#x43A;&#x43E;&#x434;, &#x449;&#x43E; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454; cookie</span>
}

setCookie(<span class="hljs-string">&quot;type&quot;</span>, <span class="hljs-string">&quot;js&quot;</span>, {
    secure: <span class="hljs-literal">true</span>,
    expires: <span class="hljs-number">60000</span>
});
</code></pre>
<p>&#x422;&#x430;&#x43A;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x443; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x442;&#x435;&#x43F;&#x435;&#x440; &#x442;&#x440;&#x435;&#x442;&#x456;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x445; &#x434;&#x430;&#x43D;&#x438;&#x445;. &#x41F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x43F;&#x43E;&#x437;&#x430; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x43C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; &#x454; &#x447;&#x456;&#x442;&#x43A;&#x43E; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x438;&#x43C;&#x438;, &#x456;, &#x432; &#x442;&#x43E;&#x439; &#x436;&#x435; &#x447;&#x430;&#x441;, &#x434;&#x43B;&#x44F; &#x431;&#x443;&#x434;&#x44C;&#x2014;&#x43A;&#x43E;&#x433;&#x43E;, &#x445;&#x442;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; <code>setCookie()</code>, &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x43E;, &#x44F;&#x43A;&#x456; &#x43E;&#x43F;&#x446;&#x456;&#x457; &#x432;&#x43E;&#x43D;&#x430; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x454;. &#x406; &#x437;&#x432;&#x456;&#x441;&#x43D;&#x43E;, &#x442;&#x440;&#x435;&#x442;&#x456;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x454; &#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x43C;, &#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x456; &#x432;&#x456;&#x43D; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x435;&#x43D; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438;, &#x454; &#x447;&#x456;&#x442;&#x43A;&#x43E; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x438;&#x43C;&#x438;. &#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438;, &#x442;&#x43E;&#x431;&#x442;&#x43E;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x456;, &#x457;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x440;&#x456;&#x432;&#x43D;&#x456; <code>undefined</code>.</p>
<p>A&gt; &#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x443;&#x441;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;, &#x43F;&#x440;&#x43E; &#x44F;&#x43A;&#x456; &#x432;&#x438; &#x434;&#x456;&#x437;&#x43D;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x437; &#x446;&#x456;&#x454;&#x457; &#x433;&#x43B;&#x430;&#x432;&#x438;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x437;&#x43C;&#x456;&#x448;&#x443;&#x432;&#x430;&#x442;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x442;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x442;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456; &#x432;&#x456;&#x434; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x437; &#x44F;&#x43A;&#x438;&#x445; &#x432;&#x438; &#x447;&#x438;&#x442;&#x430;&#x454;&#x442;&#x435; &#x434;&#x430;&#x43D;&#x456;.</p>
<h3 id="&#x43E;&#x431;&#x43E;&#x432;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x456;&#x441;&#x442;&#x44C;-&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x445;-&#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432;">&#x41E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432;</h3>
<p>&#x41E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432; &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x457;&#x445; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x431;&#x443;&#x434;&#x435; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; <code>setCookie()</code> &#x437; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x43A;&#x438;&#x43D;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x41F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;!</span>
setCookie(<span class="hljs-string">&quot;type&quot;</span>, <span class="hljs-string">&quot;js&quot;</span>);
</code></pre>
<p>&#x422;&#x443;&#x442; &#x442;&#x440;&#x435;&#x442;&#x456;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x431;&#x443;&#x432; &#x443;&#x43F;&#x443;&#x449;&#x435;&#x43D;&#x438;&#x439;, &#x456; &#x442;&#x43E;&#x43C;&#x443; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43E;, &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>undefined</code>. &#x426;&#x435; &#x441;&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x44F;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x454; &#x43B;&#x438;&#x448;&#x435; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>setCookie()</code>, &#x440;&#x443;&#x448;&#x456;&#x439; JavaScript &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x435;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">setCookie</span>(<span class="hljs-params">name, value, options</span>) </span>{

    <span class="hljs-keyword">let</span> { secure, path, domain, expires } = options;

    <span class="hljs-comment">// &#x43A;&#x43E;&#x434;, &#x449;&#x43E; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454; cookie</span>
}
</code></pre>
<p>&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x438;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x440;&#x430;&#x432;&#x430; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>null</code> &#x430;&#x431;&#x43E; <code>undefined</code>, &#x430; &#x441;&#x430;&#x43C;&#x435; &#x446;&#x435; &#x456; &#x441;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x442;&#x440;&#x435;&#x442;&#x456;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; <code>setCookie()</code>.</p>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435;, &#x449;&#x43E;&#x431; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x431;&#x443;&#x432; &#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x43C;, &#x442;&#x43E;&#x434;&#x456; &#x442;&#x430;&#x43A;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x441; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x43D;&#x43E;&#x44E;. &#x41F;&#x440;&#x43E;&#x442;&#x435;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E;, &#x449;&#x43E;&#x431; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x431;&#x443;&#x432; &#x43E;&#x43F;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43E;&#x431;&#x456;&#x439;&#x442;&#x438; &#x442;&#x430;&#x43A;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443;, &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x448;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x443;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">setCookie</span>(<span class="hljs-params">name, value, { secure, path, domain, expires } = {}</span>) </span>{

    <span class="hljs-comment">// ...</span>
}
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x442;&#x440;&#x435;&#x442;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;. &#x41F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; <code>secure</code>, <code>path</code>, <code>domain</code> &#x442;&#x430; <code>expires</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; <code>undefined</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x443; <code>setCookie()</code> &#x43D;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x43E; &#x442;&#x440;&#x435;&#x442;&#x44C;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;, &#x430; &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x43A;&#x438;&#x434;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;.</p>
<h3 id="&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;-&#x437;&#x430;-&#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;-&#x434;&#x43B;&#x44F;-&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x445;-&#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432;">&#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432;</h3>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432; &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x432;&#x438; &#x431;&#x438; &#x446;&#x435; &#x440;&#x43E;&#x431;&#x438;&#x43B;&#x438; &#x437; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x43C; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;&#x43C;. &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x439;&#x442;&#x435; &#x437;&#x43D;&#x430;&#x43A; &#x440;&#x456;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x443; &#x456; &#x432;&#x43A;&#x430;&#x436;&#x456;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">setCookie</span>(<span class="hljs-params">name, value,
    {
        secure = false,
        path = &quot;/&quot;,
        domain = &quot;example.com&quot;,
        expires = new Date(Date.now(</span>) + 360000000)
    } = </span>{}
) {

    <span class="hljs-comment">// ...</span>
}
</code></pre>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440; &#x43A;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x443; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x43C;&#x443; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432; &#x43C;&#x430;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x442;&#x43E;&#x436; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x442;&#x438;, &#x447;&#x438; &#x434;&#x430;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x430;&#x454; &#x434;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41A;&#x440;&#x456;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x442;&#x440;&#x435;&#x442;&#x456;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x454; &#x43E;&#x43F;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x441;&#x430;&#x43C;&#x438;&#x439; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x426;&#x435; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x434;&#x435;&#x449;&#x43E; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x456;&#x448;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#x441;&#x43F;&#x440;&#x438;&#x439;&#x43D;&#x44F;&#x442;&#x442;&#x44F;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x446;&#x435; &#x43D;&#x435;&#x432;&#x435;&#x43B;&#x438;&#x43A;&#x430; &#x446;&#x456;&#x43D;&#x430; &#x437;&#x430; &#x442;&#x435;, &#x449;&#x43E;&#x431; &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x437; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x43C;&#x430;&#x432; &#x434;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<h2 id="&#x43F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;">&#x41F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;</h2>
<p>&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x43B;&#x435;&#x433;&#x448;&#x443;&#x454; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438; &#x443; JavaScript. &#x412;&#x438;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x435; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;&#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x440;&#x43E;&#x437;&#x431;&#x438;&#x432;&#x430;&#x442;&#x438; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x43D;&#x430; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438;, &#x449;&#x43E;&#x431; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x443; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E;. &#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x434;&#x456;&#x441;&#x442;&#x430;&#x432;&#x430;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x430; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;, &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;.</p>
<p>&#x42F;&#x43A; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x442;&#x430;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x43F;&#x440;&#x438; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x430;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x430;&#x431;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;, &#x449;&#x43E; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>undefined</code>, &#x456;&#x43D;&#x430;&#x43A;&#x448;&#x435; &#x432; &#x43E;&#x431;&#x43E;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x430;&#x445;, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x440;&#x430;&#x432;&#x430; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>null</code> &#x430;&#x431;&#x43E; <code>undefined</code>, &#x431;&#x443;&#x434;&#x435; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;. &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x456;&#x441;&#x442;&#x430;&#x432;&#x430;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x43D;&#x456; &#x437; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x438;&#x445; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440; &#x434;&#x430;&#x43D;&#x438;&#x445;.</p>
<p>&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x443;&#x44E;&#x442;&#x44C; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; &#x447;&#x435;&#x440;&#x435;&#x437; <code>var</code>, <code>let</code> &#x430;&#x431;&#x43E; <code>const</code>, &#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x43E; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x43C;&#x430;&#x442;&#x438; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x442;&#x43E;&#x440;. &#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x456; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;, &#x44F;&#x43A;&#x456; &#x432;&#x436;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x442;&#x44C;.</p>
<p>&#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;, &#x449;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x201C;&#x43E;&#x43F;&#x446;&#x456;&#x439;&#x201D; &#x443; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430;&#x445; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x438;&#x43C;. &#x414;&#x43E;&#x43F;&#x43E;&#x43C;&#x456;&#x436;&#x43D;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438;, &#x44F;&#x43A;&#x456; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x456;, &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x440;&#x430;&#x445;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x43C;&#x443; &#x440;&#x44F;&#x434;&#x443; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x43C;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430;&#x43C;&#x438;. &#x428;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;, &#x430;&#x431;&#x43E; &#x43A;&#x43E;&#x43C;&#x431;&#x456;&#x43D;&#x430;&#x446;&#x456;&#x454;&#x44E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x442;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;. &#x414;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x437; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x456;&#x432; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x441;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;  &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="04-Objects.html" class="navigation navigation-prev " aria-label="Previous page: Глава 4: Розширена функціональність об’єктів">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="06-Symbols.html" class="navigation navigation-next " aria-label="Next page: Глава 6: Символи та їх властивості">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Глава 5: Деструктурування для легшого доступу до даних","level":"1.7","depth":1,"next":{"title":"Глава 6: Символи та їх властивості","level":"1.8","depth":1,"path":"manuscript/06-Symbols.md","ref":"manuscript/06-Symbols.md","articles":[]},"previous":{"title":"Глава 4: Розширена функціональність об’єктів","level":"1.6","depth":1,"path":"manuscript/04-Objects.md","ref":"manuscript/04-Objects.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","yametrika","ga","rss","github-buttons"],"pluginsConfig":{"yametrika":{"number":"41711034"},"github":{"url":"https://github.com/denysdovhan/understandinges6ua"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Рoзуміння ECMAScript 6","description":"Український переклад книги «Understanding ES6».","author":"Denys Dovhan and Terry Sahaidak","site_url":"http://understandinges6.denysdovhan.com/","feed_url":"http://understandinges6.denysdovhan.com/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"github-buttons":{"repo":"denysdovhan/understandinges6ua","types":["star"],"size":"small"},"ga":{"configuration":"auto","token":"UA-40496885-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/denysdovhan/understandinges6ua/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"manuscript/05-Destructuring.md","mtime":"2017-01-21T07:52:01.795Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-01-21T07:53:36.893Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-yametrika/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

