
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Глава 6: Символи та їх властивості · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="07-Sets-And-Maps.html" />
    
    
    <link rel="prev" href="05-Destructuring.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"LambdaBooks/understandinges6ua","types":["star"],"size":"small"};
    </script>

    <link href="http://understandinges6.denysdovhan.com/rss.xml" title="Рoзуміння ECMAScript 6" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Рoзуміння ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-Block-Bindings.html">
            
                <a href="01-Block-Bindings.html">
            
                    
                    Глава 1: Блочне зв’язування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02-Strings-and-Regular-Expressions.html">
            
                <a href="02-Strings-and-Regular-Expressions.html">
            
                    
                    Глава 2: Рядки та регулярні вирази
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03-Functions.html">
            
                <a href="03-Functions.html">
            
                    
                    Глава 3: Функції
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="04-Objects.html">
            
                <a href="04-Objects.html">
            
                    
                    Глава 4: Розширена функціональність об’єктів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="05-Destructuring.html">
            
                <a href="05-Destructuring.html">
            
                    
                    Глава 5: Деструктурування для легшого доступу до даних
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="06-Symbols.html">
            
                <a href="06-Symbols.html">
            
                    
                    Глава 6: Символи та їх властивості
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="07-Sets-And-Maps.html">
            
                <a href="07-Sets-And-Maps.html">
            
                    
                    Глава 7: Множини та мапи
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="08-Iterators-And-Generators.html">
            
                <a href="08-Iterators-And-Generators.html">
            
                    
                    Глава 8: Ітератори та генератори
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="09-Classes.html">
            
                <a href="09-Classes.html">
            
                    
                    Глава 9: Знайомство з класами у JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10-Arrays.html">
            
                <a href="10-Arrays.html">
            
                    
                    Глава 10: Покращені можливості масивів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11-Promises.html">
            
                <a href="11-Promises.html">
            
                    
                    Глава 11: Проміси та асинхронне програмування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12-Proxies-and-Reflection.html">
            
                <a href="12-Proxies-and-Reflection.html">
            
                    
                    Глава 12: Проксі та АРІ рефлексії
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13-Modules.html">
            
                <a href="13-Modules.html">
            
                    
                    Глава 13: Інкапсуляція коду через модулі
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="A-Other-Changes.html">
            
                <a href="A-Other-Changes.html">
            
                    
                    Додаток А: Дрібніші зміни у ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="B-ECMAScript-7.html">
            
                <a href="B-ECMAScript-7.html">
            
                    
                    Додаток Б: Розуміння ECMAScript 7 (2016)
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Глава 6: Символи та їх властивості</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;-&#x442;&#x430;-&#x457;&#x445;-&#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;">&#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x442;&#x430; &#x457;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;</h1>
<p>&#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; (symbols) &#x454; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x43C; &#x442;&#x438;&#x43F;&#x43E;&#x43C;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x443; ECMAScript 6 &#x43D;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x447;&#x443; &#x434;&#x43E; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x438;&#x445;: &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;, &#x447;&#x438;&#x441;&#x435;&#x43B;, &#x431;&#x443;&#x43B;&#x435;&#x432;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;, <code>null</code> &#x442;&#x430; <code>undefined</code>. &#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x454; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x438;&#x445; &#x447;&#x43B;&#x435;&#x43D;&#x456;&#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; (private object members) &#x2014; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;, &#x43D;&#x430; &#x44F;&#x43A;&#x443; JavaScript&#x2013;&#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x447;&#x435;&#x43A;&#x430;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x442;&#x44F;&#x433;&#x43E;&#x43C; &#x434;&#x43E;&#x432;&#x433;&#x43E;&#x433;&#x43E; &#x447;&#x430;&#x441;&#x443;. &#x414;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x43C; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x456; &#x431;&#x443;&#x43B;&#x430; &#x43B;&#x435;&#x433;&#x43A;&#x43E;&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x44E;, &#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x431;&#x435;&#x437;&#x432;&#x456;&#x441;&#x43D;&#x43E;&#x441;&#x442;&#x456; (obscurity) &#x456;&#x43C;&#x435;&#x43D;&#x456;, &#x430; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#xAB;&#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x438;&#x445; &#x456;&#x43C;&#x435;&#x43D;&#xBB; &#x43C;&#x430;&#x454; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43D;&#x435;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;. &#x422;&#x43E;&#x431;&#x442;&#x43E;, &#x442;&#x43E;&#x434;&#x456; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x43F;&#x456;&#x434;&#x445;&#x43E;&#x434;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x44F;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x438;&#x445; &#x456;&#x43C;&#x435;&#x43D; &#x43D;&#x435; &#x43C;&#x430;&#x43B;&#x438; &#x431; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438;.</p>
<p>&#x41F;&#x440;&#x43E;&#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x44F; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x438;&#x445; &#x456;&#x43C;&#x435;&#x43D;, &#x432; &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x432;&#x438;&#x43B;&#x438;&#x43B;&#x430;&#x441;&#x44C; &#x443; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x432; ECMAScript 6, &#x430; &#x446;&#x44F; &#x433;&#x43B;&#x430;&#x432;&#x430; &#x43D;&#x430;&#x432;&#x447;&#x438;&#x442;&#x44C; &#x432;&#x430;&#x441; &#x44F;&#x43A; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438; &#x435;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;. &#x422;&#x43E;&#x434;&#x456; &#x44F;&#x43A; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x456; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x438;&#x43B;&#x438;&#x441;&#x44C; &#x442;&#x438;&#x43C;&#x438; &#x436; &#x441;&#x430;&#x43C;&#x438;&#x43C;&#x438; (&#x432;&#x43E;&#x43D;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x43D;&#x435;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x456;&#x43C;&#x435;&#x43D; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;), &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x456;, &#x44F;&#x43A; &#x43C;&#x435;&#x442;&#x443;, &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x456;&#x434;&#x43A;&#x438;&#x43D;&#x443;&#x442;&#x43E;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x43E; &#x432;&#x456;&#x434; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;.</p>
<h2 id="&#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;-&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;">&#x421;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;</h2>
<p>&#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x454; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x441;&#x435;&#x440;&#x435;&#x434; &#x432;&#x441;&#x456;&#x445; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x456;&#x432; &#x443; JavaScript &#x442;&#x438;&#x43C;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x444;&#x43E;&#x440;&#x43C;&#x438;, &#x44F;&#x43A; &#x43E;&#x442; <code>true</code> &#x434;&#x43B;&#x44F; &#x431;&#x443;&#x43B;&#x435;&#x432;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443;, &#x430;&#x431;&#x43E; <code>42</code> &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x441;&#x43B;&#x430;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; <code>Symbol</code>, &#x44F;&#x43A; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> firstName = <span class="hljs-built_in">Symbol</span>();
<span class="hljs-keyword">let</span> person = {};

person[firstName] = <span class="hljs-string">&quot;Nicholas&quot;</span>;
<span class="hljs-built_in">console</span>.log(person[firstName]);     <span class="hljs-comment">// &quot;Nicholas&quot;</span>
</code></pre>
<p>&#x422;&#x443;&#x442; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; <code>firstName</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; &#x43D;&#x43E;&#x432;&#x43E;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; <code>person</code>. &#x426;&#x435;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x435;&#x43D; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x449;&#x43E;&#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x446;&#x456;&#x454;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;. &#x41D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x438;&#x43C;&#x438; &#x456;&#x43C;&#x2019;&#x44F;&#x43C; &#x2014; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x430; &#x456;&#x434;&#x435;&#x44F;, &#x430;&#x434;&#x436;&#x435; &#x432;&#x438; &#x437; &#x43B;&#x435;&#x433;&#x43A;&#x456;&#x441;&#x442;&#x44E; &#x437;&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438;, &#x44F;&#x43A;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454; &#x446;&#x435;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;.</p>
<p>W&gt; &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x454; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;, &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>new Symbol()</code> &#x43A;&#x438;&#x43D;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;. &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x447;&#x435;&#x440;&#x435;&#x437; <code>new Object(yourSymbol)</code>, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43D;&#x435;&#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x43E;, &#x43A;&#x43E;&#x43B;&#x438; &#x442;&#x430;&#x43A;&#x430; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x43E;&#x44E;.</p>
<p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>Symbol</code> &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x43D;&#x435;&#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;, &#x449;&#x43E; &#x454; &#x43E;&#x43F;&#x438;&#x441;&#x43E;&#x43C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443;. &#x426;&#x435;&#x439; &#x43E;&#x43F;&#x438;&#x441; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x434;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x456;&#x43D; &#x437;&#x440;&#x443;&#x447;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x43B;&#x430;&#x433;&#x43E;&#x434;&#x436;&#x435;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> firstName = <span class="hljs-built_in">Symbol</span>(<span class="hljs-string">&quot;first name&quot;</span>);
<span class="hljs-keyword">let</span> person = {};

person[firstName] = <span class="hljs-string">&quot;Nicholas&quot;</span>;

<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;first name&quot;</span> <span class="hljs-keyword">in</span> person);        <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(person[firstName]);             <span class="hljs-comment">// &quot;Nicholas&quot;</span>
<span class="hljs-built_in">console</span>.log(firstName);                     <span class="hljs-comment">// &quot;Symbol(first name)&quot;</span>
</code></pre>
<p>&#x41E;&#x43F;&#x438;&#x441; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x456;&#x439; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>[[Description]]</code>. &#x426;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x447;&#x438;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x449;&#x43E;&#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>toString()</code> &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x432;&#x43D;&#x438;&#x43C; &#x430;&#x431;&#x43E; &#x43D;&#x435;&#x44F;&#x432;&#x43D;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C;. &#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>toString()</code> &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; <code>firstName</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x44F;&#x432;&#x43D;&#x43E; &#x447;&#x435;&#x440;&#x435;&#x437; <code>console.log()</code>, &#x442;&#x43E;&#x43C;&#x443; &#x43E;&#x43F;&#x438;&#x441; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43B;&#x43E;&#x433;. &#x406;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x443; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; <code>[[Description]]</code> &#x437; &#x43A;&#x43E;&#x434;&#x443; &#x43D;&#x435;&#x43C;&#x430;&#x454;. &#x42F; &#x440;&#x430;&#x434;&#x436;&#x443; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x43F;&#x438;&#x441; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x43B;&#x435;&#x433;&#x448;&#x438;&#x442;&#x438; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443; &#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438;.</p>
<h3 id="a-&#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F;-&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;">A&gt; &#x406;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;</h3>
<p>A&gt; &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x454; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>typeof</code>, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438; &#x447;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;. ECMAScript 6 &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x44E;&#x454; <code>typeof</code> &#x442;&#x430;&#x43A;, &#x449;&#x43E;&#x431; &#x432;&#x456;&#x43D; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x432; <code>&quot;symbol&quot;</code> &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x439;&#x43E;&#x433;&#x43E; &#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x43C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> symbol = <span class="hljs-built_in">Symbol</span>(<span class="hljs-string">&quot;test symbol&quot;</span>);
<span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> symbol);         <span class="hljs-comment">// &quot;symbol&quot;</span>
</code></pre>
<p>A&gt; &#x425;&#x43E;&#x447;&#x430; &#x439; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x442;&#x44C; &#x456;&#x43D;&#x448;&#x456; &#x43D;&#x435;&#x43F;&#x440;&#x44F;&#x43C;&#x456; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x447;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; &#x454; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x43C;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>typeof</code> &#x454; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43F;&#x440;&#x438;&#x439;&#x43D;&#x44F;&#x442;&#x43D;&#x438;&#x43C; &#x442;&#x430; &#x442;&#x43E;&#x447;&#x43D;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C;.</p>
<h2 id="&#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;-&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;">&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;</h2>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x432;&#x441;&#x44E;&#x434;&#x438;, &#x434;&#x435; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;. &#x412;&#x438; &#x432;&#x436;&#x435; &#x431;&#x430;&#x447;&#x438;&#x43B;&#x438; &#x437;&#x430;&#x43F;&#x438;&#x441; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x437; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x443;&#x436;&#x43A;&#x430;&#x43C;&#x438; &#x443; &#x446;&#x456;&#x439; &#x433;&#x43B;&#x430;&#x432;&#x456;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x457;&#x445; &#x456; &#x432; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x437; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x430;&#x43C;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x430; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x437; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43C;&#x438; <code>Object.defineProperty()</code> &#x442;&#x430; <code>Object.defineProperties()</code>, &#x44F;&#x43A; &#x43E;&#x442;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> firstName = <span class="hljs-built_in">Symbol</span>(<span class="hljs-string">&quot;first name&quot;</span>);

<span class="hljs-comment">// &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; &#x437; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43E;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E;</span>
<span class="hljs-keyword">let</span> person = {
    [firstName]: <span class="hljs-string">&quot;Nicholas&quot;</span>
};

<span class="hljs-comment">// &#x440;&#x43E;&#x431;&#x438;&#x43C;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x44E; &#x43B;&#x438;&#x448;&#x435; &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F;</span>
<span class="hljs-built_in">Object</span>.defineProperty(person, firstName, { writable: <span class="hljs-literal">false</span> });

<span class="hljs-keyword">let</span> lastName = <span class="hljs-built_in">Symbol</span>(<span class="hljs-string">&quot;last name&quot;</span>);

<span class="hljs-built_in">Object</span>.defineProperties(person, {
    [lastName]: {
        value: <span class="hljs-string">&quot;Zakas&quot;</span>,
        writable: <span class="hljs-literal">false</span>
    }
});

<span class="hljs-built_in">console</span>.log(person[firstName]);     <span class="hljs-comment">// &quot;Nicholas&quot;</span>
<span class="hljs-built_in">console</span>.log(person[lastName]);      <span class="hljs-comment">// &quot;Zakas&quot;</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x439; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B; &#x437; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43E;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>firstName</code>. &#x41D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x437; &#x43D;&#x435;&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x430;&#x43C;&#x438;, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x454; &#x43D;&#x435;&#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43E;&#x44E; (nonenumerable). &#x41D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x446;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x44E; &#x43B;&#x438;&#x448;&#x435; &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F;. &#x41F;&#x43E;&#x442;&#x456;&#x43C;, &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43C; <code>Object.defineProperties()</code>, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x43B;&#x438;&#x448;&#x435; &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>lastName</code>. &#x422;&#x443;&#x442; &#x449;&#x435; &#x440;&#x430;&#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x439; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B; &#x437; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43E;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x443; &#x44F;&#x43A; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>Object.defineProperties()</code>.</p>
<p>&#x425;&#x43E;&#x447;&#x430; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x439; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x434;&#x435; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x456;&#x43C;&#x435;&#x43D; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43C;&#x430;&#x442;&#x438; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x443; &#x43F;&#x43E;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x438;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;  &#x43C;&#x456;&#x436; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x43C;&#x438; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430;&#x43C;&#x438; &#x432;&#x430;&#x448;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x457;&#x445; &#x435;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;.</p>
<h2 id="&#x43F;&#x43E;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F;-&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;">&#x41F;&#x43E;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;</h2>
<p>&#x423; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438;, &#x449;&#x43E; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x432;&#x430;&#x448;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x456; &#x456; &#x442;&#x456; &#x436; &#x441;&#x430;&#x43C;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E;, &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x434;&#x432;&#x430; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x443; &#x432;&#x430;&#x448;&#x43E;&#x43C;&#x443; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x443;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;. &#x421;&#x43B;&#x456;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438; &#x443; &#x432;&#x441;&#x456;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x445; &#x430;&#x431;&#x43E; &#x443; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x430;&#x445; &#x437; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x43E;&#x44E; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x43E;&#x44E; &#x431;&#x430;&#x437;&#x43E;&#x44E; &#x431;&#x443;&#x434;&#x435; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E; &#x442;&#x430; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x438;&#x43C;&#x435; &#x434;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;. &#x41E;&#x441;&#x44C; &#x447;&#x43E;&#x43C;&#x443; ECMAScript 6 &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x440;&#x435;&#x454;&#x441;&#x442;&#x440; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;, &#x434;&#x43E; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x443; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;.</p>
<p>&#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;, &#x44F;&#x43A;&#x438;&#x43C; &#x442;&#x440;&#x435;&#x431;&#x430; &#x43F;&#x43E;&#x434;&#x456;&#x43B;&#x438;&#x442;&#x438;&#x441;&#x44C;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x439;&#x442;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Symbol.for()</code> &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>Symbol()</code>. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Symbol.for()</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;, &#x44F;&#x43A;&#x438;&#x439; &#x454; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x43C; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438;. &#x426;&#x435;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x43F;&#x438;&#x441;&#x443; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> uid = <span class="hljs-built_in">Symbol</span>.for(<span class="hljs-string">&quot;uid&quot;</span>);
<span class="hljs-keyword">let</span> object = {};

object[uid] = <span class="hljs-string">&quot;12345&quot;</span>;

<span class="hljs-built_in">console</span>.log(object[uid]);       <span class="hljs-comment">// &quot;12345&quot;</span>
<span class="hljs-built_in">console</span>.log(uid);               <span class="hljs-comment">// &quot;Symbol(uid)&quot;</span>
</code></pre>
<p>&#x421;&#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Symbol.for()</code> &#x448;&#x443;&#x43A;&#x430;&#x454; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x437; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C; <code>&quot;uid&quot;</code>, &#x442;&#x430; &#x447;&#x438; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x443; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x454;&#x441;&#x442;&#x440;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x456;&#x43D; &#x456;&#x441;&#x43D;&#x443;&#x454;, &#x442;&#x43E;&#x434;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;. &#x42F;&#x43A;&#x449;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x43D;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x454;, &#x442;&#x43E;&#x434;&#x456; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x437; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x43C; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C;, &#x44F;&#x43A;&#x438;&#x439; &#x440;&#x435;&#x454;&#x441;&#x442;&#x440;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x454;&#x441;&#x442;&#x440;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;. &#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x446;&#x435;&#x439; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; <code>Symbol.for()</code> &#x437; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438;&#x43C; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x44C; &#x43E;&#x434;&#x438;&#x43D; &#x456; &#x442;&#x43E;&#x439; &#x436;&#x435; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> uid = <span class="hljs-built_in">Symbol</span>.for(<span class="hljs-string">&quot;uid&quot;</span>);
<span class="hljs-keyword">let</span> object = {
    [uid]: <span class="hljs-string">&quot;12345&quot;</span>
};

<span class="hljs-built_in">console</span>.log(object[uid]);       <span class="hljs-comment">// &quot;12345&quot;</span>
<span class="hljs-built_in">console</span>.log(uid);               <span class="hljs-comment">// &quot;Symbol(uid)&quot;</span>

<span class="hljs-keyword">let</span> uid2 = <span class="hljs-built_in">Symbol</span>.for(<span class="hljs-string">&quot;uid&quot;</span>);

<span class="hljs-built_in">console</span>.log(uid === uid2);      <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(object[uid2]);      <span class="hljs-comment">// &quot;12345&quot;</span>
<span class="hljs-built_in">console</span>.log(uid2);              <span class="hljs-comment">// &quot;Symbol(uid)&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, <code>uid</code> &#x442;&#x430; <code>uid2</code> &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C; &#x43E;&#x434;&#x438;&#x43D; &#x456; &#x442;&#x43E;&#x439; &#x436;&#x435; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x43E;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>Symbol.for()</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;, &#x430; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x434;&#x456;&#x441;&#x442;&#x430;&#x454; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x437; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x454;&#x441;&#x442;&#x440;&#x443; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;.</p>
<p>&#x406;&#x43D;&#x448;&#x438;&#x43C; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x43E;&#x43C; &#x43F;&#x43E;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x43A;&#x43B;&#x44E;&#x447;, &#x449;&#x43E; &#x430;&#x441;&#x43E;&#x446;&#x456;&#x439;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x43C; &#x443; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x454;&#x441;&#x442;&#x440;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>Symbol.keyFor()</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> uid = <span class="hljs-built_in">Symbol</span>.for(<span class="hljs-string">&quot;uid&quot;</span>);
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Symbol</span>.keyFor(uid));    <span class="hljs-comment">// &quot;uid&quot;</span>

<span class="hljs-keyword">let</span> uid2 = <span class="hljs-built_in">Symbol</span>.for(<span class="hljs-string">&quot;uid&quot;</span>);
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Symbol</span>.keyFor(uid2));   <span class="hljs-comment">// &quot;uid&quot;</span>

<span class="hljs-keyword">let</span> uid3 = <span class="hljs-built_in">Symbol</span>(<span class="hljs-string">&quot;uid&quot;</span>);
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Symbol</span>.keyFor(uid3));   <span class="hljs-comment">// undefined</span>
</code></pre>
<p>&#x417;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;, &#x449;&#x43E; &#x44F;&#x43A; <code>uid</code>, &#x442;&#x430;&#x43A; &#x456; <code>uid2</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C; &#x43A;&#x43B;&#x44E;&#x447; <code>&quot;uid&quot;</code>. &#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; <code>uid3</code> &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x443; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x454;&#x441;&#x442;&#x440;&#x456;, &#x432;&#x456;&#x43D; &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x436;&#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x44E;&#x447;&#x430; &#x430;&#x441;&#x43E;&#x446;&#x456;&#x439;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x437; &#x441;&#x43E;&#x431;&#x43E;&#x44E;, &#x456; &#x442;&#x43E;&#x43C;&#x443; <code>Symbol.keyFor()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>undefined</code>.</p>
<p>W&gt; &#x413;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x440;&#x435;&#x454;&#x441;&#x442;&#x440; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x454; &#x441;&#x43F;&#x456;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x438;&#x449;&#x435;&#x43C;, &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x44F;&#x43A; &#x456; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x430; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x432;&#x438;&#x441;&#x43D;&#x43E;&#x432;&#x43E;&#x43A; &#x43F;&#x440;&#x43E; &#x442;&#x435;, &#x449;&#x43E; &#x454;, &#x430; &#x447;&#x43E;&#x433;&#x43E; &#x449;&#x435; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x438;&#x449;&#x456;. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x439;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x440;&#x438; &#x456;&#x43C;&#x435;&#x43D; &#x434;&#x43B;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;, &#x449;&#x43E;&#x431; &#x443;&#x43D;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x445; &#x43A;&#x43E;&#x43D;&#x444;&#x43B;&#x456;&#x43A;&#x442;&#x456;&#x432; &#x456;&#x43C;&#x435;&#x43D; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x43D;&#x456;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x456;&#x432;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43A;&#x43E;&#x434; jQuery &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x435;&#x444;&#x456;&#x43A;&#x441; <code>&quot;jquery.&quot;</code> &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; <code>&quot;jquery.element&quot;</code> &#x430;&#x431;&#x43E; &#x449;&#x43E;&#x441;&#x44C; &#x441;&#x445;&#x43E;&#x436;&#x435;.</p>
<h2 id="&#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F;-&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;">&#x41F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;</h2>
<p>&#x41F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x454; &#x437;&#x43D;&#x430;&#x447;&#x43D;&#x43E;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; JavaScript. &#x41C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x43E;&#x432;&#x438; &#x43F;&#x440;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x438; &#x43E;&#x434;&#x438;&#x43D; &#x442;&#x438;&#x43F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x434;&#x43E; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x454; &#x434;&#x443;&#x436;&#x435; &#x433;&#x43D;&#x443;&#x447;&#x43A;&#x43E;&#x44E; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E;. &#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;, &#x43E;&#x434;&#x43D;&#x430;&#x43A;, &#x454; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43D;&#x44C;&#x43E; &#x433;&#x43D;&#x443;&#x447;&#x43A;&#x438;&#x43C;&#x438; &#x43F;&#x440;&#x438; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x456;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x456;&#x43D;&#x448;&#x456; &#x442;&#x438;&#x43F;&#x438; &#x43D;&#x435; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43B;&#x43E;&#x433;&#x456;&#x447;&#x43D;&#x438;&#x445; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;. &#x417;&#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x430;, &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x430;&#x431;&#x43E; &#x447;&#x438;&#x441;&#x435;&#x43B;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x43B;&#x438;&#x441;&#x44F; &#x431;&#x438; &#x44F;&#x43A; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;.</p>
<p>&#x41F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x443; &#x446;&#x456;&#x439; &#x433;&#x43B;&#x430;&#x432;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438; <code>console.log()</code> &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x443; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;, &#x456; &#x446;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; <code>console.log()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; <code>String()</code> &#x434;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443;, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x432;&#x456;&#x434;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>String()</code> &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;, &#x449;&#x43E;&#x431; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x441;&#x430;&#x43C;&#x438;&#x439; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> uid = <span class="hljs-built_in">Symbol</span>.for(<span class="hljs-string">&quot;uid&quot;</span>),
    desc = <span class="hljs-built_in">String</span>(uid);

<span class="hljs-built_in">console</span>.log(desc);              <span class="hljs-comment">// &quot;Symbol(uid)&quot;</span>
</code></pre>
<p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>String()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; <code>uid.toString()</code>, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43E;&#x43F;&#x438;&#x441;&#x443; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x454;&#x442;&#x435; &#x441;&#x43A;&#x43E;&#x43D;&#x43A;&#x430;&#x442;&#x438;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x43C;, &#x43A;&#x438;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> uid = <span class="hljs-built_in">Symbol</span>.for(<span class="hljs-string">&quot;uid&quot;</span>),
    desc = uid + <span class="hljs-string">&quot;&quot;</span>;            <span class="hljs-comment">// &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;!</span>
</code></pre>
<p>&#x41A;&#x43E;&#x43D;&#x43A;&#x430;&#x442;&#x435;&#x43D;&#x430;&#x446;&#x456;&#x44F; <code>uid</code> &#x437; &#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x456;&#x43C; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x454; &#x441;&#x43F;&#x435;&#x440;&#x448;&#x443; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; <code>uid</code> &#x431;&#x443;&#x432; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x439; &#x434;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x41F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x43A;&#x438;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x438;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x443; &#x442;&#x430;&#x43A;&#x456;&#x439; &#x43C;&#x430;&#x43D;&#x435;&#x440;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x434;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x430;. &#x412;&#x441;&#x456; &#x43C;&#x430;&#x442;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x441;&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x44F;&#x442;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x43F;&#x440;&#x438; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x457;&#x445; &#x434;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> uid = <span class="hljs-built_in">Symbol</span>.for(<span class="hljs-string">&quot;uid&quot;</span>),
    sum = uid / <span class="hljs-number">1</span>;            <span class="hljs-comment">// &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;!</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43F;&#x440;&#x43E;&#x431;&#x443;&#x454; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x438;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x43D;&#x430; 1, &#x449;&#x43E; &#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x43A;&#x443;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;. &#x41F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x43A;&#x438;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x430;&#x442;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; (&#x43B;&#x43E;&#x433;&#x456;&#x447;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43D;&#x435; &#x43A;&#x438;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x441;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43E; <code>true</code>, &#x44F;&#x43A; &#x456; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x435; &#x43D;&#x435;&#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; JavaScript).</p>
<h2 id="&#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F;-&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x438;&#x445;-&#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;">&#x41E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;</h2>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>Object.keys()</code> &#x442;&#x430; <code>Object.getOwnPropertyNames()</code> &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x442;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x432;&#x441;&#x456;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x443;&#x441;&#x456;&#x445; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x430; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x443;&#x441;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x457;&#x445; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43E;&#x441;&#x442;&#x456;. &#x416;&#x43E;&#x434;&#x435;&#x43D; &#x437; &#x446;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x43B;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x457;&#x445;&#x43D;&#x44C;&#x43E;&#x457; ECMAScript 5 &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x443; ECMAScript 6 &#x431;&#x443;&#x43B;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Object.getOwnPropertySymbols()</code>, &#x449;&#x43E;&#x431; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x438; &#x432;&#x430;&#x43C; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;.</p>
<p>&#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; <code>Object.getOwnPropertySymbols()</code> &#x454; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> uid = <span class="hljs-built_in">Symbol</span>.for(<span class="hljs-string">&quot;uid&quot;</span>);
<span class="hljs-keyword">let</span> object = {
    [uid]: <span class="hljs-string">&quot;12345&quot;</span>
};

<span class="hljs-keyword">let</span> symbols = <span class="hljs-built_in">Object</span>.getOwnPropertySymbols(object);

<span class="hljs-built_in">console</span>.log(symbols.length);        <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(symbols[<span class="hljs-number">0</span>]);            <span class="hljs-comment">// &quot;Symbol(uid)&quot;</span>
<span class="hljs-built_in">console</span>.log(object[symbols[<span class="hljs-number">0</span>]]);    <span class="hljs-comment">// &quot;12345&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, <code>object</code> &#x43C;&#x430;&#x454; &#x454;&#x434;&#x438;&#x43D;&#x443; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>uid</code>. &#x41C;&#x430;&#x441;&#x438;&#x432;, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; <code>Object.getOwnPropertySymbols()</code>, &#x431;&#x443;&#x434;&#x435; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43B;&#x438;&#x448;&#x435; &#x446;&#x435;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;.</p>
<p>&#x416;&#x43E;&#x434;&#x435;&#x43D; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x456;&#x434; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x456;&#x434; &#x457;&#x445;&#x43D;&#x456;&#x445; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x456;&#x432;. ECMAScript 6 &#x43D;&#x430;&#x43F;&#x435;&#x440;&#x435;&#x434; &#x437;&#x430;&#x434;&#x430;&#x454; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x442;&#x430;&#x43A; &#x437;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x434;&#x43E;&#x431;&#x440;&#x435;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x438;&#x445; (well-known) &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;.</p>
<h2 id="&#x434;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x436;&#x435;&#x43D;&#x43D;&#x44F;-&#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x456;&#x445;-&#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439;-&#x437;-&#x434;&#x43E;&#x431;&#x440;&#x435;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x438;&#x43C;&#x438;-&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438;">&#x414;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x456;&#x445; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439; &#x437; &#x434;&#x43E;&#x431;&#x440;&#x435;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x438;&#x43C;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438;</h2>
<p>&#x426;&#x435;&#x43D;&#x442;&#x440;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x44E; &#x442;&#x435;&#x43C;&#x43E;&#x44E; ECMAScript 5 &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x442;&#x442;&#x44F; &#x442;&#x430; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x435;&#x44F;&#x43A;&#x438;&#x445; &#x201C;&#x43C;&#x430;&#x433;&#x456;&#x447;&#x43D;&#x438;&#x445;&#x201D; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D; JavaScript, &#x442;&#x438;&#x445; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;, &#x44F;&#x43A;&#x456; &#x442;&#x43E;&#x434;&#x456; &#x43D;&#x435; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x435;&#x43C;&#x443;&#x43B;&#x44E;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C;&#x438;. ECMAScript 6 &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454; &#x446;&#x44E; &#x442;&#x440;&#x430;&#x434;&#x438;&#x446;&#x456;&#x44E;, &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44C;&#x43E;&#x457; &#x43B;&#x43E;&#x433;&#x456;&#x43A;&#x438; &#x43C;&#x43E;&#x432;&#x438;, &#x432; &#x43F;&#x435;&#x440;&#x448;&#x443; &#x447;&#x435;&#x440;&#x433;&#x443;, &#x447;&#x435;&#x440;&#x435;&#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x456;&#x432;, &#x449;&#x43E; &#x437;&#x430;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;.</p>
<p>ECMAScript 6 &#x43C;&#x430;&#x454; &#x43D;&#x430;&#x43F;&#x435;&#x440;&#x435;&#x434; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;, &#x44F;&#x43A;&#x456; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; <em>&#x434;&#x43E;&#x431;&#x440;&#x435;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x438;&#x43C;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438;</em>, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x44E;&#x442;&#x44C; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x443; JavaScript, &#x449;&#x43E; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x43B;&#x430;&#x441;&#x44C; &#x432;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x43D;&#x43E; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x456;&#x43C;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F;&#x43C;&#x438;. &#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x434;&#x43E;&#x431;&#x440;&#x435;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; <code>Symbol</code>, &#x44F;&#x43A; &#x43E;&#x442; <code>Symbol.create</code>.</p>
<p>&#x414;&#x43E;&#x431;&#x440;&#x435;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x438;&#x43C;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438; &#x454;:</p>
<ul>
<li><code>Symbol.hasInstance</code> - &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>instanceof</code> &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;;</li>
<li><code>Symbol.isConcatSpreadable</code> - &#x431;&#x443;&#x43B;&#x435;&#x432;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x449;&#x43E; <code>Array.prototype.concat()</code> &#x441;&#x43B;&#x456;&#x434; &#x201C;&#x441;&#x43F;&#x43B;&#x44E;&#x441;&#x43D;&#x443;&#x442;&#x438;&#x201D; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x430; &#x431;&#x443;&#x43B;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x430; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x443; &#x434;&#x43E; <code>Array.prototype.concat()</code>;</li>
<li><code>Symbol.iterator</code> - &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; (&#x43F;&#x440;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43F;&#x456;&#x434;&#x435; &#x43C;&#x43E;&#x432;&#x430; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 7);</li>
<li><code>Symbol.match</code> - &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>String.prototype.match()</code> &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x43D;&#x43D;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;;</li>
<li><code>Symbol.replace</code> - &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>String.prototype.replace()</code> &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x438; &#x43F;&#x456;&#x434;&#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;;</li>
<li><code>Symbol.search</code> - &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>String.prototype.search()</code> &#x434;&#x43B;&#x44F; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x456;&#x434;&#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;;</li>
<li><code>Symbol.species</code> - &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; (&#x43F;&#x440;&#x43E; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x431;&#x443;&#x434;&#x435; &#x439;&#x442;&#x438;&#x441;&#x44C; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 8);</li>
<li><code>Symbol.split</code> - &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>String.prototype.split()</code> &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x431;&#x438;&#x442;&#x442;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;;</li>
<li><code>Symbol.toPrimitive</code> - &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;;</li>
<li><code>Symbol.toStringTag</code> - &#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>Object.prototype.toString()</code> &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x43F;&#x438;&#x441;&#x456;&#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;;</li>
<li><code>Symbol.unscopables</code> - &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;, &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x454; &#x456;&#x43C;&#x435;&#x43D;&#x430;&#x43C;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x449;&#x43E; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x432; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456; <code>with</code>.</li>
</ul>
<p>&#x41F;&#x440;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;, &#x44F;&#x43A;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430;&#x439;&#x447;&#x430;&#x441;&#x442;&#x456;&#x448;&#x435;, &#x43F;&#x456;&#x434;&#x435; &#x43C;&#x43E;&#x432;&#x430; &#x443; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x445; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x430;&#x445;, &#x442;&#x43E;&#x434;&#x456; &#x44F;&#x43A; &#x43F;&#x440;&#x43E; &#x456;&#x43D;&#x448;&#x456; &#x432;&#x438; &#x434;&#x456;&#x437;&#x43D;&#x430;&#x454;&#x442;&#x435;&#x441;&#x44C; &#x437; &#x440;&#x435;&#x448;&#x442;&#x438; &#x43A;&#x43D;&#x438;&#x433;&#x438;, &#x449;&#x43E;&#x431; &#x43D;&#x435; &#x43F;&#x43E;&#x440;&#x443;&#x448;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43A;&#x441;&#x442;&#x443;.</p>
<p>I&gt; &#x41F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443;, &#x449;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x434;&#x43E;&#x431;&#x440;&#x435;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443;, &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43D;&#x430; &#x43D;&#x435;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x439; (exotic), &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x446;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454; &#x434;&#x435;&#x44F;&#x43A;&#x443; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443;. &#x412; &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;, &#x446;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x43D;&#x456;&#x44F;&#x43A; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x43F;&#x43B;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x44C; &#x43D;&#x430; &#x432;&#x430;&#x448; &#x43A;&#x43E;&#x434; &#x2014; &#x432;&#x43E;&#x43D;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x44E;&#x442;&#x44C; &#x442;&#x435;, &#x44F;&#x43A; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F; &#x43E;&#x43F;&#x438;&#x441;&#x443;&#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;.</p>
<h3 id="&#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;-symbolhasinstance">&#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; Symbol.hasInstance</h3>
<p>&#x41A;&#x43E;&#x436;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43C;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Symbol.hasInstance</code>, &#x449;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x447;&#x438; &#x454; &#x434;&#x430;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x43C; &#x446;&#x456;&#x454;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x447;&#x438; &#x43D;&#x456;. &#x426;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x432; <code>Function.prototype</code>, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x441;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>instanceof</code>. &#x421;&#x430;&#x43C;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.hasInstance</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x44E; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443; &#x442;&#x430; &#x43A;&#x43E;&#x43D;&#x444;&#x456;&#x433;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x456; &#x454; &#x43D;&#x435;&#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43E;&#x44E;, &#x449;&#x43E;&#x431; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C;&#x438; &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x430; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x435;&#x43D;&#x430;.</p>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Symbol.hasInstance</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;: &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438;. &#x412;&#x456;&#x43D; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; true, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x454; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x43C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;. &#x429;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438; &#x44F;&#x43A; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; <code>Symbol.hasInstance</code>, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js">obj <span class="hljs-keyword">instanceof</span> <span class="hljs-built_in">Array</span>;
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x454; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x43C; &#x434;&#x43E;:</p>
<pre><code class="lang-js"><span class="hljs-built_in">Array</span>[<span class="hljs-built_in">Symbol</span>.hasInstance](obj);
</code></pre>
<p>&#x41F;&#x43E; &#x441;&#x443;&#x442;&#x456;, ECMAScript 6 &#x43F;&#x435;&#x440;&#x435;&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>instanceof</code> &#x44F;&#x43A; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443;. &#x406; &#x442;&#x435;&#x43F;&#x435;&#x440;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x442;&#x435;, &#x44F;&#x43A; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; <code>instanceof</code>.</p>
<p>&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x449;&#x43E; &#x43D;&#x435; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;&#x2013;&#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x456;&#x432;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x446;&#x435;, &#x44F;&#x43A;&#x449;&#x43E; &#x436;&#x43E;&#x440;&#x441;&#x442;&#x43A;&#x43E; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x435;, &#x449;&#x43E; <code>Symbol.hasInstance</code> &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; <code>false</code>, &#x44F;&#x43A; &#x43E;&#x441;&#x44C; &#x442;&#x443;&#x442;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">MyObject</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-comment">// ...</span>
}

<span class="hljs-built_in">Object</span>.defineProperty(MyObject, <span class="hljs-built_in">Symbol</span>.hasInstance, {
    value: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">v</span>) </span>{
        <span class="hljs-keyword">return</span> <span class="hljs-literal">false</span>;
    }
});

<span class="hljs-keyword">let</span> obj = <span class="hljs-keyword">new</span> MyObject();

<span class="hljs-built_in">console</span>.log(obj <span class="hljs-keyword">instanceof</span> MyObject);       <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x412;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>Object.defineProperty()</code>, &#x449;&#x43E;&#x431; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;, &#x449;&#x43E; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;, &#x442;&#x43E;&#x43C;&#x443; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x446;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>Symbol.hasInstance</code> &#x43D;&#x430; &#x43D;&#x43E;&#x432;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;. &#x41D;&#x43E;&#x432;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>false</code>, &#x442;&#x43E;&#x43C;&#x443; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x445;&#x43E;&#x447;&#x430; &#x439; <code>obj</code> &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x454; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x43C; &#x43A;&#x43B;&#x430;&#x441;&#x443; <code>MyObject</code>, &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>instanceof</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; <code>false</code> &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>Object.defineProperty()</code>.</p>
<p>&#x417;&#x432;&#x456;&#x441;&#x43D;&#x43E;, &#x432;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x432;&#x438;&#x440;&#x456;&#x448;&#x443;&#x432;&#x430;&#x442;&#x438;, &#x447;&#x438; &#x43C;&#x430;&#x454; &#x432;&#x43E;&#x43D;&#x43E; &#x432;&#x432;&#x430;&#x436;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x43C;. &#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;, &#x447;&#x438;&#x441;&#x43B;&#x430; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x432;&#x456;&#x434; 1 &#x434;&#x43E; 100 &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x44F;&#x43A; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x438; &#x434;&#x435;&#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x447;&#x438;&#x441;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443;. &#x429;&#x43E;&#x431; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x442;&#x430;&#x43A;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">SpecialNumber</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-comment">// &#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x44C;&#x43E;</span>
}

<span class="hljs-built_in">Object</span>.defineProperty(SpecialNumber, <span class="hljs-built_in">Symbol</span>.hasInstance, {
    value: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">v</span>) </span>{
        <span class="hljs-keyword">return</span> (v <span class="hljs-keyword">instanceof</span> <span class="hljs-built_in">Number</span>) &amp;&amp; (v &gt;=<span class="hljs-number">1</span> &amp;&amp; v &lt;= <span class="hljs-number">100</span>);
    }
});

<span class="hljs-keyword">let</span> two = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Number</span>(<span class="hljs-number">2</span>),
    zero = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Number</span>(<span class="hljs-number">0</span>);

<span class="hljs-built_in">console</span>.log(two <span class="hljs-keyword">instanceof</span> SpecialNumber);    <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(zero <span class="hljs-keyword">instanceof</span> SpecialNumber);   <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x437;&#x430;&#x434;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Symbol.hasInstance</code>, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>true</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x454; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x43C; <code>Number</code> &#x456; &#x43C;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434; 1 &#x434;&#x43E; 100. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, <code>two</code> &#x431;&#x443;&#x434;&#x435; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x43C; <code>SpecialNumber</code>, &#x43D;&#x435; &#x434;&#x438;&#x432;&#x43B;&#x44F;&#x447;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x436;&#x43E;&#x434;&#x43D;&#x438;&#x445; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x445; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x456;&#x432; &#x43C;&#x456;&#x436; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E; <code>SpecialNumber</code> &#x442;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x44E; <code>two</code>. &#x417;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;, &#x449;&#x43E; &#x43B;&#x456;&#x432;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x43D;&#x434; &#x443; <code>instanceof</code> &#x43C;&#x443;&#x441;&#x438;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C;, &#x434;&#x43B;&#x44F; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435;&#x442;&#x44C;&#x441;&#x44F; <code>Symbol.hasInstance</code>, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x43D;&#x435;&#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; <code>instanceof</code> &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>false</code>.</p>
<p>W&gt; &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>Symbol.hasInstance</code> &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439; &#x44F;&#x43A; &#x43E;&#x442; <code>Date</code> &#x442;&#x430; <code>Error</code>. &#x426;&#x435; &#x43D;&#x435; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x446;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x432;&#x430;&#x448; &#x43A;&#x43E;&#x434; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x43D;&#x435;&#x43F;&#x440;&#x43E;&#x433;&#x43D;&#x43E;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;. &#x425;&#x43E;&#x440;&#x43E;&#x448;&#x43E;&#x44E; &#x456;&#x434;&#x435;&#x454;&#x44E; &#x454; &#x43B;&#x438;&#x448;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441; <code>Symbol.hasInstance</code> &#x443; &#x432;&#x430;&#x448;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x445; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439; &#x456; &#x43B;&#x438;&#x448;&#x435; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x446;&#x435; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E;.</p>
<h3 id="&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;-symbolisconcatspreadable">&#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B; Symbol.isConcatSpreadable</h3>
<p>JavaScript &#x43C;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>concat()</code> &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43D;&#x43A;&#x430;&#x442;&#x438;&#x43D;&#x430;&#x446;&#x456;&#x457; &#x434;&#x432;&#x43E;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x41E;&#x441;&#x44C; &#x44F;&#x43A; &#x446;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> colors1 = [ <span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span> ],
    colors2 = colors1.concat([ <span class="hljs-string">&quot;blue&quot;</span>, <span class="hljs-string">&quot;black&quot;</span> ]);

<span class="hljs-built_in">console</span>.log(colors2.length);    <span class="hljs-comment">// 4</span>
<span class="hljs-built_in">console</span>.log(colors2);           <span class="hljs-comment">// [&quot;red&quot;,&quot;green&quot;,&quot;blue&quot;,&quot;black&quot;]</span>
</code></pre>
<p>&#x422;&#x430;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x43A;&#x43E;&#x43D;&#x43A;&#x430;&#x442;&#x435;&#x43D;&#x443;&#x44E; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x443; &#x43A;&#x456;&#x43D;&#x435;&#x446;&#x44C; <code>colors1</code> &#x442;&#x430; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; <code>colors2</code> &#x2014; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437; &#x443;&#x441;&#x456;&#x43C;&#x430; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x43E;&#x431;&#x43E;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>concat()</code> &#x43C;&#x43E;&#x436;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x442;&#x438; &#x43D;&#x435;&#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x456;, &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x446;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x432; &#x43A;&#x456;&#x43D;&#x435;&#x446;&#x44C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> colors1 = [ <span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span> ],
    colors2 = colors1.concat([ <span class="hljs-string">&quot;blue&quot;</span>, <span class="hljs-string">&quot;black&quot;</span> ], <span class="hljs-string">&quot;brown&quot;</span>);

<span class="hljs-built_in">console</span>.log(colors2.length);    <span class="hljs-comment">// 5</span>
<span class="hljs-built_in">console</span>.log(colors2);           <span class="hljs-comment">// [&quot;red&quot;,&quot;green&quot;,&quot;blue&quot;,&quot;black&quot;,&quot;brown&quot;]</span>
</code></pre>
<p>&#x422;&#x443;&#x442;, &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; <code>&quot;brown&quot;</code> &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x438;&#x439; &#x443; <code>concat()</code> &#x456; &#x432;&#x456;&#x43D; &#x441;&#x442;&#x430;&#x454; &#x43F;&#x2019;&#x44F;&#x442;&#x438;&#x43C; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; <code>colors2</code>. &#x427;&#x43E;&#x43C;&#x443; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;&#x2013;&#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x442;&#x440;&#x430;&#x43A;&#x442;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435; &#x442;&#x430;&#x43A; &#x44F;&#x43A; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;? &#x421;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F; JavaScript &#x43A;&#x430;&#x436;&#x435;, &#x449;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x440;&#x43E;&#x437;&#x431;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;, &#x430; &#x432;&#x441;&#x456; &#x456;&#x43D;&#x448;&#x456; &#x442;&#x438;&#x43F;&#x438; &#x2014; &#x43D;&#x456;. &#x414;&#x43E; ECMAScript 6 &#x43D;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x446;&#x44E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443;.</p>
<p>&#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.isConcatSpreadable</code> &#x454; &#x431;&#x443;&#x43B;&#x435;&#x432;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;, &#x449;&#x43E; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x43D;&#x430; &#x442;&#x435;, &#x447;&#x438; &#x446;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43C;&#x430;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>length</code> &#x456; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;, &#x456; &#x446;&#x456; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x43E; &#x432; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>concat()</code>. &#x41D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x434;&#x43E;&#x431;&#x440;&#x435;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x438;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;, &#x446;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43D;&#x435; &#x437;&#x2019;&#x44F;&#x432;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x446;&#x435;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x443;, &#x449;&#x43E;&#x431; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x44F;&#x43A; <code>concat()</code> &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x437; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x438;&#x43C;&#x438; &#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x44F;&#x43A; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x438;&#x441;&#x44C; <code>concat()</code> &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x434;&#x43B;&#x44F; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> collection = {
    <span class="hljs-number">0</span>: <span class="hljs-string">&quot;Hello&quot;</span>,
    <span class="hljs-number">1</span>: <span class="hljs-string">&quot;world&quot;</span>,
    length: <span class="hljs-number">2</span>,
    [<span class="hljs-built_in">Symbol</span>.isConcatSpreadable]: <span class="hljs-literal">true</span>
};

<span class="hljs-keyword">let</span> messages = [ <span class="hljs-string">&quot;Hi&quot;</span> ].concat(collection);

<span class="hljs-built_in">console</span>.log(messages.length);    <span class="hljs-comment">// 3</span>
<span class="hljs-built_in">console</span>.log(messages);           <span class="hljs-comment">// [&quot;Hi&quot;,&quot;Hello&quot;,&quot;world&quot;]</span>
</code></pre>
<p>&#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>collection</code> &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x442;&#x438; &#x43D;&#x430;&#x447;&#x435; &#x43C;&#x430;&#x441;&#x438;&#x432;: &#x432;&#x456;&#x43D; &#x43C;&#x430;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>length</code> &#x442;&#x430; &#x434;&#x432;&#x430; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;. &#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.isConcatSpreadable</code> &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; <code>true</code>, &#x449;&#x43E;&#x431; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x456; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x44F;&#x43A; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;. &#x41A;&#x43E;&#x43B;&#x438; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>concat()</code> &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x441;&#x442;&#x44C;&#x441;&#x44F; <code>collection</code>, &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x443;&#x44E;&#x447;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; <code>&quot;Hello&quot;</code> &#x442;&#x430; <code>&quot;world&quot;</code> &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; <code>&quot;Hi&quot;</code>.</p>
<p>I&gt; &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x438; <code>Symbol.isConcatSpreadable</code> &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>false</code> &#x434;&#x43B;&#x44F; &#x43F;&#x456;&#x434;&#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x438;&#x442;&#x438; &#x457;&#x445; &#x440;&#x43E;&#x437;&#x431;&#x438;&#x442;&#x442;&#x44F; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>concat()</code>. &#x41F;&#x440;&#x43E; &#x43F;&#x456;&#x434;&#x43A;&#x43B;&#x430;&#x441;&#x438; &#x43F;&#x456;&#x434;&#x435; &#x43C;&#x43E;&#x432;&#x430; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 8.</p>
<h3 id="&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;-symbolmatch-symbolreplace-symbolsearch-&#x442;&#x430;-symbolsplit">&#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; Symbol.match, Symbol.replace, Symbol.search &#x442;&#x430; Symbol.split</h3>
<p>&#x420;&#x44F;&#x434;&#x43A;&#x438; &#x442;&#x430; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43C;&#x430;&#x43B;&#x438; &#x442;&#x456;&#x441;&#x43D;&#x456; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x438; &#x443; JavaScript. &#x420;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x442;&#x438;&#x43F;, &#x437;&#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x430;, &#x43C;&#x430;&#x454; &#x440;&#x44F;&#x434; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;:</p>
<ul>
<li><code>match(regex)</code> - &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x447;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x441;&#x43F;&#x456;&#x432;&#x43F;&#x430;&#x434;&#x430;&#x454; &#x437; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x43C; &#x432;&#x438;&#x440;&#x430;&#x437;&#x43E;&#x43C;;</li>
<li><code>replace(regex, replacement)</code> - &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x44E;&#x454; &#x441;&#x43F;&#x456;&#x432;&#x43F;&#x430;&#x434;&#x456;&#x43D;&#x43D;&#x44F; &#x437; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x43C; &#x432;&#x438;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x43D;&#x430; <code>replacement</code>;</li>
<li><code>search(regex)</code> - &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443; &#x432; &#x440;&#x44F;&#x434;&#x43A;&#x443;;</li>
<li><code>split(regex)</code> - &#x440;&#x43E;&#x437;&#x431;&#x438;&#x432;&#x430;&#x454; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43D;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437;&#x430; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x43C; &#x432;&#x438;&#x440;&#x430;&#x437;&#x43E;&#x43C;.</li>
</ul>
<p>&#x414;&#x43E; ECMAScript 6 &#x442;&#x435;, &#x44F;&#x43A; &#x446;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x434;&#x456;&#x44E;&#x442;&#x44C; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438;, &#x431;&#x443;&#x43B;&#x438; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x432;&#x456;&#x434; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432;, &#x43D;&#x435; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x44E;&#x447;&#x438; &#x436;&#x43E;&#x434;&#x43D;&#x43E;&#x457; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x43B;&#x44F; &#x437;&#x456;&#x43C;&#x456;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;, &#x44F;&#x43A;&#x456; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C;&#x438;. ECMAScript 6 &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x447;&#x43E;&#x442;&#x438;&#x440;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x437;&#x430; &#x446;&#x456; &#x447;&#x43E;&#x442;&#x438;&#x440;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; <code>RegExp</code>.</p>
<p>&#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; <code>Symbol.match</code>, <code>Symbol.replace</code>, <code>Symbol.search</code> &#x442;&#x430; <code>Symbol.split</code> &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;, &#x44F;&#x43A;&#x456; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x437; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x43C;&#x438; &#x432;&#x438;&#x440;&#x430;&#x437;&#x430;&#x43C;&#x438; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;: &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>match()</code>, &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>replace()</code>, &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>search()</code> &#x442;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>split()</code>, &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;. &#x426;&#x456; &#x447;&#x43E;&#x442;&#x438;&#x440;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x430;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; <code>RegExp.prototype</code> &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x457;, &#x44F;&#x43A;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;.</p>
<p>&#x417;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x446;&#x435;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;, &#x44F;&#x43A;&#x438;&#x439; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x437; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438;. &#x429;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x446;&#x435;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x442;&#x430;&#x43A;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x443; &#x43A;&#x43E;&#x434;&#x456;:</p>
<ul>
<li><code>Symbol.match</code> - &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x442;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x441;&#x43F;&#x456;&#x432;&#x43F;&#x430;&#x434;&#x456;&#x43D;&#x44C;, &#x430;&#x431;&#x43E; <code>null</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x437;&#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x43E; &#x436;&#x43E;&#x434;&#x43D;&#x438;&#x445; &#x441;&#x43F;&#x456;&#x432;&#x43F;&#x430;&#x434;&#x456;&#x43D;&#x44C;;</li>
<li><code>Symbol.replace</code> - &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x440;&#x44F;&#x434;&#x43E;&#x43A;&#x2013;&#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x442;&#x430; &#x440;&#x44F;&#x434;&#x43E;&#x43A;&#x2013;&#x437;&#x430;&#x43C;&#x456;&#x43D;&#x443; &#x442;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;;</li>
<li><code>Symbol.search</code> - &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x440;&#x44F;&#x434;&#x43E;&#x43A;&#x2013;&#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x442;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x439; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441; &#x432;&#x445;&#x43E;&#x434;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x441;&#x43F;&#x456;&#x432;&#x43F;&#x430;&#x434;&#x456;&#x43D;&#x43D;&#x44F;, &#x430;&#x431;&#x43E; -1, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x437;&#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x43E; &#x436;&#x43E;&#x434;&#x43D;&#x438;&#x445; &#x441;&#x43F;&#x456;&#x432;&#x43F;&#x430;&#x434;&#x456;&#x43D;&#x44C;;</li>
<li><code>Symbol.split</code> - &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x440;&#x44F;&#x434;&#x43E;&#x43A;&#x2013;&#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x442;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x444;&#x440;&#x430;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x430;, &#x449;&#x43E; &#x431;&#x443;&#x43B;&#x438; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x435;&#x43D;&#x456; &#x437;&#x430; &#x441;&#x43F;&#x456;&#x432;&#x43F;&#x430;&#x434;&#x456;&#x43D;&#x43D;&#x44F;&#x43C;.</li>
</ul>
<p>&#x41C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438; &#x446;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x430;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;, &#x449;&#x43E; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x44E;&#x442;&#x44C; &#x441;&#x43F;&#x456;&#x432;&#x43F;&#x430;&#x434;&#x456;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x43C; &#x431;&#x435;&#x437; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432; &#x442;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x457;&#x445; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x445;, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x449;&#x43E; &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x454; &#x446;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x432; &#x434;&#x456;&#x457;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x435;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x430; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x430; &#x434;&#x43B;&#x44F; /^.{10}$/</span>
<span class="hljs-keyword">let</span> hasLengthOf10 = {
    [<span class="hljs-built_in">Symbol</span>.match]: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
        <span class="hljs-keyword">return</span> value.length === <span class="hljs-number">10</span> ? [value.substring(<span class="hljs-number">0</span>, <span class="hljs-number">10</span>)] : <span class="hljs-literal">null</span>;
    },
    [<span class="hljs-built_in">Symbol</span>.replace]: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value, replacement</span>) </span>{
        <span class="hljs-keyword">return</span> value.length === <span class="hljs-number">10</span> ?
            replacement + value.substring(<span class="hljs-number">10</span>) : value;
    },
    [<span class="hljs-built_in">Symbol</span>.search]: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
        <span class="hljs-keyword">return</span> value.length === <span class="hljs-number">10</span> ? <span class="hljs-number">0</span> : <span class="hljs-number">-1</span>;
    },
    [<span class="hljs-built_in">Symbol</span>.split]: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
        <span class="hljs-keyword">return</span> value.length === <span class="hljs-number">10</span> ? [<span class="hljs-string">&quot;&quot;</span>, <span class="hljs-string">&quot;&quot;</span>] : [value];
    }
};

<span class="hljs-keyword">let</span> message1 = <span class="hljs-string">&quot;Hello world&quot;</span>,   <span class="hljs-comment">// 11 characters</span>
    message2 = <span class="hljs-string">&quot;Hello John&quot;</span>;    <span class="hljs-comment">// 10 characters</span>


<span class="hljs-keyword">let</span> match1 = message1.match(hasLengthOf10),
    match2 = message2.match(hasLengthOf10);

<span class="hljs-built_in">console</span>.log(match1);            <span class="hljs-comment">// null</span>
<span class="hljs-built_in">console</span>.log(match2);            <span class="hljs-comment">// [&quot;Hello John&quot;]</span>

<span class="hljs-keyword">let</span> replace1 = message1.replace(hasLengthOf10),
    replace2 = message2.replace(hasLengthOf10);

<span class="hljs-built_in">console</span>.log(replace1);          <span class="hljs-comment">// &quot;Hello world&quot;</span>
<span class="hljs-built_in">console</span>.log(replace2);          <span class="hljs-comment">// &quot;Hello John&quot;</span>

<span class="hljs-keyword">let</span> search1 = message1.search(hasLengthOf10),
    search2 = message2.search(hasLengthOf10);

<span class="hljs-built_in">console</span>.log(search1);           <span class="hljs-comment">// -1</span>
<span class="hljs-built_in">console</span>.log(search2);           <span class="hljs-comment">// 0</span>

<span class="hljs-keyword">let</span> split1 = message1.split(hasLengthOf10),
    split2 = message2.split(hasLengthOf10);

<span class="hljs-built_in">console</span>.log(split1);            <span class="hljs-comment">// [&quot;Hello world&quot;]</span>
<span class="hljs-built_in">console</span>.log(split2);            <span class="hljs-comment">// [&quot;&quot;, &quot;&quot;]</span>
</code></pre>
<p>&#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>hasLengthOf10</code> &#x43D;&#x430;&#x446;&#x456;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E;&#x431; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x442;&#x430;&#x43A;, &#x44F;&#x43A; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x449;&#x43E; &#x43C;&#x430;&#x454; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x443; &#x432; 10 &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;. &#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x437; &#x447;&#x43E;&#x442;&#x438;&#x440;&#x44C;&#x43E;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; <code>hasLengthOf10</code> &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x447;&#x435;&#x440;&#x435;&#x437; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;, &#x430; &#x442;&#x43E;&#x434;&#x456; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x434;&#x432;&#x43E;&#x445; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, <code>message1</code>, &#x43C;&#x430;&#x454; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x443; 11 &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x456; &#x442;&#x43E;&#x43C;&#x443; &#x43D;&#x435; &#x441;&#x43F;&#x456;&#x432;&#x43F;&#x430;&#x434;&#x430;&#x454;; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, <code>message2</code>, &#x43C;&#x430;&#x454; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x443; 10 &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; &#x456; &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x443;&#x43C;&#x43E;&#x432;&#x456;. &#x41D;&#x435; &#x434;&#x438;&#x432;&#x43B;&#x44F;&#x447;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; <code>hasLengthOf10</code> &#x43D;&#x435; &#x454; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x43C; &#x432;&#x438;&#x440;&#x430;&#x437;&#x43E;&#x43C;, &#x432;&#x456;&#x434; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x43C;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x437; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438;.</p>
<p>&#x426;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x456; &#x441;&#x43F;&#x456;&#x432;&#x43F;&#x430;&#x434;&#x456;&#x43D;&#x43D;&#x44F;, &#x43D;&#x456;&#x436; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456; &#x437; &#x440;&#x435;&#x433;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x43C;&#x438; &#x432;&#x438;&#x440;&#x430;&#x437;&#x430;&#x43C;&#x438;, &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x454; &#x448;&#x438;&#x440;&#x43E;&#x43A;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x446;&#x44C;&#x43A;&#x438;&#x445; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x456;&#x432; &#x441;&#x43F;&#x456;&#x432;&#x43F;&#x430;&#x434;&#x456;&#x43D;&#x44C;.</p>
<h3 id="&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;-symboltoprimitive">&#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B; Symbol.toPrimitive</h3>
<p>JavaScript &#x447;&#x430;&#x441;&#x442;&#x43E; &#x43D;&#x430;&#x43C;&#x430;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x443; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x445; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454;&#x442;&#x435; &#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x440;&#x456;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; (<code>==</code>), &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x43D;&#x43D;&#x44F;&#x43C;. &#x421;&#x430;&#x43C;&#x435; &#x446;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x43C;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C;, &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x456;&#x43C;, &#x43F;&#x440;&#x43E;&#x442;&#x435; ECMAScript 6 &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x454; &#x446;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; (&#x434;&#x430;&#x454; &#x437;&#x43C;&#x43E;&#x433;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E;) &#x447;&#x435;&#x440;&#x435;&#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Symbol.toPrimitive</code>.</p>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Symbol.toPrimitive</code> &#x437;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x439; &#x432; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x456; &#x443;&#x441;&#x456;&#x445; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x442;&#x430; &#x43E;&#x43F;&#x438;&#x441;&#x443;&#x454;, &#x449;&#x43E; &#x43C;&#x430;&#x454; &#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43F;&#x440;&#x438; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x456;&#x457; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x443; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x439; &#x442;&#x438;&#x43F;. &#x41A;&#x43E;&#x43B;&#x438; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x456;&#x44F; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x430;, &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>Symbol.toPrimitive</code> &#x437; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C;, &#x44F;&#x43A;&#x438;&#x439; &#x437;&#x433;&#x430;&#x434;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x44F;&#x43A; <code>hint</code>. &#x410;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; <code>hint</code> &#x2014; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x437; &#x442;&#x440;&#x44C;&#x43E;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;. &#x42F;&#x43A;&#x449;&#x43E; <code>hint</code> &#x454; <code>&quot;number&quot;</code>, &#x442;&#x43E;&#x434;&#x456; <code>Symbol.toPrimitive</code> &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x447;&#x438;&#x441;&#x43B;&#x43E;. &#x42F;&#x43A;&#x449;&#x43E; <code>hint</code> &#x454; <code>&quot;string&quot;</code>, &#x442;&#x43E;&#x434;&#x456; &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;&#x441;&#x44C; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x430; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x456;&#x43D; &#x440;&#x456;&#x432;&#x43D;&#x438;&#x439; <code>&quot;default&quot;</code>, &#x442;&#x43E;&#x434;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F; &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x431;&#x430;&#x436;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443; (&#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x456;&#x43D;&#x448;&#x438;&#x439;).</p>
<p>&#x414;&#x43B;&#x44F; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x441;&#x442;&#x456; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x43C;&#x430;&#x454; &#x442;&#x430;&#x43A;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443;, &#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x43F;&#x440;&#x456;&#x43E;&#x440;&#x438;&#x442;&#x435;&#x442;&#x443;:</p>
<ol>
<li>&#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>valueOf()</code>, &#x456; &#x44F;&#x43A;&#x449;&#x43E; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x454; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;, &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E;;</li>
<li>&#x406;&#x43D;&#x430;&#x43A;&#x448;&#x435;, &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>toString()</code>, &#x456; &#x44F;&#x43A;&#x449;&#x43E; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x454; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;, &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E;;</li>
<li>&#x406;&#x43D;&#x430;&#x43A;&#x448;&#x435;, &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;.</li>
</ol>
<p>&#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x434;&#x43B;&#x44F; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x441;&#x442;&#x456; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432;, &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x43C;&#x430;&#x454; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A;:</p>
<ol>
<li>&#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>toString()</code>, &#x456; &#x44F;&#x43A;&#x449;&#x43E; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x454; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;, &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E;;</li>
<li>&#x406;&#x43D;&#x430;&#x43A;&#x448;&#x435;, &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>valueOf()</code>, &#x456; &#x44F;&#x43A;&#x449;&#x43E; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C; &#x454; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E;;</li>
<li>&#x406;&#x43D;&#x430;&#x43A;&#x448;&#x435;, &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;.</li>
</ol>
<p>&#x423; &#x431;&#x430;&#x433;&#x430;&#x442;&#x44C;&#x43E;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x430;&#x445;, &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x442;&#x440;&#x430;&#x43A;&#x442;&#x443;&#x44E;&#x442;&#x44C; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; (default mode) &#x44F;&#x43A; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x439; &#x434;&#x43E; &#x447;&#x438;&#x441;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; (&#x43E;&#x43A;&#x440;&#x456;&#x43C; <code>Date</code>, &#x44F;&#x43A;&#x430; &#x442;&#x440;&#x430;&#x43A;&#x442;&#x443;&#x454; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x44F;&#x43A; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x434;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443;). &#x427;&#x435;&#x440;&#x435;&#x437; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>Symbol.toPrimitive</code> &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;.</p>
<p>I&gt; &#x420;&#x435;&#x436;&#x438;&#x43C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x435; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>==</code>, &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>+</code> &#x442;&#x430;, &#x43F;&#x440;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x456; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;, &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Date</code>. &#x411;&#x456;&#x43B;&#x44C;&#x448;&#x456;&#x441;&#x442;&#x44C; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x430;&#x431;&#x43E; &#x447;&#x438;&#x441;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x438;.</p>
<p>&#x414;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x438; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x439;&#x442;&#x435; <code>Symbol.toPrimitive</code> &#x442;&#x430; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x439;&#x442;&#x435; &#x439;&#x43E;&#x43C;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">Temperature</span>(<span class="hljs-params">degrees</span>) </span>{
    <span class="hljs-keyword">this</span>.degrees = degrees;
}

Temperature.prototype[<span class="hljs-built_in">Symbol</span>.toPrimitive] = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">hint</span>) </span>{

    <span class="hljs-keyword">switch</span> (hint) {
        <span class="hljs-keyword">case</span> <span class="hljs-string">&quot;string&quot;</span>:
            <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.degrees + <span class="hljs-string">&quot;\u00b0&quot;</span>; <span class="hljs-comment">// &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x433;&#x440;&#x430;&#x434;&#x443;&#x441;&#x456;&#x432;</span>

        <span class="hljs-keyword">case</span> <span class="hljs-string">&quot;number&quot;</span>:
            <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.degrees;

        <span class="hljs-keyword">case</span> <span class="hljs-string">&quot;default&quot;</span>:
            <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.degrees + <span class="hljs-string">&quot; degrees&quot;</span>;
    }
};

<span class="hljs-keyword">let</span> freezing = <span class="hljs-keyword">new</span> Temperature(<span class="hljs-number">32</span>);

<span class="hljs-built_in">console</span>.log(freezing + <span class="hljs-string">&quot;!&quot;</span>);            <span class="hljs-comment">// &quot;32 degrees!&quot;</span>
<span class="hljs-built_in">console</span>.log(freezing / <span class="hljs-number">2</span>);              <span class="hljs-comment">// 16</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">String</span>(freezing));          <span class="hljs-comment">// &quot;32&#xB0;&quot;</span>
</code></pre>
<p>&#x422;&#x430;&#x43A;&#x438;&#x439; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x443;&#x454; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Temperature</code> &#x442;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; <code>Symbol.toPrimitive</code> &#x43D;&#x430; &#x439;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x456;. &#x420;&#x456;&#x437;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; <code>hint</code> &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x43D;&#x430; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x430;&#x431;&#x43E; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; (&#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; <code>hint</code> &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x440;&#x443;&#x448;&#x456;&#x454;&#x43C; JavaScript). &#x423; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>Temperature()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x442;&#x435;&#x43C;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x443;&#x440;&#x443; &#x437; Unicode&#x2013;&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x43C; &#x433;&#x440;&#x430;&#x434;&#x443;&#x441;&#x456;&#x432;. &#x423; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;, &#x432;&#x43E;&#x43D;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x430; &#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432;&#x43E;&#x43D;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x454; &#x441;&#x43B;&#x43E;&#x432;&#x43E; &quot;degrees&quot; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x447;&#x438;&#x441;&#x43B;&#x430;.</p>
<p>&#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>console.log</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x440;&#x456;&#x437;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; <code>hint</code>. &#x41E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>+</code> &#x43F;&#x440;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x430; <code>hint</code> &#x2014; &#x431;&#x443;&#x434;&#x435; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;default&quot;</code>, &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>/</code> &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x434;&#x435; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x432; <code>hint</code> &#x431;&#x443;&#x434;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;number&quot;</code> &#x456; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C;, &#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>String()</code> &#x43F;&#x440;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x456; <code>hint</code> &#x431;&#x443;&#x434;&#x435; &#x440;&#x456;&#x432;&#x43D;&#x438;&#x439; <code>&quot;string&quot;</code>. &#x422;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x442;&#x440;&#x44C;&#x43E;&#x445; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;&#x432; &#x2014; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E;, &#x449;&#x43E; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x431;&#x443;&#x432; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C;, &#x44F;&#x43A; &#x456; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x430;&#x431;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x439;.</p>
<h3 id="&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;-symboltostringtag">&#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B; Symbol.toStringTag</h3>
<p>&#x41E;&#x434;&#x43D;&#x456;&#x454;&#x44E; &#x437; &#x43D;&#x430;&#x439;&#x446;&#x456;&#x43A;&#x430;&#x432;&#x456;&#x448;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C; &#x443; JavaScript &#x431;&#x443;&#x43B;&#x430; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x438;&#x449; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;. &#x412;&#x43E;&#x43D;&#x430; &#x437;&#x2019;&#x44F;&#x432;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; web&#x2013;&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445;, &#x43A;&#x43E;&#x43B;&#x438; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x430; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x444;&#x440;&#x435;&#x439;&#x43C; (iframe), &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x44F;&#x43A; &#x456; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x430;, &#x442;&#x430;&#x43A; &#x456; &#x444;&#x440;&#x435;&#x439;&#x43C; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x456; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x438;&#x449;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;. &#x423; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x456;&#x432;, &#x446;&#x435; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43C;&#x456;&#x436; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x438;&#x449;&#x430;&#x43C;&#x438;. &#x41F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x437;&#x2019;&#x44F;&#x432;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x454;&#x442;&#x435; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438;, &#x437; &#x44F;&#x43A;&#x438;&#x43C; &#x442;&#x438;&#x43F;&#x43E;&#x43C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x432;&#x438; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;&#x442;&#x435; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x442;&#x43E;&#x433;&#x43E; &#x44F;&#x43A; &#x446;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x432;&#x441;&#x44F; &#x43C;&#x456;&#x436; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438;.</p>
<p>&#x417;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x43E;&#x43C; &#x446;&#x456;&#x454;&#x457; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438; &#x454; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x437; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x443; &#x443; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x443;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x439;&#x43E;&#x433;&#x43E; &#x430;&#x431;&#x43E; &#x43D;&#x430;&#x432;&#x43F;&#x430;&#x43A;&#x438;. &#x412; &#x442;&#x435;&#x440;&#x43C;&#x456;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x456;&#x457; ECMAScript 6 &#x44F;&#x43A; &#x444;&#x440;&#x435;&#x439;&#x43C;, &#x442;&#x430;&#x43A; &#x456; &#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x430;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x439;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x440;&#x456;&#x437;&#x43D;&#x456; <em>&#x441;&#x444;&#x435;&#x440;&#x438;</em>, &#x44F;&#x43A;&#x456; &#x454; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x438;&#x449;&#x430;&#x43C;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; JavaScript. &#x41A;&#x43E;&#x436;&#x43D;&#x430; &#x441;&#x444;&#x435;&#x440;&#x430; &#x43C;&#x430;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x443; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x456; &#x441;&#x432;&#x43E;&#x457;&#x43C;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43C;&#x438; &#x43A;&#x43E;&#x43F;&#x456;&#x44F;&#x43C;&#x438; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x41D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x441;&#x444;&#x435;&#x440;&#x438;, &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x449;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x431;&#x443;&#x434;&#x435; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x43F;&#x440;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x456; &#x439;&#x43E;&#x433;&#x43E; &#x434;&#x43E; &#x456;&#x43D;&#x448;&#x43E;&#x457; &#x441;&#x444;&#x435;&#x440;&#x438;, &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>instanceof Array</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; <code>false</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x446;&#x435;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x439; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x437; &#x456;&#x43D;&#x448;&#x43E;&#x457; &#x441;&#x444;&#x435;&#x440;&#x438;, &#x430; <code>Array</code> &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x454; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x437; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x457;.</p>
<h4 id="&#x43E;&#x431;&#x445;&#x456;&#x434;-&#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438;-&#x437;-&#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x454;&#x44E;">&#x41E;&#x431;&#x445;&#x456;&#x434; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438; &#x437; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x454;&#x44E;</h4>
<p>&#x417;&#x443;&#x441;&#x442;&#x440;&#x456;&#x432;&#x448;&#x438;&#x441;&#x44C; &#x437; &#x446;&#x456;&#x454;&#x44E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x43E;&#x44E;, &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x448;&#x432;&#x438;&#x434;&#x43A;&#x43E; &#x437;&#x43D;&#x430;&#x439;&#x448;&#x43B;&#x438; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x412;&#x43E;&#x43D;&#x438; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x438;, &#x449;&#x43E; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>toString()</code>, &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; JavaScript&#x2013;&#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A; &#x43F;&#x43E;&#x447;&#x430;&#x43B;&#x438; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x438; &#x432; &#x441;&#x435;&#x431;&#x435; &#x442;&#x430;&#x43A;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">isArray</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-built_in">Object</span>.prototype.toString.call(value) === <span class="hljs-string">&quot;[object Array]&quot;</span>;
}

<span class="hljs-built_in">console</span>.log(isArray([]));   <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x426;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x442;&#x438; &#x44F;&#x43A; &#x445;&#x430;&#x43A;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x446;&#x435; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x443;&#x454; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x43E; &#x434;&#x43E;&#x431;&#x440;&#x435; &#x443; &#x432;&#x441;&#x456;&#x445; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>toString()</code> &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43D;&#x435; &#x454; &#x434;&#x443;&#x436;&#x435; &#x437;&#x440;&#x443;&#x447;&#x43D;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x456;&#x43D; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x41F;&#x440;&#x43E;&#x442;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>toString()</code> &#x43D;&#x430; <code>Object.prototype</code> &#x43C;&#x430;&#x454; &#x43F;&#x440;&#x438;&#x447;&#x443;&#x434;&#x443;: &#x432;&#x456;&#x43D; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x454; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44C;&#x43E;&#x437;&#x430;&#x434;&#x430;&#x43D;&#x435; &#x456;&#x43C;&apos;&#x44F; <code>[[Class]]</code> &#x443; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;. &#x420;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x446;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x449;&#x43E;&#x431; &#x434;&#x456;&#x437;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44C;, &#x437; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; JavaScript&#x2013;&#x43E;&#x442;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x439;&#x448;&#x43B;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;.</p>
<p>&#x420;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x448;&#x432;&#x438;&#x434;&#x43A;&#x43E; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x438;, &#x449;&#x43E;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x446;&#x44E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443;, &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x446;&#x435;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434;, &#x449;&#x43E;&#x431; &#x440;&#x43E;&#x437;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x442;&#x438; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x432;&#x456;&#x434; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x445; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C;&#x438;. &#x41D;&#x430;&#x439;&#x43F;&#x43E;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x456;&#x448;&#x438;&#x43C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x43E;&#x43C; &#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>JSON</code> &#x432; ECMAScript 5.</p>
<p>&#x414;&#x43E; ECMAScript 5 &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438; <em>json2.js</em> &#x432;&#x456;&#x434; &#x414;&#x443;&#x433;&#x43B;&#x430;&#x441;&#x430; &#x41A;&#x440;&#x43E;&#x43A;&#x444;&#x43E;&#x440;&#x434;&#x430; (Douglas Crockford), &#x44F;&#x43A;&#x438;&#x439; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x432; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>JSON</code>. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438; &#x43F;&#x43E;&#x447;&#x430;&#x43B;&#x438; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>JSON</code>, &#x437;&#x2019;&#x44F;&#x432;&#x438;&#x43B;&#x430;&#x441;&#x44F; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x430; &#x440;&#x43E;&#x437;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x442;&#x438; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>JSON</code> &#x437; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; JavaScript&#x2013;&#x43E;&#x442;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>JSON</code> &#x437; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A;. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x442;&#x43E;&#x439; &#x441;&#x430;&#x43C;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434;, &#x44F;&#x43A;&#x438;&#x439; &#x44F; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x432; &#x43D;&#x430; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; <code>isArray()</code>, &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43B;&#x438; &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">supportsNativeJSON</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">typeof</span> <span class="hljs-built_in">JSON</span> !== <span class="hljs-string">&quot;undefined&quot;</span> &amp;&amp;
        <span class="hljs-built_in">Object</span>.prototype.toString.call(<span class="hljs-built_in">JSON</span>) === <span class="hljs-string">&quot;[object JSON]&quot;</span>;
}
</code></pre>
<p>&#x422;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Object.prototype</code>, &#x449;&#x43E; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x43B;&#x430; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43C;&#x456;&#x436; &#x444;&#x440;&#x435;&#x439;&#x43C;&#x430;&#x43C;&#x438;, &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x430;&#x433;&#x430;&#x43B;&#x430; &#x441;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x447;&#x438; <code>JSON</code> &#x454; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x43C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C; <code>JSON</code>, &#x447;&#x438; &#x43D;&#x456;. &#x41D;&#x435;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>JSON</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x432; &#x431;&#x438; <code>[object Object]</code>, &#x442;&#x43E;&#x434;&#x456; &#x44F;&#x43A; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x430; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; <code>[object JSON]</code>. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x441;&#x442;&#x430;&#x432; &#x434;&#x435;-&#x444;&#x430;&#x43A;&#x442;&#x43E; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;.</p>
<h4 id="ecmascript-6-&#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x44C;">ECMAScript 6 &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x44C;</h4>
<p>ECMAScript 6 &#x43F;&#x435;&#x440;&#x435;&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x446;&#x44E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x447;&#x435;&#x440;&#x435;&#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; <code>Symbol.toStringTag</code>. &#x426;&#x435;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;, &#x449;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x44F;&#x43A;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x43B;&#x456;&#x434; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>Object.prototype.toString.call()</code> &#x434;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;. &#x414;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; <code>&quot;Array&quot;</code>, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x441;&#x430;&#x43C;&#x435; &#x446;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>Symbol.toStringTag</code>.</p>
<p>&#x422;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>Symbol.toStringTag</code> &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x448;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">Person</span>(<span class="hljs-params">name</span>) </span>{
    <span class="hljs-keyword">this</span>.name = name;
}

Person.prototype[<span class="hljs-built_in">Symbol</span>.toStringTag] = <span class="hljs-string">&quot;Person&quot;</span>;

<span class="hljs-keyword">let</span> me = <span class="hljs-keyword">new</span> Person(<span class="hljs-string">&quot;Nicholas&quot;</span>);

<span class="hljs-built_in">console</span>.log(me.toString());                         <span class="hljs-comment">// &quot;[object Person]&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.prototype.toString.call(me));    <span class="hljs-comment">// &quot;[object Person]&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.toStringTag</code> &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x430; &#x43D;&#x430; <code>Person.prototype</code> &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x438; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x440;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>Person.prototype</code> &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Object.prototype.toString()</code>, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; <code>Symbol.toStringTag</code>, &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>me.toString()</code>. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x432;&#x438; &#x432;&#x441;&#x435; &#x449;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x430;&#x434;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>toString()</code>, &#x449;&#x43E; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x456;&#x43D;&#x448;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x431;&#x435;&#x437; &#x432;&#x43F;&#x43B;&#x438;&#x432;&#x443; &#x43D;&#x430; &#x442;&#x435;, &#x44F;&#x43A; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Object.prototype.toString.call()</code>. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x446;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x442;&#x438;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">Person</span>(<span class="hljs-params">name</span>) </span>{
    <span class="hljs-keyword">this</span>.name = name;
}

Person.prototype[<span class="hljs-built_in">Symbol</span>.toStringTag] = <span class="hljs-string">&quot;Person&quot;</span>;

Person.prototype.toString = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.name;
};

<span class="hljs-keyword">let</span> me = <span class="hljs-keyword">new</span> Person(<span class="hljs-string">&quot;Nicholas&quot;</span>);

<span class="hljs-built_in">console</span>.log(me.toString());                         <span class="hljs-comment">// &quot;Nicholas&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.prototype.toString.call(me));    <span class="hljs-comment">// &quot;[object Person]&quot;</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; <code>Person.prototype.toString()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>name</code>. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; <code>Person</code> &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Object.prototype.toString()</code>, &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>me.toString()</code> &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x454; &#x456;&#x43D;&#x448;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443;.</p>
<p>I&gt; &#x412;&#x441;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x44E;&#x442;&#x44C; <code>Symbol.toStringTag</code> &#x432;&#x456;&#x434; <code>Object.prototype</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x456;&#x43D;&#x430;&#x43A;&#x448;&#x435;. &#x420;&#x44F;&#x434;&#x43E;&#x43A; <code>&quot;Object&quot;</code> &#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x446;&#x456;&#x454;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;.</p>
<p>&#x41D;&#x435;&#x43C;&#x430;&#x454; &#x436;&#x43E;&#x434;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x44C; &#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x43D;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x443; <code>Symbol.toStringTag</code> &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x449;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C;&#x438;. &#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;, &#x43D;&#x456;&#x449;&#x43E; &#x43D;&#x435; &#x437;&#x430;&#x431;&#x43E;&#x440;&#x43E;&#x43D;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;Array&quot;</code> &#x434;&#x43B;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>Symbol.toStringTag</code>, &#x44F;&#x43A; &#x43E;&#x441;&#x44C; &#x442;&#x443;&#x442;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">Person</span>(<span class="hljs-params">name</span>) </span>{
    <span class="hljs-keyword">this</span>.name = name;
}

Person.prototype[<span class="hljs-built_in">Symbol</span>.toStringTag] = <span class="hljs-string">&quot;Array&quot;</span>;

Person.prototype.toString = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.name;
};

<span class="hljs-keyword">let</span> me = <span class="hljs-keyword">new</span> Person(<span class="hljs-string">&quot;Nicholas&quot;</span>);

<span class="hljs-built_in">console</span>.log(me.toString());                         <span class="hljs-comment">// &quot;Nicholas&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.prototype.toString.call(me));    <span class="hljs-comment">// &quot;[object Array]&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>Object.prototype.toString()</code> &#x454; <code>&quot;[object Array]&quot;</code>, &#x442;&#x43E;&#x431;&#x442;&#x43E; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x454; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x436;&#x435;, &#x44F;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x426;&#x435; &#x43F;&#x456;&#x434;&#x43A;&#x440;&#x435;&#x441;&#x43B;&#x44E;&#x454; &#x444;&#x430;&#x43A;&#x442;, &#x449;&#x43E; <code>Object.prototype.toString()</code> &#x43D;&#x435; &#x454; &#x430;&#x431;&#x441;&#x43E;&#x43B;&#x44E;&#x442;&#x43D;&#x43E; &#x43D;&#x430;&#x434;&#x456;&#x439;&#x43D;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x438;&#x43F;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;.</p>
<p>&#x422;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x456;&#x454;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x439;&#x442;&#x435; &#x449;&#x43E;&#x441;&#x44C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>Symbol.toStringTag</code> &#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-built_in">Array</span>.prototype[<span class="hljs-built_in">Symbol</span>.toStringTag] = <span class="hljs-string">&quot;Magic&quot;</span>;

<span class="hljs-keyword">let</span> values = [];

<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.prototype.toString.call(values));    <span class="hljs-comment">// &quot;[object Magic]&quot;</span>
</code></pre>
<p>&#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.toStringTag</code> &#x454; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E;&#x44E; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>Object.prototype.toString()</code> &#x434;&#x430;&#x441;&#x442;&#x44C; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; <code>&quot;[object Magic]&quot;</code>. &#x42F; &#x43D;&#x435; &#x440;&#x430;&#x434;&#x436;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x449;&#x43E;&#x441;&#x44C; &#x443; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x445; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x443; &#x43C;&#x43E;&#x432;&#x456; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43D;&#x456;&#x447;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x430;&#x431;&#x43E;&#x440;&#x43E;&#x43D;&#x438;&#x442;&#x438; &#x432;&#x430;&#x43C; &#x446;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438;.</p>
<h3 id="&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;-symbolunscopables">&#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B; Symbol.unscopables</h3>
<p>&#x41E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>with</code> &#x454; &#x43E;&#x434;&#x43D;&#x456;&#x454;&#x44E; &#x437; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x443;&#x43F;&#x435;&#x440;&#x435;&#x447;&#x43B;&#x438;&#x432;&#x438;&#x445; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D; JavaScript. &#x41E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>with</code> &#x441;&#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x432;&#x441;&#x44F; &#x44F;&#x43A; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x443;&#x43D;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x43A;&#x43E;&#x434;&#x443;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43F;&#x456;&#x437;&#x43D;&#x456;&#x448;&#x435; &#x439;&#x43E;&#x433;&#x43E; &#x43F;&#x456;&#x434;&#x434;&#x430;&#x43B;&#x438; &#x433;&#x43E;&#x441;&#x442;&#x440;&#x456;&#x439; &#x43A;&#x440;&#x438;&#x442;&#x438;&#x446;&#x456; &#x447;&#x435;&#x440;&#x435;&#x437; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x43A;&#x43E;&#x434; &#x43D;&#x430;&#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x456;&#x448;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F;, &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x433;&#x430;&#x43D;&#x443; &#x448;&#x432;&#x438;&#x434;&#x43A;&#x43E;&#x434;&#x456;&#x44E; &#x442;&#x430; &#x43F;&#x440;&#x43E;&#x434;&#x443;&#x43A;&#x443;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;.</p>
<p>&#x412; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;, &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>with</code> &#x437;&#x430;&#x431;&#x43E;&#x440;&#x43E;&#x43D;&#x435;&#x43D;&#x438;&#x439; &#x443; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;; &#x446;&#x435; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x441;&#x442;&#x43E;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x442;&#x430; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;, &#x449;&#x43E; &#x454; &#x443; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x431;&#x435;&#x437; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x438;&#x431;&#x43E;&#x440;&#x443;.</p>
<p>&#x422;&#x43E;&#x434;&#x456;, &#x443; &#x43C;&#x430;&#x439;&#x431;&#x443;&#x442;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>with</code> &#x431;&#x435;&#x437;&#x441;&#x443;&#x43C;&#x43D;&#x456;&#x432;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;, ECMAScript 6 &#x434;&#x43E;&#x441;&#x456; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; <code>with</code> &#x443; &#x43D;&#x435;&#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x434;&#x43B;&#x44F; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x457; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x43E;&#x441;&#x442;&#x456;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x43C;&#x438; &#x43C;&#x430;&#x454;&#x43C;&#x43E; &#x437;&#x43D;&#x430;&#x439;&#x442;&#x438; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x438;, &#x449;&#x43E;&#x431; &#x43A;&#x43E;&#x434;, &#x449;&#x43E; &#x434;&#x43E;&#x441;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; <code>with</code>, &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x432;&#x430;&#x432; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x441;&#x43F;&#x440;&#x430;&#x432;&#x43D;&#x43E;.</p>
<p>&#x429;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435;&#x43C;&#x43E; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> values = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>],
    colors = [<span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span>, <span class="hljs-string">&quot;blue&quot;</span>],
    color = <span class="hljs-string">&quot;black&quot;</span>;

<span class="hljs-keyword">with</span>(colors) {
    push(color);
    push(...values);
}

<span class="hljs-built_in">console</span>.log(colors);    <span class="hljs-comment">// [&quot;red&quot;, &quot;green&quot;, &quot;blue&quot;, &quot;black&quot;, 1, 2, 3]</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x434;&#x432;&#x430; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; <code>push()</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>with</code> &#x454; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43E; <code>colors.push()</code> &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>with</code> &#x434;&#x43E;&#x434;&#x430;&#x454; <code>push</code> &#x44F;&#x43A; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x435; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. <code>color</code> &#x442;&#x430;  <code>values</code> &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;, &#x449;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x456; &#x43F;&#x43E;&#x437;&#x430; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C; <code>with</code>.</p>
<p>&#x41F;&#x440;&#x43E;&#x442;&#x435; ECMAScript 6 &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>values</code>. (&#x41F;&#x440;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>values</code> &#x434;&#x435;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x456;&#x434;&#x435; &#x43C;&#x43E;&#x432;&#x430; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 7, &#xAB;&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x442;&#x430; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;&#xBB;) &#x426;&#x435; &#x431; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x43E;, &#x449;&#x43E; &#x432; &#x43E;&#x442;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x456; ECMAScript 6, <code>values</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>with</code> &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43D;&#x435; &#x43D;&#x430; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; <code>values</code>, &#x430; &#x43D;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; <code>values</code>, &#x456; &#x446;&#x435; &#x437;&#x43B;&#x430;&#x43C;&#x430;&#x454; &#x43A;&#x43E;&#x434;. &#x41E;&#x441;&#x44C; &#x434;&#x43B;&#x44F; &#x447;&#x43E;&#x433;&#x43E; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; <code>Symbol.unscopables</code>.</p>
<p>&#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B; <code>Symbol.unscopables</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; <code>Array.prototype</code> &#x434;&#x43B;&#x44F; &#x456;&#x43D;&#x434;&#x438;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43D;&#x435; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x44C; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>with</code>. &#x41F;&#x440;&#x438; &#x43D;&#x430;&#x44F;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456;, <code>Symbol.unscopables</code> &#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C;, &#x447;&#x438;&#x457; &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x454; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x43C;&#x438;, &#x44F;&#x43A;&#x456; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x456;&#x433;&#x43D;&#x43E;&#x440;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C; <code>with</code>, &#x456; &#x447;&#x438;&#x457; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x440;&#x456;&#x432;&#x43D;&#x456; <code>true</code> &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x43E; &#x431;&#x43B;&#x43E;&#x43A;&#x443;. &#x41E;&#x441;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>Symbol.unscopables</code> &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x454; &#x432; ECMAScript 6 &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;</span>
<span class="hljs-built_in">Array</span>.prototype[<span class="hljs-built_in">Symbol</span>.unscopables] = <span class="hljs-built_in">Object</span>.assign(<span class="hljs-built_in">Object</span>.create(<span class="hljs-literal">null</span>), {
    copyWithin: <span class="hljs-literal">true</span>,
    entries: <span class="hljs-literal">true</span>,
    fill: <span class="hljs-literal">true</span>,
    find: <span class="hljs-literal">true</span>,
    findIndex: <span class="hljs-literal">true</span>,
    keys: <span class="hljs-literal">true</span>,
    values: <span class="hljs-literal">true</span>
});
</code></pre>
<p>&#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>Symbol.unscopables</code> &#x43C;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F; <code>null</code>, &#x449;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x43E;&#x43C; <code>Object.create(null)</code> &#x456; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x432;&#x441;&#x456; &#x43D;&#x43E;&#x432;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x443; ECMAScript 6. (&#x426;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x442;&#x438;&#x43C;&#x443;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 7, &#xAB;&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x442;&#x430; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;&#xBB; &#x442;&#x430; &#x413;&#x43B;&#x430;&#x432;&#x456; 9, &#xAB;&#x41C;&#x430;&#x441;&#x438;&#x432;&#x438;&#xBB;.) &#x414;&#x43B;&#x44F; &#x446;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;, &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>with</code>, &#x43D;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x447;&#x438; &#x441;&#x442;&#x430;&#x440;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x443; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x431;&#x435;&#x437; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;.</p>
<p>&#x417;&#x430;&#x433;&#x430;&#x43B;&#x43E;&#x43C;, &#x432;&#x430;&#x43C; &#x43D;&#x435; &#x441;&#x43B;&#x456;&#x434; &#x437;&#x430;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; <code>Symbol.unscopables</code> &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x448;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x434;&#x43E;&#x43A;&#x438; &#x432;&#x438; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x435; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>with</code> &#x442;&#x430; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x445; &#x443; &#x432;&#x430;&#x448;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;.</p>
<h2 id="&#x43F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;">&#x41F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;</h2>
<p>&#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x2014; &#x446;&#x435; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x442;&#x438;&#x43F; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x443; JavaScript &#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435;&#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x434;&#x43E; &#x44F;&#x43A;&#x438;&#x445; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x431;&#x435;&#x437; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;.</p>
<p>&#x426;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43D;&#x435; &#x454; &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x438;&#x43C;&#x438;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x457;&#x445; &#x432;&#x430;&#x436;&#x447;&#x435; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438;, &#x456; &#x441;&#x430;&#x43C;&#x435; &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x434;&#x43E;&#x431;&#x440;&#x435; &#x43F;&#x456;&#x434;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456;, &#x449;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x454; &#x43F;&#x435;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x456;&#x432;&#x43D;&#x44F; &#x437;&#x430;&#x445;&#x438;&#x441;&#x442;&#x443; &#x432;&#x456;&#x434; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432;.</p>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x43F;&#x438;&#x441;&#x438; &#x434;&#x43B;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;, &#x449;&#x43E; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x435;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x43B;&#x435;&#x433;&#x448;&#x43E;&#x457; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;. &#x406;&#x441;&#x43D;&#x443;&#x454; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x440;&#x435;&#x454;&#x441;&#x442;&#x440; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;, &#x449;&#x43E; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x448;&#x438;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x43C;&#x456;&#x436; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x43C;&#x438; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430;&#x43C;&#x438; &#x432;&#x430;&#x448;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438;&#x445; &#x43E;&#x43F;&#x438;&#x441;&#x456;&#x432;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x43E;&#x434;&#x438;&#x43D; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x437; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x43E;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x44E; &#x443; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x445; &#x43C;&#x456;&#x441;&#x446;&#x44F;&#x445;.</p>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>Object.keys()</code> &#x442;&#x430; <code>Object.getOwnPropertyNames()</code> &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;, &#x434;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x432; ECMAScript 6 &#x431;&#x443;&#x43B;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x43E; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Object.getOwnPropertySymbols()</code>, &#x449;&#x43E; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x43D;&#x43E;&#x441;&#x438;&#x442;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x443; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; <code>Object.defineProperty()</code> &#x442;&#x430; <code>Object.defineProperties()</code>.</p>
<p>&#x414;&#x43E;&#x431;&#x440;&#x435;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x44E;&#x442;&#x44C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x44F;&#x43A;&#x430; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435; &#x431;&#x443;&#x43B;&#x430; &#x432;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x43D;&#x43E; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44C;&#x43E;&#x44E; &#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x456; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442;&#x438;, &#x449;&#x43E; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x44F;&#x43A; &#x43E;&#x442; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.hasInstance</code>. &#x423; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x446;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x440;&#x435;&#x444;&#x456;&#x43A;&#x441; <code>Symbol.</code> &#x442;&#x430; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x440;&#x456;&#x437;&#x43D;&#x43E;&#x43C;&#x430;&#x43D;&#x456;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x430;&#x43C;&#x438;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="05-Destructuring.html" class="navigation navigation-prev " aria-label="Previous page: Глава 5: Деструктурування для легшого доступу до даних">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="07-Sets-And-Maps.html" class="navigation navigation-next " aria-label="Next page: Глава 7: Множини та мапи">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Глава 6: Символи та їх властивості","level":"1.8","depth":1,"next":{"title":"Глава 7: Множини та мапи","level":"1.9","depth":1,"path":"manuscript/07-Sets-And-Maps.md","ref":"manuscript/07-Sets-And-Maps.md","articles":[]},"previous":{"title":"Глава 5: Деструктурування для легшого доступу до даних","level":"1.7","depth":1,"path":"manuscript/05-Destructuring.md","ref":"manuscript/05-Destructuring.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","ga","rss","github-buttons"],"pluginsConfig":{"github":{"url":"https://github.com/LambdaBooks/understandinges6ua"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Рoзуміння ECMAScript 6","description":"Український переклад книги «Understanding ES6».","author":"Denys Dovhan","site_url":"http://understandinges6.denysdovhan.com/","feed_url":"http://understandinges6.denysdovhan.com/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"github-buttons":{"repo":"LambdaBooks/understandinges6ua","types":["star"],"size":"small"},"ga":{"configuration":"auto","token":"UA-40496885-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/LambdaBooks/understandinges6ua/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"manuscript/06-Symbols.md","mtime":"2017-03-13T09:04:15.935Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-13T09:05:41.171Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

