
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Глава 7: Множини та мапи · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="08-Iterators-And-Generators.html" />
    
    
    <link rel="prev" href="06-Symbols.html" />
    

    <link href="http://understandinges6.denysdovhan.com/rss.xml" title="Рoзуміння ECMAScript 6" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Рoзуміння ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-Block-Bindings.html">
            
                <a href="01-Block-Bindings.html">
            
                    
                    Глава 1: Блочне зв’язування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02-Strings-and-Regular-Expressions.html">
            
                <a href="02-Strings-and-Regular-Expressions.html">
            
                    
                    Глава 2: Рядки та регулярні вирази
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03-Functions.html">
            
                <a href="03-Functions.html">
            
                    
                    Глава 3: Функції
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="04-Objects.html">
            
                <a href="04-Objects.html">
            
                    
                    Глава 4: Розширена функціональність об’єктів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="05-Destructuring.html">
            
                <a href="05-Destructuring.html">
            
                    
                    Глава 5: Деструктурування для легшого доступу до даних
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="06-Symbols.html">
            
                <a href="06-Symbols.html">
            
                    
                    Глава 6: Символи та їх властивості
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.9" data-path="07-Sets-And-Maps.html">
            
                <a href="07-Sets-And-Maps.html">
            
                    
                    Глава 7: Множини та мапи
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="08-Iterators-And-Generators.html">
            
                <a href="08-Iterators-And-Generators.html">
            
                    
                    Глава 8: Ітератори та генератори
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="09-Classes.html">
            
                <a href="09-Classes.html">
            
                    
                    Глава 9: Знайомство з класами у JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10-Arrays.html">
            
                <a href="10-Arrays.html">
            
                    
                    Глава 10: Покращені можливості масивів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11-Promises.html">
            
                <a href="11-Promises.html">
            
                    
                    Глава 11: Проміси та асинхронне програмування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" >
            
                <span>
            
                    
                    Глава 12: Проксі та АРІ рефлексії
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" >
            
                <span>
            
                    
                    Глава 13: Інкапсуляція коду через модулі
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" >
            
                <span>
            
                    
                    Додаток А: Дрібніші зміни у ECMAScript 6
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" >
            
                <span>
            
                    
                    Додаток Б: Розуміння ECMAScript 7 (2016)
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Глава 7: Множини та мапи</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;-&#x442;&#x430;-&#x43C;&#x430;&#x43F;&#x438;">&#x41C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x442;&#x430; &#x43C;&#x430;&#x43F;&#x438;</h1>
<p>&#x411;&#x456;&#x43B;&#x44C;&#x448;&#x443; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443; &#x441;&#x432;&#x43E;&#x454;&#x457; &#x456;&#x441;&#x442;&#x43E;&#x440;&#x456;&#x457; JavaScript &#x43C;&#x430;&#x432; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x442;&#x438;&#x43F; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439; &#x2014; &#x442;&#x438;&#x43F; <code>Array</code> (&#x445;&#x43E;&#x447;&#x430; &#x434;&#x435;&#x445;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435; &#x441;&#x442;&#x432;&#x435;&#x440;&#x434;&#x436;&#x443;&#x432;&#x430;&#x442;&#x438;, &#x449;&#x43E; &#x432;&#x441;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;&#x2013;&#x43D;&#x435;&#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x454; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x44F;&#x43C;&#x438; &#x43F;&#x430;&#x440; &#x201C;&#x43A;&#x43B;&#x44E;&#x447;&#x2013;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x201D;, &#x457;&#x445; &#x43F;&#x43B;&#x430;&#x43D;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43E;&#x432;&#x441;&#x456;&#x43C; &#x456;&#x43D;&#x448;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;). &#x41C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; JavaScript &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x432; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432;&#x430;&#x445;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43D;&#x435;&#x434;&#x43E;&#x43B;&#x456;&#x43A;&#x43E;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x43D;&#x43E; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x43C;&#x438; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x44F;&#x43C;&#x438;, &#x431;&#x443;&#x43B;&#x430; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x447;&#x435;&#x440;&#x433; (queues) &#x442;&#x430; &#x441;&#x442;&#x435;&#x43A;&#x456;&#x432; (stacks). &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43B;&#x438;&#x448;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x443; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x430;&#x446;&#x456;&#x44E;, &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;&#x2013;&#x43D;&#x435;&#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x43D;&#x435;&#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x456; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x438;. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x43F;&#x43E;&#x440;&#x43E;&#x434;&#x438;&#x432; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x456; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; (sets) &#x442;&#x430; &#x43C;&#x430;&#x43F; (maps) &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;&#x2013;&#x43D;&#x435;&#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;.</p>
<p><em>&#x41C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430; (set)</em> &#x2014; &#x446;&#x435; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;, &#x449;&#x43E; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x435;&#x43D;&#x44C;. &#x41D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456; &#x437;&#x430;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439; &#x432;&#x430;&#x43C; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x438;&#x445; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x43D;&#x430;&#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x447;&#x430;&#x441;&#x442;&#x456;&#x448;&#x435; &#x454; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x430; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x442;&#x438; &#x447;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x441;&#x443;&#x442;&#x43D;&#x454; &#x432; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456;, &#x447;&#x438; &#x43D;&#x456;. <em>&#x41C;&#x430;&#x43F;&#x430; (map)</em> &#x2014; &#x446;&#x435; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x443; &#x43C;&#x430;&#x43F;&#x456; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x434;&#x432;&#x456; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43A;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445;, &#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x439; &#x43A;&#x43B;&#x44E;&#x447;, &#x437; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x447;&#x438;&#x442;&#x430;&#x442;&#x438;. &#x41C;&#x430;&#x43F;&#x438; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x435;&#x448;&#x443;, &#x434;&#x43B;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445;, &#x44F;&#x43A; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x437;&#x433;&#x43E;&#x434;&#x43E;&#x43C; &#x448;&#x432;&#x438;&#x434;&#x43A;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438;. &#x424;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; ECMAScript 5 &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x442;&#x430; &#x43C;&#x430;&#x43F;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x43E;&#x431;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x44C; &#x446;&#x435; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;&#x2013;&#x43D;&#x435;&#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;.</p>
<p>ECMAScript 6 &#x434;&#x43E;&#x434;&#x430;&#x454; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x442;&#x430; &#x43C;&#x430;&#x43F;&#x438; &#x443; JavaScript &#x456; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456; &#x43F;&#x440;&#x43E; &#x432;&#x441;&#x435;, &#x449;&#x43E; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x437;&#x43D;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E; &#x446;&#x456; &#x434;&#x432;&#x430; &#x442;&#x438;&#x43F;&#x438; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439;.</p>
<p>&#x414;&#x43B;&#x44F; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443;, &#x44F; &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x432;&#x456;&#x43C; &#x43F;&#x440;&#x43E; &#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x448;&#x43B;&#x44F;&#x445;&#x438;, &#x44F;&#x43A;&#x456; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x434;&#x43B;&#x44F; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x442;&#x430; &#x43C;&#x430;&#x43F; &#x434;&#x43E; ECMAScript 6, &#x456; &#x447;&#x43E;&#x43C;&#x443; &#x446;&#x456; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x43C;&#x430;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438;. &#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x44F; &#x43F;&#x43E;&#x43A;&#x430;&#x436;&#x443;, &#x44F;&#x43A; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x442;&#x430; &#x43C;&#x430;&#x43F;&#x438; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x443; ECMAScript 6.</p>
<h2 id="&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;-&#x442;&#x430;-&#x43C;&#x430;&#x43F;&#x438;-&#x443;-ecmascript-5">&#x41C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x442;&#x430; &#x43C;&#x430;&#x43F;&#x438; &#x443; ECMAScript 5</h2>
<p>&#x423; ECMAScript 5 &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x456;&#x43C;&#x456;&#x442;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x442;&#x430; &#x43C;&#x430;&#x43F;&#x438; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-built_in">Object</span>.create(<span class="hljs-literal">null</span>);

set.foo = <span class="hljs-literal">true</span>;

<span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x430; &#x43D;&#x430; &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</span>
<span class="hljs-keyword">if</span> (set.foo) {

    <span class="hljs-comment">// &#x449;&#x43E;&#x441;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x43C;&#x43E;</span>
}
</code></pre>
<p>&#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>set</code>, &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C; &#x437; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x43E;&#x43C; <code>null</code>, &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x436;&#x43E;&#x434;&#x43D;&#x438;&#x445; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438; &#x454; &#x437;&#x432;&#x438;&#x447;&#x43D;&#x43E;&#x44E; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x43A;&#x43E;&#x44E; &#x443; ECMAScript 5. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>set</code>, &#x457;&#x439; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>true</code>, &#x442;&#x43E;&#x43C;&#x443; &#x443;&#x43C;&#x43E;&#x432;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; (&#x44F;&#x43A; &#x43E;&#x442; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>if</code> &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;) &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x442;&#x438;, &#x447;&#x438; &#x446;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x436;&#x435; &#x454; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456;.</p>
<p>&#x404;&#x434;&#x438;&#x43D;&#x430; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x456;&#x436; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430; &#x442;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x43C;&#x430;&#x43F;&#x430; &#x443; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x456;, &#x44F;&#x43A;&#x435; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;. &#x414;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;, &#x446;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x44F;&#x43A; &#x43C;&#x430;&#x43F;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> map = <span class="hljs-built_in">Object</span>.create(<span class="hljs-literal">null</span>);

map.foo = <span class="hljs-string">&quot;bar&quot;</span>;

<span class="hljs-comment">// &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;</span>
<span class="hljs-keyword">let</span> value = map.foo;

<span class="hljs-built_in">console</span>.log(value);         <span class="hljs-comment">// &quot;bar&quot;</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;bar&quot;</code> &#x43F;&#x456;&#x434; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C; <code>foo</code>. &#x41D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;, &#x43C;&#x430;&#x43F;&#x438; &#x447;&#x430;&#x441;&#x442;&#x456;&#x448;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x457;, &#x43D;&#x456;&#x436; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438; &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432;.</p>
<h2 id="&#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438;-&#x437;-&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x43C;&#x438;-&#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44F;&#x43C;&#x438;">&#x41F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438; &#x437; &#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x43C;&#x438; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44F;&#x43C;&#x438;</h2>
<p>&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x442;&#x430; &#x43C;&#x430;&#x43F; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x434;&#x43E;&#x431;&#x440;&#x435; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x456;&#x432;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x43C;&#x43E;&#x436;&#x435; &#x441;&#x442;&#x430;&#x442;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x438;&#x43C;, &#x44F;&#x43A; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x438; &#x437;&#x430;&#x433;&#x43B;&#x438;&#x431;&#x438;&#x442;&#x435;&#x441;&#x44C; &#x443; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x441;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x431;&#x443;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438;, &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x435;&#x432;&#x43D;&#x456;, &#x449;&#x43E; &#x434;&#x432;&#x430; &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x456; &#x442;&#x438;&#x43C; &#x436;&#x435; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x43C;. &#x420;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> map = <span class="hljs-built_in">Object</span>.create(<span class="hljs-literal">null</span>);

map[<span class="hljs-number">5</span>] = <span class="hljs-string">&quot;foo&quot;</span>;

<span class="hljs-built_in">console</span>.log(map[<span class="hljs-string">&quot;5&quot;</span>]);      <span class="hljs-comment">// &quot;foo&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;foo&quot;</code> &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x43A;&#x43B;&#x44E;&#x447;&#x443; <code>5</code>. &#x412;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44C;&#x43E;, &#x446;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x442;&#x43E;&#x43C;&#x443; <code>map[&quot;5&quot;]</code> &#x442;&#x430; <code>map[5]</code> &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x442;&#x438;&#x43C;&#x443;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43E;&#x434;&#x43D;&#x443; &#x456; &#x442;&#x443; &#x436; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;. &#x422;&#x430;&#x43A;&#x430; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44F; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x43C;&#x43E;&#x436;&#x435; &#x441;&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x438;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x437;&#x430;&#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x456; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x456;, &#x456; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x432;&#x43E;&#x434;&#x43D;&#x43E;&#x447;&#x430;&#x441;. &#x406;&#x43D;&#x448;&#x430; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x432;&#x438;&#x43D;&#x438;&#x43A;&#x430;&#x454; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> map = <span class="hljs-built_in">Object</span>.create(<span class="hljs-literal">null</span>),
    key1 = {},
    key2 = {};

map[key1] = <span class="hljs-string">&quot;foo&quot;</span>;

<span class="hljs-built_in">console</span>.log(map[key2]);     <span class="hljs-comment">// &quot;foo&quot;</span>
</code></pre>
<p>&#x422;&#x443;&#x442; <code>map[key2]</code> &#x442;&#x430; <code>map[key1]</code> &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; <code>key1</code> &#x442;&#x430; <code>key2</code> &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>&quot;[object Object]&quot;</code> &#x454; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x43C; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x44F;&#x43A; <code>key1</code>, &#x442;&#x430;&#x43A; &#x456; <code>key2</code> &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x446;&#x435;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;. &#x426;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x441;&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x438;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x447;&#x435;&#x440;&#x435;&#x437; &#x441;&#x432;&#x43E;&#x44E; &#x43D;&#x435;&#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x456;&#x441;&#x442;&#x44C;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x43B;&#x43E;&#x433;&#x456;&#x447;&#x43D;&#x43E; &#x43F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x438;, &#x449;&#x43E; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;&#x2013;&#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x43C;&#x430;&#x43B;&#x438; &#x431; &#x431;&#x443;&#x442;&#x438; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x43C;&#x438;.</p>
<p>&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x443;&#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x44E;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432;. (&#x422;&#x430;&#x43A;&#x430; &#x436; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x432;&#x438;&#x43D;&#x438;&#x43A;&#x430;&#x454; &#x43F;&#x440;&#x438; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;.)</p>
<p>&#x41C;&#x430;&#x43F;&#x438; &#x437; &#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x43C;&#x438;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x44F;&#x43A;&#x438;&#x445; &#x454; &#x445;&#x438;&#x431;&#x43D;&#x438;&#x43C;&#x438;, &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x443; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443;. &#x425;&#x438;&#x431;&#x43D;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; false &#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x430;&#x445;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x435; &#x431;&#x443;&#x43B;&#x435;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A; &#x43E;&#x442; &#x432; &#x443;&#x43C;&#x43E;&#x432;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>if</code>. &#x422;&#x430;&#x43A;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x454; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x43E;&#x44E;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x430;&#x43C; &#x441;&#x43B;&#x456;&#x434; &#x431;&#x443;&#x442;&#x438; &#x43E;&#x431;&#x435;&#x440;&#x435;&#x436;&#x43D;&#x438;&#x43C;&#x438; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43F;&#x43E;&#x434;&#x438;&#x432;&#x456;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> map = <span class="hljs-built_in">Object</span>.create(<span class="hljs-literal">null</span>);

map.count = <span class="hljs-number">1</span>;

<span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x430; &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &quot;count&quot;, &#x447;&#x438; &#x43D;&#x435;&#x43D;&#x443;&#x43B;&#x44C;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;?</span>
<span class="hljs-keyword">if</span> (map.count) {
    <span class="hljs-comment">// ...</span>
}
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43C;&#x430;&#x454; &#x434;&#x435;&#x44F;&#x43A;&#x443; &#x43D;&#x435;&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x43D;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x441;&#x43B;&#x456;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>map.count</code>. &#x41E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>if</code> &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438; &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; <code>map.count</code>, &#x447;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x446;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x430;&#x454; &#x43D;&#x435;&#x43D;&#x443;&#x43B;&#x44C;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;? &#x41A;&#x43E;&#x434; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>if</code> &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; 1 &#x454; &#x456;&#x441;&#x442;&#x438;&#x43D;&#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x44F;&#x43A;&#x449;&#x43E; &#x431; <code>map.count</code> &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x432;&#x430;&#x43B;&#x43E; 0, &#x430;&#x431;&#x43E; &#x44F;&#x43A;&#x449;&#x43E; &#x431; <code>map.count</code> &#x43D;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x43B;&#x43E;, &#x43A;&#x43E;&#x434; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>if</code> &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x441;&#x44F; &#x431;&#x438;.</p>
<p>&#x426;&#x456; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438; &#x432;&#x430;&#x436;&#x43A;&#x43E; &#x43F;&#x43E;&#x43C;&#x456;&#x442;&#x438;&#x442;&#x438; &#x442;&#x430; &#x43F;&#x43E;&#x43B;&#x430;&#x433;&#x43E;&#x434;&#x438;&#x442;&#x438; &#x443; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x438;&#x445; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x430;&#x445; &#x456; &#x446;&#x435; &#x43E;&#x434;&#x43D;&#x430; &#x437; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;, &#x447;&#x43E;&#x43C;&#x443; ECMAScript 6 &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x443; &#x43C;&#x43E;&#x432;&#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x442;&#x430; &#x43C;&#x430;&#x43F;&#x438;.</p>
<p>I&gt; JavaScript &#x43C;&#x430;&#x454; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>in</code>, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>true</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456; &#x431;&#x435;&#x437; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x439;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>in</code> &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x448;&#x443;&#x43A;&#x430;&#x454; &#x437;&#x430; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x43E;&#x43C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;, &#x449;&#x43E; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x439;&#x43E;&#x433;&#x43E; &#x43D;&#x435;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x43E;&#x43C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; &#x43D;&#x435; &#x454; <code>null</code>. &#x425;&#x43E;&#x447;&#x430; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x442;&#x430;&#x43A; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x437; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x447;&#x430;&#x441;&#x442;&#x456;&#x448;&#x435; &#x43D;&#x456;&#x436; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>in</code>.</p>
<h2 id="&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;-sets-&#x443;-ecmascript-6">&#x41C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; (Sets) &#x443; ECMAScript 6</h2>
<p>ECMAScript 6 &#x434;&#x43E;&#x434;&#x430;&#x454; &#x442;&#x438;&#x43F; <code>Set</code>, &#x449;&#x43E; &#x432;&#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x454; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x431;&#x435;&#x437; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x435;&#x43D;&#x44C;. &#x41C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x434;&#x430;&#x44E;&#x442;&#x44C; &#x448;&#x432;&#x438;&#x434;&#x43A;&#x438;&#x439; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x434;&#x430;&#x43D;&#x438;&#x445;, &#x44F;&#x43A;&#x456; &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C;, &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x447;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x435;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x43E;&#x43F;&#x435;&#x440;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x438;&#x441;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;.</p>
<h3 id="&#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;-&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;-&#x442;&#x430;-&#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;">&#x421;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x442;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;</h3>
<p>Sets &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; <code>new Set()</code>, &#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>add()</code> &#x434;&#x43E;&#x434;&#x430;&#x454; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x443; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x434;&#x438;&#x432;&#x438;&#x442;&#x438;&#x441;&#x44C;, &#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430; &#x447;&#x435;&#x440;&#x435;&#x437; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44C; <code>size</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>();
set.add(<span class="hljs-number">5</span>);
set.add(<span class="hljs-string">&quot;5&quot;</span>);

<span class="hljs-built_in">console</span>.log(set.size);    <span class="hljs-comment">// 2</span>
</code></pre>
<p>&#x41C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x43D;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x438; &#x432;&#x43E;&#x43D;&#x438; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x456;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430; &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x44F;&#x43A; &#x456; &#x447;&#x438;&#x441;&#x43B;&#x43E; <code>5</code>, &#x442;&#x430;&#x43A; &#x456; &#x440;&#x44F;&#x434;&#x43E;&#x43A; <code>&quot;5&quot;</code> &#x44F;&#x43A; &#x434;&#x432;&#x430; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x445; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;. (&#x412;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44C;&#x43E;, &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x43D;&#x43D;&#x44F; &#x434;&#x432;&#x43E;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x43D;&#x430; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x447;&#x43D;&#x456;&#x441;&#x442;&#x44C;  &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Object.is()</code>, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x438; &#x43E;&#x431;&#x433;&#x43E;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x43B;&#x438; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 4) &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x443;, &#x456; &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x438;&#x43C;&#x438; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>(),
    key1 = {},
    key2 = {};

set.add(key1);
set.add(key2);

<span class="hljs-built_in">console</span>.log(set.size);    <span class="hljs-comment">// 2</span>
</code></pre>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>key1</code> &#x442;&#x430; <code>key2</code> &#x43D;&#x435; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x438;, &#x432;&#x43E;&#x43D;&#x438; &#x432;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x432;&#x43E;&#x43C;&#x430; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;. (&#x41F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x430;&#x439;&#x442;&#x435;, &#x44F;&#x43A;&#x449;&#x43E; &#x431; <code>key1</code> &#x442;&#x430; <code>key2</code> &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x438;, &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x431;&#x438; &#x440;&#x456;&#x432;&#x43D;&#x456; <code>&quot;[Object object]&quot;</code>.)</p>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>add()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x456; &#x442;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;, &#x432;&#x441;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x456;&#x433;&#x43D;&#x43E;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>();
set.add(<span class="hljs-number">5</span>);
set.add(<span class="hljs-string">&quot;5&quot;</span>);
set.add(<span class="hljs-number">5</span>);     <span class="hljs-comment">// &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; - &#x432;&#x43E;&#x43D;&#x43E; &#x456;&#x433;&#x43D;&#x43E;&#x440;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;</span>

<span class="hljs-built_in">console</span>.log(set.size);    <span class="hljs-comment">// 2</span>
</code></pre>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x443; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x456; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Set</code> &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x442;&#x44C;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x43B;&#x438;&#x448;&#x435; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>, <span class="hljs-number">5</span>, <span class="hljs-number">5</span>, <span class="hljs-number">5</span>]);
<span class="hljs-built_in">console</span>.log(set.size);    <span class="hljs-comment">// 5</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;. &#x427;&#x438;&#x441;&#x43B;&#x43E; <code>5</code> &#x437;&#x2019;&#x44F;&#x432;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x440;&#x430;&#x437;, &#x445;&#x43E;&#x447;&#x430; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x432;&#x43E;&#x43D;&#x43E; &#x437;&#x443;&#x441;&#x442;&#x440;&#x456;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x447;&#x43E;&#x442;&#x438;&#x440;&#x438; &#x440;&#x430;&#x437;&#x438;. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443;, &#x430;&#x431;&#x43E; JSON&#x2013;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;.</p>
<p>I&gt; &#x41A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Set</code> &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;. &#x41C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;, &#x44F;&#x43A; &#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x442;&#x430; &#x43C;&#x430;&#x43F;&#x438;. &#x41A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Set</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x449;&#x43E;&#x431; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;. (&#x41F;&#x440;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x442;&#x430; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43F;&#x456;&#x434;&#x435; &#x43C;&#x43E;&#x432;&#x430; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 8.)</p>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x442;&#x438;, &#x447;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x454; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>has()</code>, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>();
set.add(<span class="hljs-number">5</span>);
set.add(<span class="hljs-string">&quot;5&quot;</span>);

<span class="hljs-built_in">console</span>.log(set.has(<span class="hljs-number">5</span>));    <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(set.has(<span class="hljs-number">6</span>));    <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x422;&#x443;&#x442; <code>set.has(6)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; false, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430; &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<h3 id="&#x432;&#x438;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;-&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;">&#x412;&#x438;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;</h3>
<p>&#x422;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x438;&#x442;&#x438; &#x43E;&#x434;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>delete()</code>, &#x430;&#x431;&#x43E; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x438;&#x442;&#x438; &#x432;&#x441;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x43E;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>clear()</code>. &#x41E;&#x441;&#x44C; &#x44F;&#x43A; &#x432;&#x43E;&#x43D;&#x438; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>();
set.add(<span class="hljs-number">5</span>);
set.add(<span class="hljs-string">&quot;5&quot;</span>);

<span class="hljs-built_in">console</span>.log(set.has(<span class="hljs-number">5</span>));    <span class="hljs-comment">// true</span>

set.delete(<span class="hljs-number">5</span>);

<span class="hljs-built_in">console</span>.log(set.has(<span class="hljs-number">5</span>));    <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(set.size);      <span class="hljs-comment">// 1</span>

set.clear();

<span class="hljs-built_in">console</span>.log(set.has(<span class="hljs-string">&quot;5&quot;</span>));  <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(set.size);      <span class="hljs-comment">// 0</span>
</code></pre>
<p>&#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>delete()</code>, &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>5</code>; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>clear()</code>, &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430;<code>set</code> &#x441;&#x442;&#x430;&#x454; &#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x44C;&#x43E;&#x44E;.</p>
<p>&#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x437; &#x43D;&#x438;&#x445; &#x434;&#x430;&#x454; &#x43D;&#x430;&#x43C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x439; &#x43C;&#x435;&#x445;&#x430;&#x43D;&#x456;&#x437;&#x43C; &#x434;&#x43B;&#x44F; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439; &#x43D;&#x430;&#x434; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x432;&#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x449;&#x43E; &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x443;, &#x430; &#x442;&#x43E;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x44F;&#x43A;&#x443;&#x441;&#x44C; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44E; &#x43D;&#x430;&#x434; &#x43A;&#x43E;&#x436;&#x43D;&#x438;&#x43C; &#x437; &#x43D;&#x438;&#x445;? &#x421;&#x430;&#x43C;&#x435; &#x434;&#x43B;&#x44F; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; &#x43D;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x435;&#x43D; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>forEach()</code>.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-foreach-&#x434;&#x43B;&#x44F;-&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;">&#x41C;&#x435;&#x442;&#x43E;&#x434; forEach() &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;</h3>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;&#x442;&#x435; &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438;, &#x441;&#x43A;&#x43E;&#x440;&#x456;&#x448; &#x437;&#x430; &#x432;&#x441;&#x435; &#x432;&#x438; &#x432;&#x436;&#x435; &#x437;&#x43D;&#x430;&#x439;&#x43E;&#x43C;&#x456; &#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43C; <code>forEach()</code>. ECMAScript 5 &#x434;&#x43E;&#x434;&#x430;&#x432; <code>forEach()</code> &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x449;&#x43E;&#x431; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x43D;&#x430;&#x434; &#x43A;&#x43E;&#x436;&#x43D;&#x438;&#x43C;&#x438; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x431;&#x435;&#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x446;&#x438;&#x43A;&#x43B;&#x443; <code>for</code>. &#x41C;&#x435;&#x442;&#x43E;&#x434; &#x441;&#x442;&#x430;&#x432; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x43C; &#x441;&#x435;&#x440;&#x435;&#x434; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432;, &#x456; &#x442;&#x43E;&#x43C;&#x443; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x441;&#x430;&#x43C;&#x438;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x442;&#x430; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x436;&#x435; &#x447;&#x438;&#x43D;&#x43E;&#x43C;.</p>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>forEach()</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x442;&#x440;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;:</p>
<ol>
<li>&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x457; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x457; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456;;</li>
<li>&#x442;&#x435; &#x441;&#x430;&#x43C;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x456; &#x443; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x43C;&#x443; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;;</li>
<li>&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x443;, &#x437; &#x44F;&#x43A;&#x43E;&#x457; &#x447;&#x438;&#x442;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;.</li>
</ol>
<p>&#x414;&#x438;&#x432;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x456;&#x436; &#x432;&#x435;&#x440;&#x441;&#x456;&#x454;&#x44E; <code>forEach()</code> &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x442;&#x430; &#x432;&#x435;&#x440;&#x441;&#x456;&#x454;&#x44E; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x43F;&#x43E;&#x43B;&#x44F;&#x433;&#x430;&#x454; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x442;&#x430; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x454; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438;&#x43C;&#x438;. &#x426;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x442;&#x438; &#x44F;&#x43A; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x454; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x435; &#x43F;&#x43E;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430;&#x43A;&#x43E;&#x457; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x438;.</p>
<p>&#x406;&#x43D;&#x448;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;, &#x449;&#x43E; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>forEach()</code> (&#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x442;&#x430; &#x43C;&#x430;&#x43F;&#x438;) &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x43E; &#x442;&#x440;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x443; &#x441;&#x432;&#x43E;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x43C; &#x434;&#x432;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x442;&#x430; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x43F; &#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x442;&#x430; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C; (&#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x43C; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x43E;&#x43C; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x445;).</p>
<p>&#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x43D;&#x435; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432;. &#x41B;&#x44E;&#x434;&#x438;, &#x449;&#x43E; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x43B;&#x438; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442; ECMAScript 6 &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x432; <code>forEach()</code> &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x43B;&#x430; &#x431; &#x434;&#x432;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x446;&#x435; &#x432;&#x43E;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x43B;&#x430;&#x441;&#x44F; &#x431; &#x432;&#x456;&#x434; &#x434;&#x432;&#x43E;&#x445; &#x456;&#x43D;&#x448;&#x438;&#x445;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x432;&#x43E;&#x43D;&#x438; &#x437;&#x43D;&#x430;&#x439;&#x448;&#x43B;&#x438; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x437;&#x431;&#x435;&#x440;&#x435;&#x433;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x43E;&#x44E; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445;, &#x456; &#x449;&#x43E;&#x431; &#x432;&#x43E;&#x43D;&#x430; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x43B;&#x430; &#x442;&#x440;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;: &#x43A;&#x43E;&#x436;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x43A;&#x43B;&#x44E;&#x447; &#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x434;&#x43D;&#x43E;&#x447;&#x430;&#x441;&#x43D;&#x43E;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x442;&#x430; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x443; <code>forEach()</code> &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x456;, &#x449;&#x43E;&#x431; &#x437;&#x431;&#x435;&#x440;&#x435;&#x433;&#x442;&#x438; &#x457;&#x445;&#x43D;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x456;&#x43B;&#x456;&#x441;&#x43D;&#x43E;&#x44E; &#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438; <code>forEach()</code> &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x442;&#x430; &#x43C;&#x430;&#x43F;.</p>
<p>&#x41A;&#x440;&#x456;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;, &#x432;&#x441;&#x435; &#x456;&#x43D;&#x448;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x443; <code>forEach()</code> &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x41E;&#x441;&#x44C; &#x442;&#x440;&#x43E;&#x448;&#x43A;&#x438; &#x43A;&#x43E;&#x434;&#x443;, &#x449;&#x43E; &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x454; &#x446;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x443; &#x434;&#x456;&#x457;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>]);

set.forEach(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value, key, ownerSet</span>) </span>{
    <span class="hljs-built_in">console</span>.log(key + <span class="hljs-string">&quot; &quot;</span> + value);
    <span class="hljs-built_in">console</span>.log(ownerSet === set);
});
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x456;&#x442;&#x435;&#x440;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x43C;&#x443; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x442;&#x430; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>forEach()</code>. &#x429;&#x43E;&#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, <code>key</code> &#x442;&#x430; <code>value</code> &#x454; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x456;, &#x430; <code>ownerSet</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454; <code>set</code>. &#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;:</p>
<pre><code>1 1
true
2 2
true
</code></pre><p>&#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>this</code> &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x432; <code>forEach()</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>this</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>]);

<span class="hljs-keyword">let</span> processor = {
    output(value) {
        <span class="hljs-built_in">console</span>.log(value);
    },
    process(dataSet) {
        dataSet.forEach(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
            <span class="hljs-keyword">this</span>.output(value);
        }, <span class="hljs-keyword">this</span>);
    }
};

processor.process(set);
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>processor.process()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; <code>forEach()</code> &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x442;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454; <code>this</code> &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>this</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;. &#x426;&#x435; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E;, &#x449;&#x43E;&#x431; <code>this.output()</code> &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x432;&#x441;&#x44F; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>processor.output()</code>. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>forEach()</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43B;&#x438;&#x448;&#x435; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;, <code>value</code>, &#x442;&#x43E;&#x43C;&#x443; &#x456;&#x43D;&#x448;&#x456; &#x443;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F;. &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; arrow&#x2013;&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x449;&#x43E;&#x431; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x442;&#x43E;&#x439; &#x436;&#x435; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x431;&#x435;&#x437; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x456; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>]);

<span class="hljs-keyword">let</span> processor = {
    output(value) {
        <span class="hljs-built_in">console</span>.log(value);
    },
    process(dataSet) {
        dataSet.forEach((value) =&gt; <span class="hljs-keyword">this</span>.output(value));
    }
};

processor.process(set);
</code></pre>
<p>&#x410;rrow&#x2014;&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x447;&#x438;&#x442;&#x430;&#x454; <code>this</code> &#x437; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; <code>process()</code>, &#x443; &#x44F;&#x43A;&#x456;&#x439; &#x432;&#x43E;&#x43D;&#x430; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F;, &#x442;&#x43E;&#x43C;&#x443; <code>this.output()</code> &#x43C;&#x430;&#x454; &#x43A;&#x43E;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>processor.output()</code>.</p>
<p>&#x417;&#x430;&#x43F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x430;&#x439;&#x442;&#x435;, &#x449;&#x43E; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x437;&#x440;&#x443;&#x447;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x430; <code>forEach()</code> &#x434;&#x430;&#x454; &#x432;&#x430;&#x43C; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x43A;&#x43E;&#x436;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x43E;&#x447;&#x435;&#x440;&#x433;&#x43E;&#x432;&#x43E;, &#x430;&#x43B;&#x435; &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x434;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x437;&#x430; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x43E;&#x43C; &#x442;&#x430;&#x43A;, &#x44F;&#x43A; &#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438;. &#x42F;&#x43A;&#x449;&#x43E; &#x446;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E;, &#x442;&#x43E;&#x434;&#x456; &#x43D;&#x430;&#x439;&#x43A;&#x440;&#x430;&#x449;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x443; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;.</p>
<h3 id="&#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;-&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;-&#x443;-&#x43C;&#x430;&#x441;&#x438;&#x432;">&#x41F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;</h3>
<p>&#x41B;&#x435;&#x433;&#x43A;&#x43E; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x443;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Set</code>. &#x422;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x443; &#x43D;&#x430;&#x437;&#x430;&#x434; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; (spread operator). &#x413;&#x43B;&#x430;&#x432;&#x430; 3 &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x43B;&#x430; &#x43F;&#x440;&#x43E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; (<code>...</code>) &#x44F;&#x43A; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x440;&#x43E;&#x437;&#x431;&#x438;&#x442;&#x438; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x432; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;. &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438;, &#x44F;&#x43A; &#x43E;&#x442; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430;&#x43C;&#x438;, &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x457;&#x445; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">3</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>]),
    array = [...set];

<span class="hljs-built_in">console</span>.log(array);             <span class="hljs-comment">// [1,2,3,4,5]</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430;. &#x41C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;, &#x430; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x432;&#x43E;&#x43D;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443;. &#x41C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430;, &#x441;&#x430;&#x43C;&#x430; &#x43F;&#x43E; &#x441;&#x43E;&#x431;&#x456;, &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x442;&#x438; &#x442;&#x456; &#x441;&#x430;&#x43C;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;, &#x44F;&#x43A;&#x456; &#x432;&#x43E;&#x43D;&#x430; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43B;&#x430; &#x43F;&#x440;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x456; (<code>1</code>, <code>2</code>, <code>3</code>, <code>4</code> &#x442;&#x430; <code>5</code>). &#x412;&#x43E;&#x43D;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;.</p>
<p>&#x422;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x439;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x432;&#x436;&#x435; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x456; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x449;&#x43E; &#x43D;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x435;&#x43D;&#x44C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">eliminateDuplicates</span>(<span class="hljs-params">items</span>) </span>{
    <span class="hljs-keyword">return</span> [...new <span class="hljs-built_in">Set</span>(items)];
}

<span class="hljs-keyword">let</span> numbers = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">3</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>],
    noDuplicates = eliminateDuplicates(numbers);

<span class="hljs-built_in">console</span>.log(noDuplicates);      <span class="hljs-comment">// [1,2,3,4,5]</span>
</code></pre>
<p>&#x423; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; <code>eliminateDuplicates()</code>, &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430; &#x442;&#x438;&#x43C;&#x447;&#x430;&#x441;&#x43E;&#x432;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x444;&#x456;&#x43B;&#x44C;&#x442;&#x440;&#x430;&#x446;&#x456;&#x457; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x435;&#x43D;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x449;&#x43E; &#x43D;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x435;&#x43D;&#x44C;.</p>
<h3 id="&#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456;-&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;-weak-sets">&#x421;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; (Weak Sets)</h3>
<p>&#x422;&#x438;&#x43F; <code>Set</code> &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x449;&#x435; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x44E; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x43E;&#x44E; (strong set) &#x447;&#x435;&#x440;&#x435;&#x437; &#x442;&#x435;, &#x44F;&#x43A; &#x432;&#x43E;&#x43D;&#x430; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;. &#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x456; <code>Set</code> &#x456; &#x446;&#x435; &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435;, &#x449;&#x43E; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439;. &#x414;&#x43E;&#x43F;&#x43E;&#x43A;&#x438; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x443; <code>Set</code> &#x456;&#x441;&#x43D;&#x443;&#x454;, &#x437;&#x431;&#x438;&#x440;&#x430;&#x447; &#x441;&#x43C;&#x456;&#x442;&#x442;&#x44F; &#x43D;&#x435; &#x447;&#x456;&#x43F;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x446;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;, &#x449;&#x43E;&#x431; &#x437;&#x432;&#x456;&#x43B;&#x44C;&#x43D;&#x438;&#x442;&#x438; &#x43F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x44C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>(),
    key = {};

set.add(key);
<span class="hljs-built_in">console</span>.log(set.size);      <span class="hljs-comment">// 1</span>

<span class="hljs-comment">// &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454;&#x43C;&#x43E; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x435; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;</span>
key = <span class="hljs-literal">null</span>;

<span class="hljs-built_in">console</span>.log(set.size);      <span class="hljs-comment">// 1</span>

<span class="hljs-comment">// &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454;&#x43C;&#x43E; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x435; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;</span>
key = [...set][<span class="hljs-number">0</span>];
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; <code>key</code> &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>null</code> &#x43E;&#x447;&#x438;&#x449;&#x443;&#x454; &#x43E;&#x434;&#x43D;&#x435; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>key</code>, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x456;&#x43D;&#x448;&#x435; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; <code>set</code>. &#x412;&#x438; &#x434;&#x43E;&#x441;&#x456; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; <code>key</code> &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x456;&#x457; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x442;&#x430; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43F;&#x456;&#x434;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;, &#x430;&#x43B;&#x435; &#x447;&#x430;&#x441;&#x43E;&#x43C; &#x43A;&#x440;&#x430;&#x449;&#x435;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456; &#x437;&#x43D;&#x438;&#x43A;&#x430;&#x43B;&#x438;, &#x44F;&#x43A;&#x449;&#x43E; &#x437;&#x43D;&#x438;&#x43A;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x441;&#x456; &#x456;&#x43D;&#x448;&#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;. &#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x448; JavaScript&#x2013;&#x43A;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x432;&#x435;&#x431;&#x2013;&#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x446;&#x456; &#x456; &#x43C;&#x430;&#x454; &#x441;&#x43B;&#x456;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x432; DOM, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x456; &#x456;&#x43D;&#x448;&#x438;&#x43C; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x43E;&#x43C;, &#x432;&#x430;&#x43C; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E;, &#x449;&#x43E;&#x431; &#x432;&#x430;&#x448; &#x43A;&#x43E;&#x434; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x432; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x454; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; DOM&#x2013;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;. (&#x422;&#x430;&#x43A;&#x430; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x456;&#x44F; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <em>&#x432;&#x438;&#x442;&#x43E;&#x43A;&#x43E;&#x43C; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x456; (memory leak)</em>.)</p>
<p>&#x414;&#x43B;&#x44F; &#x432;&#x438;&#x440;&#x456;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C; ECMAScript 6 &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x454; <em>&#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; (weak sets)</em>, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x456; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;. <em>&#x421;&#x43B;&#x430;&#x431;&#x43A;&#x435; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; (weak reference)</em> &#x43D;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43D;&#x435; &#x437;&#x443;&#x43F;&#x438;&#x43D;&#x44F;&#x454; &#x437;&#x431;&#x456;&#x440; &#x441;&#x43C;&#x456;&#x442;&#x442;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x43E; &#x454; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x43C; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43D;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;, &#x449;&#x43E; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x438;&#x43B;&#x43E;&#x441;&#x44C;.</p>
<h4 id="&#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;-&#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445;-&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;">&#x421;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;</h4>
<p>&#x421;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; <code>WeakSet</code> &#x456; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>add()</code>, <code>has()</code> &#x442;&#x430; <code>delete()</code>. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x432;&#x43E;&#x43D;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">WeakSet</span>(),
    key = {};

<span class="hljs-comment">// &#x434;&#x43E;&#x434;&#x430;&#x454;&#x43C;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x443;</span>
set.add(key);

<span class="hljs-built_in">console</span>.log(set.has(key));      <span class="hljs-comment">// true</span>

set.delete(key);

<span class="hljs-built_in">console</span>.log(set.has(key));      <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x43E;&#x457; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x434;&#x443;&#x436;&#x435; &#x441;&#x445;&#x43E;&#x436;&#x435; &#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E;&#x457;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438;, &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x442;&#x438; &#x442;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x442;&#x438;, &#x447;&#x438; &#x454; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x443; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456;&#x439; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456;. &#x422;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x443; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x448;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x443; &#x457;&#x457; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> key1 = {},
    key2 = {},
    set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">WeakSet</span>([key1, key2]);

<span class="hljs-built_in">console</span>.log(set.has(key1));     <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(set.has(key2));     <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>WeakSet</code> &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x446;&#x435;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x434;&#x432;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;, &#x446;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x443;. &#x417;&#x430;&#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x430;&#x439;&#x442;&#x435;, &#x449;&#x43E; &#x44F;&#x43A;&#x449;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438;&#x43C;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x2013;&#x43D;&#x435;&#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;, &#x431;&#x443;&#x434;&#x435; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; <code>WeakSet</code> &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;.</p>
<h4 id="&#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x456;-&#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x456;-&#x43C;&#x456;&#x436;-&#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438;-&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;">&#x41A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x456; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x456;&#x436; &#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;</h4>
<p>&#x41D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x456;&#x436; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x43C;&#x438; &#x442;&#x430; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x43C;&#x438; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430;&#x43C;&#x438; &#x446;&#x435; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x432;&#x2019;&#x44F;&#x437;&#x430;&#x43D;&#x456; &#x434;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x449;&#x43E; &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x454; &#x446;&#x44E; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">WeakSet</span>(),
    key = {};

<span class="hljs-comment">// &#x434;&#x43E;&#x434;&#x430;&#x454;&#x43C;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x443;</span>
set.add(key);

<span class="hljs-built_in">console</span>.log(set.has(key));      <span class="hljs-comment">// true</span>

<span class="hljs-comment">// &#x432;&#x438;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; key &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454; &#x439;&#x43E;&#x433;&#x43E; &#x437; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x43E;&#x457; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;</span>
key = <span class="hljs-literal">null</span>;
</code></pre>
<p>&#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443;, &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; <code>key</code> &#x443; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456;&#x439; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C;. &#x41D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x442;&#x438; &#x446;&#x435; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x430;&#x43C; &#x431;&#x438; &#x437;&#x43D;&#x430;&#x434;&#x43E;&#x431;&#x438;&#x43B;&#x43E;&#x441;&#x44C; &#x445;&#x43E;&#x447;&#x430; &#x431; &#x43E;&#x434;&#x43D;&#x435; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x446;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;, &#x44F;&#x43A;&#x435; &#x432;&#x438; &#x43C;&#x430;&#x43B;&#x438; &#x431;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>has()</code>. &#x426;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x442;&#x435;&#x441;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x434;&#x435;&#x449;&#x43E; &#x437;&#x430;&#x43F;&#x43B;&#x443;&#x442;&#x430;&#x43D;&#x438;&#x43C;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x435;&#x432;&#x43D;&#x456;, &#x449;&#x43E; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x43E; &#x440;&#x443;&#x448;&#x456;&#x454;&#x43C; JavaScript .</p>
<p>&#x426;&#x456; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x44E;&#x442;&#x44C;, &#x449;&#x43E; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x441;&#x43F;&#x456;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x445;&#x430;&#x440;&#x430;&#x43A;&#x442;&#x435;&#x440;&#x438;&#x441;&#x442;&#x438;&#x43A; &#x437;&#x456; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x43C;&#x438; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430;&#x43C;&#x438;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x454; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x438;&#x445; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439;. &#x41E;&#x441;&#x44C; &#x432;&#x43E;&#x43D;&#x438;:</p>
<ol>
<li>&#x423; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x456; <code>WeakSet</code>, &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>add()</code>, <code>has()</code> &#x442;&#x430; <code>delete()</code> &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x457;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x43D;&#x435;&#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;.</li>
<li>&#x421;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x43D;&#x435; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x456;, &#x456; &#x442;&#x43E;&#x43C;&#x443; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x443; &#x446;&#x438;&#x43A;&#x43B;&#x456; <code>for-of</code>.</li>
<li>&#x421;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x43D;&#x435; &#x432;&#x438;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x43D;&#x456;&#x44F;&#x43A;&#x438;&#x445; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; (&#x44F;&#x43A; &#x43E;&#x442; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>keys()</code> &#x442;&#x430; <code>values()</code>), &#x456; &#x442;&#x43E;&#x43C;&#x443; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x443; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43D;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x432;&#x43C;&#x456;&#x441;&#x442; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x43E;&#x457; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;.</li>
<li>&#x421;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x43D;&#x435; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>forEach()</code>.</li>
<li>&#x421;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x43D;&#x435; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>size</code>.</li>
</ol>
<p>&#x417;&#x434;&#x430;&#x432;&#x430;&#x43B;&#x43E;&#x441;&#x44F; &#x431; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x43A;&#x435;&#x440;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x442;&#x44E;. &#x417;&#x430;&#x433;&#x430;&#x43B;&#x43E;&#x43C;, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43B;&#x438;&#x448;&#x435; &#x441;&#x43B;&#x456;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x43D;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;, &#x432;&#x430;&#x43C; &#x441;&#x43B;&#x456;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x445;.</p>
<p>&#x41C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x434;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x43A;&#x435;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x430;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x434;&#x443;&#x436;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x456;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x430;&#x441;&#x43E;&#x446;&#x456;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x443; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x437; &#x446;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;. &#x41E;&#x441;&#x44C; &#x434;&#x43B;&#x44F; &#x447;&#x43E;&#x433;&#x43E; ECMAScript 6 &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x434;&#x43E;&#x434;&#x430;&#x454; &#x43C;&#x430;&#x43F;&#x438;.</p>
<h2 id="&#x43C;&#x430;&#x43F;&#x438;-&#x432;-ecmascript-6">&#x41C;&#x430;&#x43F;&#x438; &#x432; ECMAScript 6</h2>
<p>&#x422;&#x438;&#x43F; <code>Map</code> &#x432; ECMAScript 6 &#x454; &#x432;&#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x43E;&#x43C; &#x43F;&#x430;&#x440; &#x201C;&#x43A;&#x43B;&#x44E;&#x447;&#x2013;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x201D;, &#x432; &#x44F;&#x43A;&#x438;&#x445; &#x44F;&#x43A; &#x43A;&#x43B;&#x44E;&#x447;, &#x442;&#x430;&#x43A; &#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43C;&#x430;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x442;&#x438;&#x43F;. &#x415;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; <code>Object.is()</code>, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43C;&#x430;&#x442;&#x438; &#x43E;&#x434;&#x43D;&#x43E;&#x447;&#x430;&#x441;&#x43D;&#x43E; &#x43A;&#x43B;&#x44E;&#x447; <code>5</code> &#x442;&#x430; &#x43A;&#x43B;&#x44E;&#x447; <code>&quot;5&quot;</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x446;&#x435; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x442;&#x438;&#x43F;&#x438;. &#x426;&#x435; &#x434;&#x435;&#x449;&#x43E; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x440;&#x438;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x438;.</p>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x443; &#x43C;&#x430;&#x43F;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x43E;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>set()</code> &#x442;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x435;&#x44E; &#x439;&#x43E;&#x43C;&#x443; &#x43A;&#x43B;&#x44E;&#x447;&#x430; &#x442;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x430;&#x441;&#x43E;&#x446;&#x456;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x446;&#x438;&#x43C; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C;. &#x41F;&#x43E;&#x442;&#x456;&#x43C; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x456;&#x441;&#x442;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x448;&#x438; &#x43A;&#x43B;&#x44E;&#x447; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>get()</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> map = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>();
map.set(<span class="hljs-string">&quot;title&quot;</span>, <span class="hljs-string">&quot;Understanding ES6&quot;</span>);
map.set(<span class="hljs-string">&quot;year&quot;</span>, <span class="hljs-number">2016</span>);

<span class="hljs-built_in">console</span>.log(map.get(<span class="hljs-string">&quot;title&quot;</span>));      <span class="hljs-comment">// &quot;Understanding ES6&quot;</span>
<span class="hljs-built_in">console</span>.log(map.get(<span class="hljs-string">&quot;year&quot;</span>));       <span class="hljs-comment">// 2016</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x432;&#x43E;&#x445; &#x43F;&#x430;&#x440; &#x201C;&#x43A;&#x43B;&#x44E;&#x447;&#x2013;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x201D;. &#x41A;&#x43B;&#x44E;&#x447; <code>&quot;title&quot;</code> &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x442;&#x43E;&#x434;&#x456; &#x44F;&#x43A; &#x43A;&#x43B;&#x44E;&#x447; <code>&quot;year&quot;</code> &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x447;&#x438;&#x441;&#x43B;&#x43E;. &#x41F;&#x43E;&#x442;&#x456;&#x43C; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x43E;&#x445; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>get()</code>. &#x42F;&#x43A;&#x449;&#x43E; &#x431; &#x43A;&#x43B;&#x44E;&#x447;&#x430; &#x43D;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x43B;&#x43E; &#x443; &#x446;&#x456;&#x439; &#x43C;&#x430;&#x43F;&#x456;, &#x442;&#x43E;&#x434;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>get()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x432; &#x431;&#x438; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>undefined</code> &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432;, &#x449;&#x43E; &#x43D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x43F; &#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x43C; &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> map = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>(),
    key1 = {},
    key2 = {};

map.set(key1, <span class="hljs-number">5</span>);
map.set(key2, <span class="hljs-number">42</span>);

<span class="hljs-built_in">console</span>.log(map.get(key1));         <span class="hljs-comment">// 5</span>
<span class="hljs-built_in">console</span>.log(map.get(key2));         <span class="hljs-comment">// 42</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; <code>key1</code> &#x442;&#x430; <code>key2</code> &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432; &#x443; &#x43C;&#x430;&#x43F;&#x456; &#x434;&#x43B;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x446;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x43D;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x456;&#x43D;&#x448;&#x456; &#x442;&#x438;&#x43F;&#x438;, &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439;. &#x426;&#x435; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x430;&#x441;&#x43E;&#x446;&#x456;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x434;&#x430;&#x43D;&#x43D;&#x456; &#x431;&#x435;&#x437; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;-&#x43C;&#x430;&#x43F;">&#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43C;&#x430;&#x43F;</h3>
<p>&#x41C;&#x430;&#x43F;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x437; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430;&#x43C;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x441;&#x43F;&#x456;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;. &#x426;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x434;&#x456;&#x44F;&#x442;&#x438; &#x437; &#x43C;&#x430;&#x43F;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430;&#x43C;&#x438; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;. &#x426;&#x456; &#x442;&#x440;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x44F;&#x43A; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x43F;, &#x442;&#x430;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;:</p>
<ul>
<li><code>has(key)</code> - &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x447;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x439; &#x43A;&#x43B;&#x44E;&#x447; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x432; &#x43C;&#x430;&#x43F;&#x456;;</li>
<li><code>delete(key)</code> - &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454; &#x437; &#x43C;&#x430;&#x43F;&#x438; &#x43A;&#x43B;&#x44E;&#x447; &#x442;&#x430; &#x430;&#x441;&#x43E;&#x446;&#x456;&#x439;&#x43E;&#x432;&#x430;&#x43D;&#x435; &#x437; &#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;;</li>
<li><code>clear()</code> - &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454; &#x432;&#x441;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x442;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x43C;&#x430;&#x43F;&#x438;.</li>
</ul>
<p>&#x41C;&#x430;&#x43F;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>size</code>, &#x449;&#x43E; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43F;&#x430;&#x440; &#x201C;&#x43A;&#x43B;&#x44E;&#x447;&#x2013;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x201D; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43C;&#x430;&#x43F;&#x430;. &#x41F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43D;&#x438;&#x436;&#x447;&#x435; &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x454; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x446;&#x438;&#x445; &#x442;&#x440;&#x44C;&#x43E;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x442;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>size</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> map = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>();
map.set(<span class="hljs-string">&quot;name&quot;</span>, <span class="hljs-string">&quot;Nicholas&quot;</span>);
map.set(<span class="hljs-string">&quot;age&quot;</span>, <span class="hljs-number">25</span>);

<span class="hljs-built_in">console</span>.log(map.size);          <span class="hljs-comment">// 2</span>

<span class="hljs-built_in">console</span>.log(map.has(<span class="hljs-string">&quot;name&quot;</span>));   <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(map.get(<span class="hljs-string">&quot;name&quot;</span>));   <span class="hljs-comment">// &quot;Nicholas&quot;</span>

<span class="hljs-built_in">console</span>.log(map.has(<span class="hljs-string">&quot;age&quot;</span>));    <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(map.get(<span class="hljs-string">&quot;age&quot;</span>));    <span class="hljs-comment">// 25</span>

map.delete(<span class="hljs-string">&quot;name&quot;</span>);
<span class="hljs-built_in">console</span>.log(map.has(<span class="hljs-string">&quot;name&quot;</span>));   <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(map.get(<span class="hljs-string">&quot;name&quot;</span>));   <span class="hljs-comment">// undefined</span>
<span class="hljs-built_in">console</span>.log(map.size);          <span class="hljs-comment">// 1</span>

map.clear();
<span class="hljs-built_in">console</span>.log(map.has(<span class="hljs-string">&quot;name&quot;</span>));   <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(map.get(<span class="hljs-string">&quot;name&quot;</span>));   <span class="hljs-comment">// undefined</span>
<span class="hljs-built_in">console</span>.log(map.has(<span class="hljs-string">&quot;age&quot;</span>));    <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(map.get(<span class="hljs-string">&quot;age&quot;</span>));    <span class="hljs-comment">// undefined</span>
<span class="hljs-built_in">console</span>.log(map.size);          <span class="hljs-comment">// 0</span>
</code></pre>
<p>&#x42F;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;, &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>size</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x430;&#x440; &#x201C;&#x43A;&#x43B;&#x44E;&#x447;&#x2013;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x201D; &#x443; &#x43C;&#x430;&#x43F;&#x456;. &#x415;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; <code>Map</code>, &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x441;&#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x43C;&#x430;&#x454; &#x43A;&#x43B;&#x44E;&#x447;&#x456; <code>&quot;name&quot;</code> &#x442;&#x430; <code>&quot;age&quot;</code>, &#x442;&#x43E;&#x43C;&#x443; <code>has()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>true</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x439;&#x43E;&#x43C;&#x443; &#x446;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;. &#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x430; <code>&quot;name&quot;</code> &#x447;&#x435;&#x440;&#x435;&#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>delete()</code>, &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>has()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>false</code> &#x43F;&#x440;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x456; <code>&quot;name&quot;</code>, &#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>size</code> &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x43D;&#x430; &#x43E;&#x434;&#x438;&#x43D; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43C;&#x435;&#x43D;&#x448;&#x435;. &#x41F;&#x43E;&#x442;&#x456;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>clear()</code> &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454; &#x440;&#x435;&#x448;&#x442;&#x443; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432;, &#x442;&#x43E;&#x43C;&#x443; <code>has()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>false</code> &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x43E;&#x445; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432;, &#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>size</code> &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454; 0.</p>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>clear()</code> &#x454; &#x448;&#x432;&#x438;&#x434;&#x43A;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x438;&#x442;&#x438; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x437; &#x43C;&#x430;&#x43F;&#x438;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x454; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; &#x43C;&#x430;&#x43F;&#x443; &#x437;&#x430; &#x43E;&#x434;&#x438;&#x43D; &#x440;&#x430;&#x437;.</p>
<h3 id="&#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44F;-&#x43C;&#x430;&#x43F;">&#x406;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44F; &#x43C;&#x430;&#x43F;</h3>
<p>&#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x44F;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x430;&#x43F;&#x443; &#x437; &#x434;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x448;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Map</code>. &#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x435;&#x43D; &#x431;&#x443;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x431;&#x443;&#x434;&#x435; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C;, &#x430; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x2014; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x432;&#x456;. &#x421;&#x430;&#x43C;&#x430; &#x43C;&#x430;&#x43F;&#x430;, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x454; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C; &#x446;&#x438;&#x445; &#x434;&#x432;&#x43E;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> map = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>([[<span class="hljs-string">&quot;name&quot;</span>, <span class="hljs-string">&quot;Nicholas&quot;</span>], [<span class="hljs-string">&quot;age&quot;</span>, <span class="hljs-number">25</span>]]);

<span class="hljs-built_in">console</span>.log(map.has(<span class="hljs-string">&quot;name&quot;</span>));   <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(map.get(<span class="hljs-string">&quot;name&quot;</span>));   <span class="hljs-comment">// &quot;Nicholas&quot;</span>
<span class="hljs-built_in">console</span>.log(map.has(<span class="hljs-string">&quot;age&quot;</span>));    <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(map.get(<span class="hljs-string">&quot;age&quot;</span>));    <span class="hljs-comment">// 25</span>
<span class="hljs-built_in">console</span>.log(map.size);          <span class="hljs-comment">// 2</span>
</code></pre>
<p>&#x41A;&#x43B;&#x44E;&#x447;&#x456; <code>&quot;name&quot;</code> &#x442;&#x430; <code>&quot;age&quot;</code> &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>map</code> &#x447;&#x435;&#x440;&#x435;&#x437; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44E; &#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x456;. &#x41C;&#x430;&#x441;&#x438;&#x432; &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x435;&#x449;&#x43E; &#x434;&#x438;&#x432;&#x43D;&#x438;&#x43C;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x446;&#x435; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432; &#x447;&#x435;&#x440;&#x435;&#x437; &#x442;&#x435;, &#x449;&#x43E; &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443; &#x434;&#x430;&#x43D;&#x438;&#x445;. &#x417;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x2014; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x438;&#x439; &#x434;&#x430;&#x454; &#x43F;&#x435;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x456; &#x443; &#x456;&#x43D;&#x448;&#x438;&#x439; &#x442;&#x438;&#x43F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43C;&#x430;&#x43F;&#x456;.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-foreach-&#x434;&#x43B;&#x44F;-&#x43C;&#x430;&#x43F;">&#x41C;&#x435;&#x442;&#x43E;&#x434; forEach &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x43F;</h3>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>forEach()</code> &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x43F; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x43D;&#x430; <code>forEach()</code> &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x442;&#x440;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;:</p>
<ol>
<li>&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x457; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x457; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456;;</li>
<li>&#x43A;&#x43B;&#x44E;&#x447; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;;</li>
<li>&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x443;, &#x437; &#x44F;&#x43A;&#x43E;&#x457; &#x447;&#x438;&#x442;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;.</li>
</ol>
<p>&#x426;&#x456; &#x442;&#x440;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x446;&#x456; <code>forEach()</code> &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;, &#x430; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x2014; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C; (&#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E; &#x434;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x43E;&#x457; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x430;&#x446;&#x456;&#x457; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x445;). &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> map = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>([ [<span class="hljs-string">&quot;name&quot;</span>, <span class="hljs-string">&quot;Nicholas&quot;</span>], [<span class="hljs-string">&quot;age&quot;</span>, <span class="hljs-number">25</span>]]);

map.forEach(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value, key, ownerMap</span>) </span>{
    <span class="hljs-built_in">console</span>.log(key + <span class="hljs-string">&quot; &quot;</span> + value);
    <span class="hljs-built_in">console</span>.log(ownerMap === map);
});
</code></pre>
<p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x443; <code>forEach()</code> &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E;, &#x449;&#x43E; &#x443; &#x43D;&#x435;&#x457; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;. <code>value</code> &#x442;&#x430; <code>key</code> &#x432;&#x438;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;, &#x430; <code>ownerMap</code> &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; <code>map</code>, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438;, &#x449;&#x43E; &#x457;&#x445;&#x43D;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x454; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x43C;&#x438;. &#x41E;&#x441;&#x44C; &#x432;&#x438;&#x432;&#x456;&#x434;:</p>
<pre><code>name Nicholas
true
age 25
true
</code></pre><p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;, &#x44F;&#x43A;&#x443; &#x431;&#x443;&#x43B;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x43E; &#x443; <code>forEach()</code>, &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x43A;&#x43E;&#x436;&#x43D;&#x443; &#x43F;&#x430;&#x440;&#x443; &#x201C;&#x43A;&#x43B;&#x44E;&#x447;&#x2013;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x201D; &#x443; &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x456; &#x443; &#x43C;&#x430;&#x43F;&#x443;. &#x422;&#x430;&#x43A;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x434;&#x435;&#x449;&#x43E; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>forEach()</code> &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x43F;&#x440;&#x438; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x43E;&#x457; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x430;&#x446;&#x456;&#x457;.</p>
<p>I&gt; &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x443; <code>forEach()</code>, &#x449;&#x43E;&#x431; &#x437;&#x430;&#x434;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>this</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x430; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>forEach()</code> &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;.</p>
<h3 id="&#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456;-&#x43C;&#x430;&#x43F;&#x438;-weak-maps">&#x421;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x430;&#x43F;&#x438; (Weak Maps)</h3>
<p>&#x421;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x430;&#x43F;&#x438; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x43F; &#x454; &#x442;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C;, &#x449;&#x43E; &#x456; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;: &#x446;&#x435; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x44C; &#x43D;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;. &#x423; <em>&#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x430;&#x43F;&#x430;&#x445; (weak maps)</em>, &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x43A;&#x43B;&#x44E;&#x447; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C; (&#x43F;&#x440;&#x438; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x2013;&#x43D;&#x435;&#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; &#x431;&#x443;&#x434;&#x435; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;), &#x456; &#x446;&#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x443;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x43E;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x448;&#x43A;&#x43E;&#x434;&#x436;&#x430;&#x44E;&#x442;&#x44C; &#x437;&#x431;&#x43E;&#x440;&#x443; &#x441;&#x43C;&#x456;&#x442;&#x442;&#x44F;. &#x42F;&#x43A;&#x449;&#x43E; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x44C; &#x43D;&#x430; &#x43A;&#x43B;&#x44E;&#x447; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x43E;&#x457; &#x43C;&#x430;&#x43F;&#x438; &#x43F;&#x43E;&#x437;&#x430; &#x446;&#x456;&#x454;&#x44E; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x43E;&#x44E; &#x43C;&#x430;&#x43F;&#x43E;&#x44E;, &#x442;&#x43E;&#x434;&#x456; &#x43F;&#x430;&#x440;&#x430; &#x201C;&#x43A;&#x43B;&#x44E;&#x447;&#x2013;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x201D; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x456; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x43E;&#x457; &#x43C;&#x430;&#x43F;&#x438;.</p>
<p>&#x41D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43C; &#x43C;&#x456;&#x441;&#x446;&#x435;&#x43C; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x430;&#x43F; &#x454; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x435;&#x432;&#x43D;&#x43E;&#x43C;&#x443; DOM&#x2013;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x43D;&#x430; &#x432;&#x435;&#x431;&#x2013;&#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x446;&#x456;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x434;&#x435;&#x44F;&#x43A;&#x430; JavaScript&#x2013;&#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x434;&#x43B;&#x44F; &#x432;&#x435;&#x431;&#x2013;&#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43E;&#x43A; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x43E;&#x434;&#x438;&#x43D; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; DOM&#x2013;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443;, &#x43D;&#x430; &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A;&#x430;, &#x456; &#x446;&#x435; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44C;&#x43E; &#x443; &#x43A;&#x435;&#x448;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;.</p>
<p>&#x421;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x456;&#x434;&#x445;&#x43E;&#x434;&#x443; &#x443; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; DOM&#x2013;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43D;&#x430; &#x432;&#x435;&#x431;&#x2013;&#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x446;&#x456;, &#x449;&#x43E;&#x431; &#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x437;&#x43C;&#x43E;&#x433;&#x43B;&#x430; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x438;&#x442;&#x438; &#x446;&#x435;&#x439; &#x430;&#x441;&#x43E;&#x446;&#x456;&#x439;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;. &#x423; &#x43F;&#x440;&#x43E;&#x442;&#x438;&#x43B;&#x435;&#x436;&#x43D;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x43D;&#x435;&#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; DOM&#x2013;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x456; &#x446;&#x438;&#x43C; &#x441;&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x442;&#x456;&#x43A; &#x43F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x456;. &#x412;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; DOM&#x2013;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x447;&#x435;&#x440;&#x435;&#x437; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x430;&#x43F;&#x438; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x43B;&#x43E; &#x431;&#x438; &#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x446;&#x456; &#x430;&#x441;&#x43E;&#x446;&#x456;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x437; &#x43A;&#x43E;&#x436;&#x43D;&#x438;&#x43C; DOM&#x2013;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x456; &#x43F;&#x440;&#x438; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x443; &#x43C;&#x430;&#x43F;&#x456;, &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x445; DOM&#x2013;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;, &#x44F;&#x43A;&#x438;&#x445; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x454;.</p>
<p>I&gt; &#x412;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438;, &#x449;&#x43E; &#x43B;&#x438;&#x448;&#x435; &#x43A;&#x43B;&#x44E;&#x447;&#x456;, &#x430; &#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x443; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x430;&#x43F;&#x430;&#x445; &#x454; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x43C;&#x438; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;. &#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;, &#x449;&#x43E; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x430;&#x43F;&#x430;&#x445; &#x43D;&#x435; &#x43F;&#x456;&#x434;&#x431;&#x438;&#x440;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x431;&#x438;&#x440;&#x430;&#x447;&#x435;&#x43C; &#x441;&#x43C;&#x456;&#x442;&#x442;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x441;&#x456; &#x456;&#x43D;&#x448;&#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x43D;&#x438;&#x445; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x456;.</p>
<h4 id="&#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;-&#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445;-&#x43C;&#x430;&#x43F;">&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x430;&#x43F;</h4>
<p>&#x422;&#x438;&#x43F; <code>WeakMap</code> &#x443;  ECMAScript 6 &#x454; &#x43D;&#x435;&#x432;&#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x43E;&#x43C; &#x43F;&#x430;&#x440; &#x201C;&#x43A;&#x43B;&#x44E;&#x447;&#x2013;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x201D;, &#x432; &#x44F;&#x43A;&#x438;&#x445; &#x43A;&#x43B;&#x44E;&#x447; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x43D;&#x435;&#x43D;&#x443;&#x43B;&#x44C;&#x43E;&#x432;&#x438;&#x43C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C;, &#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x430;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x442;&#x438;&#x43F;. &#x406;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x443; <code>WeakMap</code> &#x454; &#x434;&#x443;&#x436;&#x435; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x43C; &#x434;&#x43E; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x443; <code>Map</code> &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; <code>set()</code> &#x442;&#x430; <code>get()</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x432;&#x438;&#x442;&#x44F;&#x433;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445;, &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> map = <span class="hljs-keyword">new</span> <span class="hljs-built_in">WeakMap</span>(),
    element = <span class="hljs-built_in">document</span>.querySelector(<span class="hljs-string">&quot;.element&quot;</span>);

map.set(element, <span class="hljs-string">&quot;Original&quot;</span>);

<span class="hljs-keyword">let</span> value = map.get(element);
<span class="hljs-built_in">console</span>.log(value);             <span class="hljs-comment">// &quot;Original&quot;</span>

<span class="hljs-comment">// &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454;&#x43C;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;</span>
element.parentNode.removeChild(element);
element = <span class="hljs-literal">null</span>;

<span class="hljs-comment">// &#x442;&#x443;&#x442; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x430; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430; &#x441;&#x442;&#x430;&#x454; &#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x44C;&#x43E;&#x44E;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x434;&#x43D;&#x430; &#x43F;&#x430;&#x440;&#x430; &#x201C;&#x43A;&#x43B;&#x44E;&#x447;&#x2013;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x201D;. &#x41A;&#x43B;&#x44E;&#x447; <code>element</code> &#x454; DOM&#x2013;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x426;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x456; DOM&#x2013;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>get()</code>. &#x41F;&#x43E;&#x442;&#x456;&#x43C; DOM&#x2013;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;, &#x430; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439;, &#x449;&#x43E; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43D;&#x44C;&#x43E;&#x433;&#x43E;, &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>null</code>, &#x456; &#x434;&#x430;&#x43D;&#x456; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x456; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x43E;&#x457; &#x43C;&#x430;&#x43F;&#x438;.</p>
<p>&#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;, &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x442;&#x438;, &#x449;&#x43E; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x430; &#x43C;&#x430;&#x43F;&#x430; &#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x44F; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x430; &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>size</code>. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43D;&#x435; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x436;&#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x43A;&#x43B;&#x44E;&#x447;&#x456;, &#x432;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430; <code>get()</code>. &#x421;&#x43B;&#x430;&#x431;&#x43A;&#x430; &#x43C;&#x430;&#x43F;&#x430; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x44E;&#x447;&#x430; &#x456; &#x442;&#x43E;&#x434;&#x456; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x431;&#x438;&#x440;&#x430;&#x447; &#x441;&#x43C;&#x456;&#x442;&#x442;&#x44F;, &#x43F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x44C;, &#x44F;&#x43A;&#x443; &#x437;&#x430;&#x439;&#x43C;&#x430;&#x43B;&#x43E; &#x446;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x437;&#x432;&#x456;&#x43B;&#x44C;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F;.</p>
<h4 id="&#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44F;-&#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445;-&#x43C;&#x430;&#x43F;">&#x406;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44F; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x430;&#x43F;</h4>
<p>&#x429;&#x43E;&#x431; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x443; &#x43C;&#x430;&#x43F;&#x443;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x439;&#x442;&#x435; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>WeakMap</code>. &#x422;&#x43E;&#x447;&#x43D;&#x43E; &#x44F;&#x43A; &#x456; &#x43F;&#x440;&#x438; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E;&#x457; &#x43C;&#x430;&#x43F;&#x438;, &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x43C;&#x430;&#x454; &#x434;&#x432;&#x430; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;, &#x43F;&#x440;&#x438; &#x447;&#x43E;&#x43C;&#x443; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x454; &#x43D;&#x435;&#x43D;&#x443;&#x43B;&#x44C;&#x43E;&#x432;&#x438;&#x43C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C;, &#x430; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; (&#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443; &#x434;&#x430;&#x43D;&#x438;&#x445;). &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> key1 = {},
    key2 = {},
    map = <span class="hljs-keyword">new</span> <span class="hljs-built_in">WeakMap</span>([[key1, <span class="hljs-string">&quot;Hello&quot;</span>], [key2, <span class="hljs-number">42</span>]]);

<span class="hljs-built_in">console</span>.log(map.has(key1));     <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(map.get(key1));     <span class="hljs-comment">// &quot;Hello&quot;</span>
<span class="hljs-built_in">console</span>.log(map.has(key2));     <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(map.get(key2));     <span class="hljs-comment">// 42</span>
</code></pre>
<p>&#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; <code>key1</code> &#x442;&#x430; <code>key2</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432; &#x443; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456;&#x439; &#x43C;&#x430;&#x43F;&#x456;, &#x430; &#x442;&#x43E;&#x434;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>get()</code> &#x442;&#x430; <code>has()</code> &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43D;&#x438;&#x445;. &#x42F;&#x43A;&#x449;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x454; &#x43A;&#x43B;&#x44E;&#x447; &#x43D;&#x435;&#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x443; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x456;&#x439; &#x43F;&#x430;&#x440;&#x456; &#x201C;&#x43A;&#x43B;&#x44E;&#x447;&#x2013;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x201D;, &#x442;&#x43E; &#x43A;&#x438;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;.</p>
<h4 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;-&#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445;-&#x43C;&#x430;&#x43F;">&#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x430;&#x43F;</h4>
<p>&#x421;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x430;&#x43F;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43B;&#x438;&#x448;&#x435; &#x434;&#x432;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x434;&#x456;&#x457; &#x437; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x438; &#x201C;&#x43A;&#x43B;&#x44E;&#x447; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x201D;. &#x404; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>has()</code> &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x447;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x439; &#x43A;&#x43B;&#x44E;&#x447; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x443; &#x43C;&#x430;&#x43F;&#x456; &#x442;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>delete()</code> &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x432;&#x43D;&#x43E;&#x457; &#x43F;&#x430;&#x440;&#x438;. &#x41C;&#x435;&#x442;&#x43E;&#x434;&#x430; <code>clear()</code> &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x447;&#x435;&#x440;&#x435;&#x437; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x432;&#x438;&#x43C;&#x430;&#x433;&#x430;&#x454; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432;, &#x449;&#x43E; &#x454; &#x43D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x430;&#x43F;. &#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>has()</code> &#x442;&#x430; <code>delete()</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> map = <span class="hljs-keyword">new</span> <span class="hljs-built_in">WeakMap</span>(),
    element = <span class="hljs-built_in">document</span>.querySelector(<span class="hljs-string">&quot;.element&quot;</span>);

map.set(element, <span class="hljs-string">&quot;Original&quot;</span>);

<span class="hljs-built_in">console</span>.log(map.has(element));   <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(map.get(element));   <span class="hljs-comment">// &quot;Original&quot;</span>

map.delete(element);
<span class="hljs-built_in">console</span>.log(map.has(element));   <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(map.get(element));   <span class="hljs-comment">// undefined</span>
</code></pre>
<p>&#x422;&#x443;&#x442; DOM&#x2013;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x437;&#x43D;&#x43E;&#x432;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x430; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x43E;&#x457; &#x43C;&#x430;&#x43F;&#x438;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>has()</code> &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x438; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x430; &#x443; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456;&#x439; &#x43C;&#x430;&#x43F;&#x456;. &#x417;&#x430;&#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x430;&#x439;&#x442;&#x435;, &#x449;&#x43E; &#x446;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x43B;&#x438;&#x448;&#x435; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43D;&#x435;&#x43D;&#x443;&#x43B;&#x44C;&#x43E;&#x432;&#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x43A;&#x43B;&#x44E;&#x447;. &#x41A;&#x43B;&#x44E;&#x447; &#x43F;&#x440;&#x438;&#x43C;&#x443;&#x441;&#x43E;&#x432;&#x43E; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x43E;&#x457; &#x43C;&#x430;&#x43F;&#x438; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>delete()</code>, &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; <code>has()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>false</code>, &#x430; <code>get()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>undefined</code>.</p>
<h4 id="&#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x456;-&#x434;&#x430;&#x43D;&#x456;-&#x443;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x430;&#x445;">&#x41F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x456; &#x434;&#x430;&#x43D;&#x456; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x445;</h4>
<p>&#x422;&#x43E;&#x434;&#x456; &#x44F;&#x43A; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x456;&#x441;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x432;&#x431;&#x430;&#x447;&#x430;&#x44E;&#x442;&#x44C; &#x443; &#x430;&#x441;&#x43E;&#x446;&#x456;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x434;&#x430;&#x43D;&#x438;&#x445; DOM&#x2013;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x430;&#x43F;, &#x454; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x445; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x44C; (&#x456; &#x431;&#x435;&#x437; &#x441;&#x443;&#x43C;&#x43D;&#x456;&#x432;&#x443;, &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x437; &#x43D;&#x438;&#x445; &#x449;&#x435; &#x43D;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43D;&#x44C;&#x43E; &#x432;&#x438;&#x432;&#x447;&#x435;&#x43D;&#x456;). &#x41E;&#x434;&#x43D;&#x438;&#x43C; &#x437; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x445; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x443;&#x432;&#x430;&#x43D;&#x44C; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x430;&#x43F; &#x454; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x438;&#x445; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x412;&#x441;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x454; &#x43F;&#x443;&#x431;&#x43B;&#x456;&#x447;&#x43D;&#x438;&#x43C;&#x438; &#x443; ECMAScript 6, &#x456; &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x430;&#x43C; &#x441;&#x43B;&#x456;&#x434; &#x43F;&#x440;&#x43E;&#x44F;&#x432;&#x438;&#x442;&#x438; &#x442;&#x440;&#x43E;&#x445;&#x438; &#x432;&#x438;&#x43D;&#x430;&#x445;&#x456;&#x434;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x430;&#x43B;&#x435; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x44C;&#x43E;&#x433;&#x43E; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E;. &#x420;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">Person</span>(<span class="hljs-params">name</span>) </span>{
    <span class="hljs-keyword">this</span>._name = name;
}

Person.prototype.getName = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>._name;
};
</code></pre>
<p>&#x422;&#x430;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43F;&#x43E;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x439; &#x437;&#x430;&#x43F;&#x438;&#x441;, &#x449;&#x43E; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x43D;&#x438;&#x436;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x456;&#x434;&#x43A;&#x440;&#x435;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x456; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x432;&#x430;&#x436;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x438;&#x43C; &#x456; &#x439;&#x43E;&#x433;&#x43E; &#x43D;&#x435; &#x441;&#x43B;&#x456;&#x434; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x437;&#x430; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x43C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;. &#x41F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x449;&#x43E; &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>this._name</code> &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; <code>getName()</code>, &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; <code>_name</code> &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x430;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x43D;&#x456;&#x447;&#x43E;&#x433;&#x43E; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x448;&#x43A;&#x43E;&#x434;&#x436;&#x430;&#x454; &#x43A;&#x43E;&#x43C;&#x443;&#x441;&#x44C; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x449;&#x43E;&#x441;&#x44C; &#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>_name</code>, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x430; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x43E; &#x430;&#x431;&#x43E; &#x43D;&#x430;&#x432;&#x43C;&#x438;&#x441;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x430;.</p>
<p>&#x423; ECMAScript 5 &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x449;&#x43E;&#x441;&#x44C; &#x434;&#x443;&#x436;&#x435; &#x441;&#x445;&#x43E;&#x436;&#x435; &#x43D;&#x430; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x456; &#x434;&#x430;&#x43D;&#x456; &#x447;&#x435;&#x440;&#x435;&#x437; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; &#x437;&#x430; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> Person = (<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{

    <span class="hljs-keyword">var</span> privateData = {},
        privateId = <span class="hljs-number">0</span>;

    <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">Person</span>(<span class="hljs-params">name</span>) </span>{
        <span class="hljs-built_in">Object</span>.defineProperty(<span class="hljs-keyword">this</span>, <span class="hljs-string">&quot;_id&quot;</span>, { value: privateId++ });

        privateData[<span class="hljs-keyword">this</span>._id] = {
            name: name
        };
    }

    Person.prototype.getName = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
        <span class="hljs-keyword">return</span> privateData[<span class="hljs-keyword">this</span>._id].name;
    };

    <span class="hljs-keyword">return</span> Person;
}());
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43E;&#x433;&#x43E;&#x440;&#x442;&#x430;&#x454; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>Person</code> &#x443; &#x41D;&#x412;&#x424;&#x412;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;: <code>privateData</code> &#x442;&#x430; <code>privateId</code>. &#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>privateData</code> &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x443; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x443;, &#x442;&#x43E;&#x434;&#x456; &#x44F;&#x43A; <code>privateId</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x449;&#x43E;&#x431; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x443;&#x432;&#x430;&#x442;&#x438; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; ID &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;. &#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Person</code>, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x430;, &#x43D;&#x435;&#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; &#x456; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x43D;&#x430; &#x437;&#x430;&#x43F;&#x438;&#x441; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>_id</code>.</p>
<p>&#x41F;&#x43E;&#x442;&#x456;&#x43C;, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x43B;&#x435; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456; <code>privateData</code>, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; ID &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;: &#x43E;&#x441;&#x44C; &#x434;&#x435; &#x434;&#x435; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>name</code>. &#x41F;&#x456;&#x437;&#x43D;&#x456;&#x448;&#x435;, &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; <code>getName()</code>, &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x434;&#x456;&#x441;&#x442;&#x430;&#x442;&#x438; <code>name</code> &#x447;&#x435;&#x440;&#x435;&#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>this._id</code> &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x430; &#x434;&#x43B;&#x44F; <code>privateData</code>. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>privateData</code> &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43F;&#x43E;&#x437;&#x430; &#x41D;&#x412;&#x424;&#x412;, &#x441;&#x43F;&#x440;&#x430;&#x432;&#x436;&#x43D;&#x456; &#x434;&#x430;&#x43D;&#x456; &#x432; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x446;&#x456;, &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x445;&#x43E;&#x447;&#x430; &#x439; <code>this._id</code> &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x443;&#x431;&#x43B;&#x456;&#x447;&#x43D;&#x43E;.</p>
<p>&#x412;&#x435;&#x43B;&#x438;&#x43A;&#x43E;&#x44E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x43E;&#x44E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x456;&#x434;&#x445;&#x43E;&#x434;&#x443; &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x434;&#x430;&#x43D;&#x456; &#x443; <code>privateData</code> &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x437;&#x43D;&#x438;&#x43A;&#x430;&#x44E;&#x442;&#x44C;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x443; &#x434;&#x456;&#x437;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44C;, &#x447;&#x438; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; &#x431;&#x443;&#x432; &#x437;&#x43D;&#x438;&#x449;&#x435;&#x43D;&#x438;&#x439;. &#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>privateData</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x434;&#x430;&#x43D;&#x456;. &#x426;&#x44E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x438;&#x440;&#x456;&#x448;&#x438;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x430;&#x43F;, &#x442;&#x430;&#x43A;&#x438; &#x447;&#x438;&#x43D;&#x43E;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> Person = (<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{

    <span class="hljs-keyword">let</span> privateData = <span class="hljs-keyword">new</span> <span class="hljs-built_in">WeakMap</span>();

    <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">Person</span>(<span class="hljs-params">name</span>) </span>{
        privateData.set(<span class="hljs-keyword">this</span>, { name: name });
    }

    Person.prototype.getName = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
        <span class="hljs-keyword">return</span> privateData.get(<span class="hljs-keyword">this</span>).name;
    };

    <span class="hljs-keyword">return</span> Person;
}());
</code></pre>
<p>&#x422;&#x430;&#x43A;&#x430; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x437; <code>Person</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x443; &#x43C;&#x430;&#x43F;&#x443; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; <code>Person</code> &#x43C;&#x43E;&#x436;&#x435; &#x441;&#x430;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x430;, &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x442;&#x438; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x438;&#x439; ID. &#x41A;&#x43E;&#x43B;&#x438; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Person</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x443; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456;&#x439; &#x43C;&#x430;&#x43F;&#x456; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x43E;&#x432;&#x430; &#x43E;&#x434;&#x438;&#x43D;&#x438;&#x446;&#x44F; &#x437; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C; <code>this</code> &#x442;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x443; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E;, &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x446;&#x435; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43B;&#x438;&#x448;&#x435; &#x43F;&#x43E;&#x43B;&#x435; <code>name</code>. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>getName()</code> &#x434;&#x456;&#x441;&#x442;&#x430;&#x454; &#x446;&#x44E; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x443; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x448;&#x438; <code>this</code> &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>privateData.get()</code>, &#x44F;&#x43A;&#x438;&#x439; &#x437;&#x447;&#x438;&#x442;&#x443;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C;, &#x456; &#x434;&#x456;&#x441;&#x442;&#x430;&#x454; &#x437; &#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>name</code>. &#x422;&#x430;&#x43A;&#x430; &#x442;&#x435;&#x445;&#x43D;&#x456;&#x43A;&#x430; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x443; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x43E;&#x44E; &#x442;&#x430; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454; &#x457;&#x457;, &#x44F;&#x43A; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;, &#x449;&#x43E; &#x430;&#x441;&#x43E;&#x446;&#x456;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x43D;&#x435;&#x44E;, &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x438;&#x439;.</p>
<h4 id="&#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;-&#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445;-&#x43C;&#x430;&#x43F;-&#x442;&#x430;-&#x457;&#x445;-&#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F;">&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43C;&#x430;&#x43F; &#x442;&#x430; &#x457;&#x445; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F;</h4>
<p>&#x412;&#x438;&#x440;&#x456;&#x448;&#x443;&#x44E;&#x447;&#x438;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x430;&#x43F;&#x438;, &#x430; &#x43A;&#x43E;&#x43B;&#x438; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456;, &#x440;&#x456;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x454; &#x491;&#x440;&#x443;&#x43D;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x442;&#x43E;&#x43C;&#x443;, &#x447;&#x438; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432;. &#x429;&#x43E;&#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x437;&#x431;&#x438;&#x440;&#x430;&#x454;&#x442;&#x435;&#x441;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432; &#x2014; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x430; &#x43C;&#x430;&#x43F;&#x430; &#x431;&#x443;&#x434;&#x435; &#x43D;&#x430;&#x439;&#x43A;&#x440;&#x430;&#x449;&#x438;&#x43C; &#x440;&#x456;&#x448;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;. &#x426;&#x435; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x456; &#x442;&#x430; &#x443;&#x43D;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x432;&#x438;&#x442;&#x43E;&#x43A;&#x456;&#x432; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x456; &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445;, &#x449;&#x43E; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456;.</p>
<p>&#x417;&#x430;&#x43F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x430;&#x439;&#x442;&#x435;, &#x449;&#x43E; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x430;&#x43F;&#x438; &#x434;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x43B;&#x438;&#x448;&#x435; &#x447;&#x430;&#x441;&#x442;&#x43A;&#x43E;&#x432;&#x443; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x433;&#x43E; &#x432;&#x43C;&#x456;&#x441;&#x442;&#x443;, &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>forEach()</code>, &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>size</code> &#x430;&#x431;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>clear()</code> &#x434;&#x43B;&#x44F; &#x43A;&#x435;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x43C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x43B;&#x44F; &#x456;&#x43D;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x442;&#x43E;&#x434;&#x456; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x43C;&#x430;&#x43F;&#x438; &#x43F;&#x456;&#x434;&#x456;&#x439;&#x434;&#x443;&#x442;&#x44C; &#x43A;&#x440;&#x430;&#x449;&#x435;. &#x412;&#x430;&#x43C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432;&#x430;&#x440;&#x442;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x441;&#x43B;&#x456;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x456;.</p>
<p>&#x417;&#x432;&#x456;&#x441;&#x43D;&#x43E;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43D;&#x435;&#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;, &#x442;&#x43E;&#x434;&#x456; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x43C;&#x430;&#x43F;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x43C; &#x432;&#x430;&#x440;&#x456;&#x430;&#x43D;&#x442;&#x43E;&#x43C;.</p>
<h2 id="&#x43F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;">&#x41F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;</h2>
<p>ECMAScript 6 &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x442;&#x430; &#x43C;&#x430;&#x43F;&#x438; &#x432; JavaScript. &#x414;&#x43E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x456;&#x43C;&#x456;&#x442;&#x430;&#x446;&#x456;&#x457; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x442;&#x430; &#x43C;&#x430;&#x43F;, &#x447;&#x430;&#x441;&#x442;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x44E;&#x447;&#x438; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438;, &#x43F;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x430;&#x43D;&#x456; &#x437; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;, &#x449;&#x43E; &#x441;&#x442;&#x43E;&#x441;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x445;.</p>
<p>&#x41C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x2014; &#x446;&#x435; &#x43D;&#x435;&#x432;&#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x438; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;. &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x456;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x456; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E; &#x434;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>Object.is()</code>. &#x41C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x434;&#x43B;&#x44F; &#x444;&#x456;&#x43B;&#x44C;&#x442;&#x440;&#x430;&#x446;&#x456;&#x457; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43D;&#x430; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;. &#x41C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x43D;&#x435; &#x454; &#x43F;&#x456;&#x434;&#x43A;&#x43B;&#x430;&#x441;&#x43E;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>has()</code> &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456;, &#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>size</code> &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456;. &#x422;&#x438;&#x43F; <code>Set</code> &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>forEach()</code> &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x438; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456;.</p>
<p>&#x421;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x2014; &#x446;&#x435; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x442;&#x438;&#x43C;, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x43D;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;. &#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x456; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x43C;&#x438; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;, &#x430; &#x446;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x44F;&#x43A;&#x449;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x443; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456;&#x439; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456; &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x436;&#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x441;&#x435;&#x431;&#x435;, &#x432;&#x456;&#x43D; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x438;&#x431;&#x440;&#x430;&#x43D;&#x438;&#x439; &#x437;&#x431;&#x438;&#x440;&#x430;&#x447;&#x435;&#x43C; &#x441;&#x43C;&#x456;&#x442;&#x442;&#x44F;. &#x421;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x456;&#x43D;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x447;&#x435;&#x440;&#x435;&#x437; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x437; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x456;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x456;, &#x442;&#x43E;&#x43C;&#x443; &#x43D;&#x430;&#x439;&#x43A;&#x440;&#x430;&#x449;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x449;&#x43E; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x437;&#x433;&#x440;&#x443;&#x43F;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x440;&#x430;&#x437;&#x43E;&#x43C;.</p>
<p>&#x41C;&#x430;&#x43F;&#x438; &#x2014; &#x43D;&#x435;&#x432;&#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43F;&#x430;&#x440;&#x438; &#x201C;&#x43A;&#x43B;&#x44E;&#x447;&#x2013;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x201D;, &#x443; &#x44F;&#x43A;&#x438;&#x439; &#x456; &#x43A;&#x43B;&#x44E;&#x447;, &#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443;. &#x42F;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;, &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x447;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x43E;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>Object.is()</code>, &#x430; &#x446;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43C;&#x430;&#x442;&#x438; &#x44F;&#x43A; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x439; &#x43A;&#x43B;&#x44E;&#x447; <code>5</code>, &#x442;&#x430;&#x43A; &#x456; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x438;&#x439; <code>&quot;5&quot;</code>, &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x432;&#x43E;&#x445; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x445; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432;. &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x430;&#x441;&#x43E;&#x446;&#x456;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>set()</code>, &#x456; &#x446;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x433;&#x43E;&#x434;&#x43E;&#x43C; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>get()</code>. &#x41C;&#x430;&#x43F;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>size</code> &#x442;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>forEach()</code> &#x434;&#x43B;&#x44F; &#x43B;&#x435;&#x433;&#x448;&#x43E;&#x433;&#x43E; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x434;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;.</p>
<p>&#x421;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x430;&#x43F;&#x438; &#x2014; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x442;&#x438;&#x43F; &#x43C;&#x430;&#x43F;, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;. &#x42F;&#x43A; &#x456; &#x437; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x43C;&#x438; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430;&#x43C;&#x438;, &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;, &#x449;&#x43E; &#x454; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C;, &#x454; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x43C; &#x456; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x431;&#x438;&#x440;&#x430;&#x447;&#x435;&#x43C; &#x441;&#x43C;&#x456;&#x442;&#x442;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x43E; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x43C; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43D;&#x430; &#x446;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;. &#x41A;&#x43E;&#x43B;&#x438; &#x43A;&#x43B;&#x44E;&#x447; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x431;&#x438;&#x440;&#x430;&#x447;&#x435;&#x43C; &#x441;&#x43C;&#x456;&#x442;&#x442;&#x44F;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x430;&#x441;&#x43E;&#x446;&#x456;&#x439;&#x43E;&#x432;&#x430;&#x43D;&#x435; &#x437; &#x446;&#x438;&#x43C; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C;, &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x456; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x43E;&#x457; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;. &#x426;&#x435;&#x439; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;, &#x449;&#x43E; &#x441;&#x442;&#x43E;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x456;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x442;&#x44E;, &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x430;&#x43F;&#x438; &#x43F;&#x440;&#x435;&#x43A;&#x440;&#x430;&#x441;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x440;&#x435;&#x43B;&#x44F;&#x446;&#x456;&#x457; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x457; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x457; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438;, &#x447;&#x438;&#x439; &#x436;&#x438;&#x442;&#x442;&#x454;&#x432;&#x438;&#x439; &#x446;&#x438;&#x43A;&#x43B; &#x43A;&#x435;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43F;&#x43E;&#x437;&#x430; &#x43A;&#x43E;&#x434;&#x43E;&#x43C;, &#x437; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="06-Symbols.html" class="navigation navigation-prev " aria-label="Previous page: Глава 6: Символи та їх властивості">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="08-Iterators-And-Generators.html" class="navigation navigation-next " aria-label="Next page: Глава 8: Ітератори та генератори">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Глава 7: Множини та мапи","level":"1.9","depth":1,"next":{"title":"Глава 8: Ітератори та генератори","level":"1.10","depth":1,"path":"manuscript/08-Iterators-And-Generators.md","ref":"manuscript/08-Iterators-And-Generators.md","articles":[]},"previous":{"title":"Глава 6: Символи та їх властивості","level":"1.8","depth":1,"path":"manuscript/06-Symbols.md","ref":"manuscript/06-Symbols.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","yametrika","ga","rss"],"pluginsConfig":{"yametrika":{"number":"34703815"},"github":{"url":"https://github.com/denysdovhan/understandinges6ua"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Рoзуміння ECMAScript 6","description":"Український переклад книги «Understanding ES6».","author":"Denys Dovhan and Terry Sahaidak","site_url":"http://understandinges6.denysdovhan.com/","feed_url":"http://understandinges6.denysdovhan.com/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"ga":{"configuration":"auto","token":"UA-40496885-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/denysdovhan/understandinges6ua/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"manuscript/07-Sets-And-Maps.md","mtime":"2016-12-20T09:35:13.639Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2016-12-20T09:36:49.264Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-yametrika/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

