
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Глава 8: Ітератори та генератори · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="09-Classes.html" />
    
    
    <link rel="prev" href="07-Sets-And-Maps.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"denysdovhan/understandinges6ua","types":["star"],"size":"small"};
    </script>

    <link href="http://understandinges6.denysdovhan.com/rss.xml" title="Рoзуміння ECMAScript 6" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Рoзуміння ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-Block-Bindings.html">
            
                <a href="01-Block-Bindings.html">
            
                    
                    Глава 1: Блочне зв’язування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02-Strings-and-Regular-Expressions.html">
            
                <a href="02-Strings-and-Regular-Expressions.html">
            
                    
                    Глава 2: Рядки та регулярні вирази
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03-Functions.html">
            
                <a href="03-Functions.html">
            
                    
                    Глава 3: Функції
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="04-Objects.html">
            
                <a href="04-Objects.html">
            
                    
                    Глава 4: Розширена функціональність об’єктів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="05-Destructuring.html">
            
                <a href="05-Destructuring.html">
            
                    
                    Глава 5: Деструктурування для легшого доступу до даних
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="06-Symbols.html">
            
                <a href="06-Symbols.html">
            
                    
                    Глава 6: Символи та їх властивості
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="07-Sets-And-Maps.html">
            
                <a href="07-Sets-And-Maps.html">
            
                    
                    Глава 7: Множини та мапи
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="08-Iterators-And-Generators.html">
            
                <a href="08-Iterators-And-Generators.html">
            
                    
                    Глава 8: Ітератори та генератори
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="09-Classes.html">
            
                <a href="09-Classes.html">
            
                    
                    Глава 9: Знайомство з класами у JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10-Arrays.html">
            
                <a href="10-Arrays.html">
            
                    
                    Глава 10: Покращені можливості масивів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11-Promises.html">
            
                <a href="11-Promises.html">
            
                    
                    Глава 11: Проміси та асинхронне програмування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12-Proxies-and-Reflection.html">
            
                <a href="12-Proxies-and-Reflection.html">
            
                    
                    Глава 12: Проксі та АРІ рефлексії
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13-Modules.html">
            
                <a href="13-Modules.html">
            
                    
                    Глава 13: Інкапсуляція коду через модулі
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" >
            
                <span>
            
                    
                    Додаток А: Дрібніші зміни у ECMAScript 6
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" >
            
                <span>
            
                    
                    Додаток Б: Розуміння ECMAScript 7 (2016)
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Глава 8: Ітератори та генератори</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;-&#x442;&#x430;-&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;">&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x442;&#x430; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;</h1>
<p>&#x411;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x43C;&#x43E;&#x432; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x43C;&#x43E;&#x432;&#x438;&#x43B;&#x438;&#x441;&#x44C; &#x432;&#x456;&#x434; &#x456;&#x442;&#x435;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x446;&#x438;&#x43A;&#x43B;&#x443; <code>for</code>, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x454; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x434;&#x43B;&#x44F; &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x457; &#x443; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457;, &#x43D;&#x430; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x44C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;&#x2013;&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;, &#x43A;&#x43E;&#x442;&#x440;&#x456; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43D;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x443; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457;. &#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x442;&#x44C; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443; &#x437; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x44F;&#x43C;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x43B;&#x435;&#x433;&#x448;&#x43E;&#x44E;, &#x430; ECMAScript 6 &#x434;&#x43E;&#x434;&#x430;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x443; JavaScript. &#x420;&#x430;&#x437;&#x43E;&#x43C; &#x437; &#x43D;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x442;&#x430; &#x43D;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439; (&#x44F;&#x43A; &#x43E;&#x442; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x442;&#x430; &#x43C;&#x430;&#x43F;&#x438;), &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x454; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C; &#x434;&#x43E; &#x435;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x457; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445;, &#x456; &#x441;&#x430;&#x43C;&#x435; &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438; &#x437;&#x43D;&#x430;&#x439;&#x434;&#x435;&#x442;&#x435; &#x457;&#x445; &#x443; &#x431;&#x430;&#x433;&#x430;&#x442;&#x44C;&#x43E;&#x445; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430;&#x445; &#x43C;&#x43E;&#x432;&#x438;. &#x41D;&#x43E;&#x432;&#x438;&#x439; &#x446;&#x438;&#x43A;&#x43B; <code>for-of</code> &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x437; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x43C;&#x438;, &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; (<code>...</code>) &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;, &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x442;&#x44C; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C;.</p>
<p>&#x426;&#x44F; &#x433;&#x43B;&#x430;&#x432;&#x430; &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43F;&#x440;&#x43E; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;, &#x430;&#x43B;&#x435;, &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443;, &#x434;&#x443;&#x436;&#x435; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438; &#x456;&#x441;&#x442;&#x43E;&#x440;&#x456;&#x44E; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x43E;&#x43C;&#x443; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x456; &#x443; JavaScript.</p>
<h2 id="&#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430;-&#x437;-&#x446;&#x438;&#x43A;&#x43B;&#x430;&#x43C;&#x438;">&#x41F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x437; &#x446;&#x438;&#x43A;&#x43B;&#x430;&#x43C;&#x438;</h2>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x434;&#x43E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x43D;&#x430; JavaScript, &#x432;&#x438; &#x43D;&#x430;&#x43F;&#x435;&#x432;&#x43D;&#x43E; &#x43F;&#x438;&#x441;&#x430;&#x43B;&#x438; &#x43A;&#x43E;&#x43B;&#x438;&#x441;&#x44C; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> colors = [<span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span>, <span class="hljs-string">&quot;blue&quot;</span>];

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>, len = colors.length; i &lt; len; i++) {
    <span class="hljs-built_in">console</span>.log(colors[i]);
}
</code></pre>
<p>&#x422;&#x443;&#x442; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x438;&#x439; &#x446;&#x438;&#x43A;&#x43B; <code>for</code> &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x454; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; <code>colors</code> &#x447;&#x435;&#x440;&#x435;&#x437; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; <code>i</code>. &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>i</code> &#x437;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x449;&#x43E;&#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>i</code> &#x454; &#x43C;&#x435;&#x43D;&#x448;&#x438;&#x43C; &#x437;&#x430; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; (&#x449;&#x43E; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>len</code>).</p>
<p>&#x426;&#x435;&#x439; &#x446;&#x438;&#x43A;&#x43B; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x456; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;, &#x430;&#x43B;&#x435; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x437;&#x430;&#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;, &#x432;&#x430;&#x43C; &#x434;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x442;&#x438; &#x446;&#x438;&#x43A;&#x43B; &#x43E;&#x434;&#x438;&#x43D; &#x432; &#x43E;&#x434;&#x438;&#x43D;, &#x430; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x438; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x431;&#x443;&#x434;&#x435; &#x437;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C;. &#x414;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x430; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x454; &#x434;&#x436;&#x435;&#x440;&#x435;&#x43B;&#x43E;&#x43C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;, &#x430; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43D;&#x430; &#x43F;&#x440;&#x438;&#x440;&#x43E;&#x434;&#x430; &#x446;&#x438;&#x43A;&#x43B;&#x443; <code>for</code> &#x43F;&#x440;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x434;&#x43E; &#x449;&#x435; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x457; &#x457;&#x445; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;, &#x43D;&#x456;&#x436; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x43A;&#x43E;&#x434;, &#x449;&#x43E; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x439; &#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x43C;&#x456;&#x441;&#x446;&#x44F;&#x445;. &#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x440;&#x456;&#x448;&#x438;&#x442;&#x438; &#x446;&#x44E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443;.</p>
<h2 id="&#x449;&#x43E;-&#x442;&#x430;&#x43A;&#x435;-&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;">&#x429;&#x43E; &#x442;&#x430;&#x43A;&#x435; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;?</h2>
<p>&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x454; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438; &#x437; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x412;&#x441;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;&#x2013;&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>next()</code>, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x2013;&#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;. &#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x2013;&#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43C;&#x430;&#x454; &#x434;&#x432;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;: <code>value</code>, &#x44F;&#x43A;&#x430; &#x454; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x442;&#x430; <code>done</code>, &#x44F;&#x43A;&#x430; &#x454; &#x431;&#x443;&#x43B;&#x435;&#x432;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;, &#x43A;&#x43E;&#x442;&#x440;&#x435; &#x440;&#x456;&#x432;&#x43D;&#x435; <code>true</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x438;&#x43B;&#x43E;&#x441;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;, &#x44F;&#x43A;&#x456; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;. &#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x456;&#x439; &#x432;&#x43A;&#x430;&#x437;&#x456;&#x432;&#x43D;&#x438;&#x43A; &#x43D;&#x430; &#x440;&#x43E;&#x437;&#x442;&#x430;&#x448;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x443; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457;, &#x456; &#x437; &#x43A;&#x43E;&#x436;&#x43D;&#x438;&#x43C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x43E;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>next()</code> &#x432;&#x456;&#x43D; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435;&#x442;&#x435; <code>next()</code> &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x431;&#x443;&#x43B;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x435;, &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; <code>done</code> &#x440;&#x456;&#x432;&#x43D;&#x435; <code>true</code> &#x442;&#x430; <code>value</code>, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; <em>&#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; (return value)</em> &#x434;&#x43B;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;. &#x426;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x454; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445;, &#x430;&#x43B;&#x435; &#x454; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43A;&#x43E;&#x44E; &#x446;&#x438;&#x445; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x430;&#x431;&#x43E; <code>undefined</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x43D;&#x435;&#x43C;&#x430;&#x454;. &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x435; &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x434;&#x443;&#x436;&#x435; &#x441;&#x445;&#x43E;&#x436;&#x435; &#x43D;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439; &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x446;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x443; &#x43C;&#x456;&#x441;&#x446;&#x435;, &#x437;&#x432;&#x456;&#x434;&#x43A;&#x438; &#x457;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43B;&#x438;.</p>
<p>&#x417;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x446;&#x435;, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; ECMAScript 5 &#x434;&#x443;&#x436;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">createIterator</span>(<span class="hljs-params">items</span>) </span>{

    <span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>;

    <span class="hljs-keyword">return</span> {
        next: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{

            <span class="hljs-keyword">var</span> done = (i &gt;= items.length);
            <span class="hljs-keyword">var</span> value = !done ? items[i++] : <span class="hljs-literal">undefined</span>;

            <span class="hljs-keyword">return</span> {
                done: done,
                value: value
            };

        }
    };
}

<span class="hljs-keyword">var</span> iterator = createIterator([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>]);

<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 1, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 2, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 3, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: undefined, done: true }&quot;</span>

<span class="hljs-comment">// &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: undefined, done: true }&quot;</span>
</code></pre>
<p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>createIterator()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43C; <code>next()</code>. &#x429;&#x43E;&#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; <code>value</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; <code>items</code>. &#x41A;&#x43E;&#x43B;&#x438; <code>i</code> &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454; 3, <code>done</code> &#x441;&#x442;&#x430;&#x454; <code>true</code>, &#x430; &#x442;&#x435;&#x440;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x449;&#x43E; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454; <code>value</code>, &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; <code>undefined</code>. &#x426;&#x456; &#x434;&#x432;&#x430; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x438; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x437;&#x430; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456;&#x439; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43E;&#x43A; &#x434;&#x43B;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x443; ECMAScript 6, &#x43A;&#x43E;&#x43B;&#x438; <code>next()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443; &#x434;&#x430;&#x43D;&#x438;&#x445;.</p>
<p>&#x42F;&#x43A; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43D;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E; &#x434;&#x43E; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;, &#x44F;&#x43A;&#x456; &#x43F;&#x43E;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x456; &#x432; ECMAScript 6, &#x454; &#x434;&#x435;&#x449;&#x43E; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x438;&#x43C;.</p>
<p>&#x41D;&#x430; &#x449;&#x430;&#x441;&#x442;&#x44F;, ECMAScript 6 &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43D;&#x430;&#x434;&#x430;&#x454; &#x43D;&#x430;&#x43C; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;, &#x44F;&#x43A;&#x456; &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x442;&#x44C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;&#x2013;&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x43D;&#x430;&#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C;.</p>
<h2 id="&#x449;&#x43E;-&#x442;&#x430;&#x43A;&#x435;-&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;">&#x429;&#x43E; &#x442;&#x430;&#x43A;&#x435; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;?</h2>
<p><em>&#x413;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;</em> &#x2014; &#x446;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x43C; &#x437;&#x456;&#x440;&#x43E;&#x447;&#x43A;&#x438; (<code>*</code>) &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>function</code> &#x442;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>yield</code>. &#x41D;&#x435;&#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x447;&#x438; &#x437;&#x456;&#x440;&#x43E;&#x447;&#x43A;&#x430; &#x441;&#x442;&#x43E;&#x457;&#x442;&#x44C; &#x432;&#x456;&#x434;&#x440;&#x430;&#x437;&#x443; &#x43F;&#x456;&#x441;&#x43B;&#x44F; <code>function</code>, &#x447;&#x438; &#x43C;&#x456;&#x436; &#x43D;&#x438;&#x43C; &#x442;&#x430; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x43C; <code>*</code> &#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x436;&#x43A;&#x438;, &#x43E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;</span>
<span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createIterator</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">yield</span> <span class="hljs-number">1</span>;
    <span class="hljs-keyword">yield</span> <span class="hljs-number">2</span>;
    <span class="hljs-keyword">yield</span> <span class="hljs-number">3</span>;
}

<span class="hljs-comment">// &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x430;&#x43B;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;</span>
<span class="hljs-keyword">let</span> iterator = createIterator();

<span class="hljs-built_in">console</span>.log(iterator.next().value);     <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(iterator.next().value);     <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(iterator.next().value);     <span class="hljs-comment">// 3</span>
</code></pre>
<p>&#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B; <code>*</code> &#x43F;&#x435;&#x440;&#x435;&#x434; <code>createIterator()</code> &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x446;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C;. &#x41A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>yield</code> &#x454; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43D;&#x43E;&#x432;&#x438;&#x43C; &#x443; ECMAScript 6 &#x456; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x456; &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x43E;&#x43C;&#x443; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x443; &#x441;&#x43B;&#x456;&#x434; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>next()</code> &#x443; &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44C;. &#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x449;&#x43E; &#x431;&#x443;&#x432; &#x437;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x43C;&#x430;&#x454; &#x442;&#x440;&#x438; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>next()</code>: &#x43F;&#x435;&#x440;&#x448;&#x435; <code>1</code>, &#x434;&#x440;&#x443;&#x433;&#x435; <code>2</code> &#x442;&#x430; &#x442;&#x440;&#x435;&#x442;&#x454; <code>3</code>. &#x413;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x456; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x430; &#x456;&#x43D;&#x448;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x449;&#x43E; &#x456; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x43F;&#x440;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x456; <code>iterator</code>.</p>
<p>&#x41C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x43D;&#x430;&#x439;&#x446;&#x456;&#x43A;&#x430;&#x432;&#x456;&#x448;&#x438;&#x43C; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x43E;&#x43C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x437;&#x443;&#x43F;&#x438;&#x43D;&#x44F;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>yield</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; <code>yield 1</code> &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454; &#x43D;&#x456;&#x447;&#x43E;&#x433;&#x43E; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E;, &#x434;&#x43E;&#x43A;&#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>next()</code>. &#x41B;&#x438;&#x448;&#x435; &#x442;&#x43E;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>yield 2</code>. &#x422;&#x430;&#x43A;&#x430; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x443;&#x43F;&#x438;&#x43D;&#x43A;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x454; &#x43D;&#x430;&#x434;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x43E;&#x44E; &#x456; &#x43C;&#x430;&#x454; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x446;&#x456;&#x43A;&#x430;&#x432;&#x438;&#x445; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x443;&#x432;&#x430;&#x43D;&#x44C; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;&#x445;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x445; (&#x43F;&#x440;&#x43E; &#x446;&#x435; &#x43F;&#x456;&#x434;&#x435; &#x43C;&#x43E;&#x432;&#x430; &#x443; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456; &#xAB;&#x420;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;&#xBB;).</p>
<p>&#x41A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>yield</code> &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x43E;&#x43C;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x449;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x454; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x443; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x431;&#x435;&#x437; &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x43E;&#x434;&#x438;&#x43D; &#x437;&#x430; &#x43E;&#x434;&#x43D;&#x438;&#x43C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43E;&#x441;&#x44C; &#x43E;&#x434;&#x438;&#x43D; &#x437;&#x456; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x456;&#x432; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>yield</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x446;&#x438;&#x43A;&#x43B;&#x443; <code>for</code>:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createIterator</span>(<span class="hljs-params">items</span>) </span>{
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; items.length; i++) {
        <span class="hljs-keyword">yield</span> items[i];
    }
}

<span class="hljs-keyword">let</span> iterator = createIterator([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>]);

<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 1, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 2, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 3, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: undefined, done: true }&quot;</span>

<span class="hljs-comment">// &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: undefined, done: true }&quot;</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>createIterator()</code> &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432; <code>items</code>. &#x412;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x446;&#x438;&#x43A;&#x43B; <code>for</code> &#x432;&#x456;&#x434;&#x434;&#x430;&#x454; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x432; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43F;&#x43E; &#x43C;&#x456;&#x440;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x446;&#x438;&#x43A;&#x43B;&#x443;. &#x429;&#x43E;&#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x437;&#x443;&#x441;&#x442;&#x440;&#x456;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>yield</code>, &#x446;&#x438;&#x43A;&#x43B; &#x437;&#x443;&#x43F;&#x438;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x456; &#x449;&#x43E;&#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x434;&#x43B;&#x44F; <code>iterator</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>next()</code>, &#x446;&#x438;&#x43A;&#x43B; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>yield</code>.</p>
<p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x454; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C; &#x43D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; ECMAScript 6, &#x456; &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x446;&#x435; &#x432;&#x441;&#x44C;&#x43E;&#x433;&#x43E; &#x43B;&#x438;&#x448;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x443; &#x442;&#x43E;&#x43C;&#x443; &#x436; &#x43C;&#x456;&#x441;&#x446;&#x456;, &#x434;&#x435; &#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;. &#x420;&#x435;&#x448;&#x442;&#x430; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x443; &#x444;&#x43E;&#x43A;&#x443;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x430;&#x445; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43D;&#x44F; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;.</p>
<p>W&gt; &#x41A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>yield</code> &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43B;&#x438;&#x448;&#x435; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>yield</code> &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x434;&#x435;, &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x447;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;, &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x434;&#x435; &#x434;&#x43E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x457; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createIterator</span>(<span class="hljs-params">items</span>) </span>{

    items.forEach(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">item</span>) </span>{

        <span class="hljs-comment">// &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;</span>
        <span class="hljs-keyword">yield</span> item + <span class="hljs-number">1</span>;
    });
}
</code></pre>
<p>W&gt; &#x41D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x445;&#x43E;&#x447;&#x430; &#x439; <code>yield</code> &#x442;&#x435;&#x445;&#x43D;&#x456;&#x447;&#x43D;&#x43E; &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; <code>createIterator()</code>, &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x443; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; <code>yield</code> &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x438;&#x43D;&#x430;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x43C;&#x435;&#x436;&#x456;. &#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, <code>yield</code> &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x43D;&#x430; <code>return</code> &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x443; &#x44F;&#x43A;&#x456;&#x439; &#x432;&#x43E;&#x43D;&#x430; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F;.</p>
<h3 id="&#x432;&#x438;&#x440;&#x430;&#x437;-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;">&#x412;&#x438;&#x440;&#x430;&#x437; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;</h3>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x448;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x437;&#x456;&#x440;&#x43E;&#x447;&#x43A;&#x438; (<code>*</code>) &#x43C;&#x456;&#x436; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x438;&#x43C; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>function</code> &#x442;&#x430; &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x44E;&#x447;&#x43E;&#x44E; &#x43A;&#x440;&#x443;&#x433;&#x43B;&#x43E;&#x44E; &#x434;&#x443;&#x436;&#x43A;&#x43E;&#x44E;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> createIterator = <span class="hljs-function"><span class="hljs-keyword">function</span> *(<span class="hljs-params">items</span>) </span>{
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; items.length; i++) {
        <span class="hljs-keyword">yield</span> items[i];
    }
};

<span class="hljs-keyword">let</span> iterator = createIterator([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>]);

<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 1, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 2, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 3, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: undefined, done: true }&quot;</span>

<span class="hljs-comment">// &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: undefined, done: true }&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, <code>createIterator()</code> &#x454; &#x432;&#x438;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;. &#x417;&#x456;&#x440;&#x43E;&#x447;&#x43A;&#x430; &#x440;&#x43E;&#x437;&#x442;&#x430;&#x448;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x43C;&#x456;&#x436; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x438;&#x43C; &#x441;&#x43B;&#x43E;&#x432;&#x43E;&#x43C; <code>function</code> &#x442;&#x430; &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x44E;&#x447;&#x43E;&#x44E; &#x43A;&#x440;&#x443;&#x433;&#x43B;&#x43E;&#x44E; &#x434;&#x443;&#x436;&#x43A;&#x43E;&#x44E;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x454; &#x430;&#x43D;&#x43E;&#x43D;&#x456;&#x43C;&#x43D;&#x438;&#x43C;. &#x412;&#x441;&#x435; &#x456;&#x43D;&#x448;&#x435; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x454; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x436;&#x435;, &#x44F;&#x43A; &#x456; &#x432; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x439; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; <code>createIterator()</code>, &#x44F;&#x43A;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x446;&#x438;&#x43A;&#x43B; <code>for</code>.</p>
<p>I&gt; &#x421;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; arrow&#x2013;&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x44F;&#x43A;&#x430; &#x431;&#x443;&#x434;&#x435; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C; - &#x43D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;-&#x432;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x430;&#x445;">&#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x445;</h3>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x454; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x43C;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;&#x43C;&#x438;, &#x457;&#x445; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x43C;&#x443; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456; &#x432; &#x441;&#x442;&#x438;&#x43B;&#x456; ECMAScript 5 &#x447;&#x435;&#x440;&#x435;&#x437; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> o = {

    createIterator: <span class="hljs-function"><span class="hljs-keyword">function</span> *(<span class="hljs-params">items</span>) </span>{
        <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; items.length; i++) {
            <span class="hljs-keyword">yield</span> items[i];
        }
    }
};

<span class="hljs-keyword">let</span> iterator = o.createIterator([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>]);
</code></pre>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x43B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x437; ECMAScript 6, &#x434;&#x43E;&#x434;&#x430;&#x432;&#x448;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x456;&#x43C;&#x2019;&#x44F;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x437;&#x456;&#x440;&#x43E;&#x447;&#x43A;&#x443; (<code>*</code>):</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> o = {

    *createIterator(items) {
        <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i = <span class="hljs-number">0</span>; i &lt; items.length; i++) {
            <span class="hljs-keyword">yield</span> items[i];
        }
    }
};

<span class="hljs-keyword">let</span> iterator = o.createIterator([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>]);
</code></pre>
<p>&#x426;&#x456; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x456; &#x434;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x443; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456; &#xAB;&#x412;&#x438;&#x440;&#x430;&#x437; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#xBB; - &#x432;&#x43E;&#x43D;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;. &#x423; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x437; &#x43B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x438;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43C;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>createIterator()</code> &#x437;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x439; &#x431;&#x435;&#x437; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>function</code>, &#x437;&#x456;&#x440;&#x43E;&#x447;&#x43A;&#x430; &#x440;&#x43E;&#x437;&#x442;&#x430;&#x448;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x440;&#x430;&#x437;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x456;&#x43C;&#x2019;&#x44F;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443;, &#x430;&#x43B;&#x435; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x431;&#x456;&#x43B; &#x43C;&#x456;&#x436; &#x43D;&#x438;&#x43C;&#x438;.</p>
<h2 id="&#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x456;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x438;-&#x442;&#x430;-for-of">&#x406;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x442;&#x430; for-of</h2>
<p>&#x414;&#x443;&#x436;&#x435; &#x431;&#x43B;&#x438;&#x437;&#x44C;&#x43A;&#x438;&#x43C;&#x438; &#x434;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x454; <em>&#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; (iterable)</em> &#x2014; &#x446;&#x435; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x437; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; <code>Symbol.iterator</code>. &#x414;&#x43E;&#x431;&#x440;&#x435;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; <code>Symbol.iterator</code> &#x437;&#x430;&#x434;&#x430;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x434;&#x43B;&#x44F; &#x434;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;. &#x412;&#x441;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439; (&#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;, &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x442;&#x430; &#x43C;&#x430;&#x43F;&#x438;) &#x442;&#x430; &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x432; ECMAScript 6, &#x442;&#x43E;&#x431;&#x442;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;. &#x406;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x441;&#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x437; &#x43D;&#x43E;&#x432;&#x438;&#x43C; &#x434;&#x43E;&#x43F;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x443; ECMAScript: &#x446;&#x438;&#x43A;&#x43B;&#x43E;&#x43C; <code>for-of</code>.</p>
<p>I&gt; &#x412;&#x441;&#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;, &#x44F;&#x43A;&#x456; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x456; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;, &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438;, &#x431;&#x43E; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x44E;&#x442;&#x44C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.iterator</code>.</p>
<p>&#x41D;&#x430; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x446;&#x456;&#x454;&#x457; &#x433;&#x43B;&#x430;&#x432;&#x438; &#x44F; &#x437;&#x433;&#x430;&#x434;&#x430;&#x432; &#x43F;&#x440;&#x43E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443; &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x446;&#x438;&#x43A;&#x43B;&#x443; <code>for</code>. &#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x454; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; &#x432;&#x438;&#x440;&#x456;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x456;&#x454;&#x457; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438;. &#x426;&#x438;&#x43A;&#x43B; <code>for-of</code> &#x454; &#x456;&#x43D;&#x448;&#x43E;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E;: &#x437; &#x43D;&#x438;&#x43C; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x441;&#x43B;&#x456;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x43E;&#x43C; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457;, &#x456; &#x446;&#x435; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x441;&#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43D;&#x442;&#x440;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x456; &#x437; &#x457;&#x457; &#x432;&#x43C;&#x456;&#x441;&#x442;&#x43E;&#x43C;.</p>
<p>&#x426;&#x438;&#x43A;&#x43B; <code>for-of</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; <code>next()</code> &#x432; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x442;&#x430; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; <code>value</code> &#x437; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; &#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443;. &#x426;&#x438;&#x43A;&#x43B; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x43F;&#x43E;&#x43A;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>done</code> &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; <code>true</code>. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> values = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>];

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> num <span class="hljs-keyword">of</span> values) {
    <span class="hljs-built_in">console</span>.log(num);
}
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435;:</p>
<pre><code>1
2
3
</code></pre><p>&#x426;&#x435;&#x439; &#x446;&#x438;&#x43A;&#x43B; <code>for-of</code> &#x441;&#x43F;&#x435;&#x440;&#x448;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Symbol.iterator</code> &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; <code>values</code>, &#x449;&#x43E;&#x431; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; (&#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>Symbol.iterator</code> &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430; &#x43A;&#x443;&#x43B;&#x456;&#x441;&#x430;&#x43C;&#x438; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; &#x440;&#x443;&#x448;&#x456;&#x44F; JavaScript.) &#x422;&#x43E;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>iterator.next()</code>, &#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>value</code> &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;, &#x447;&#x438;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; <code>num</code>. &#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>num</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; 1, &#x43F;&#x43E;&#x442;&#x456;&#x43C; 2 &#x456; &#x43D;&#x430;&#x440;&#x435;&#x448;&#x442;&#x456; 3. &#x41A;&#x43E;&#x43B;&#x438; <code>done</code> &#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x431;&#x443;&#x434;&#x435; <code>true</code>, &#x446;&#x438;&#x43A;&#x43B; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x443;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;, &#x442;&#x43E;&#x43C;&#x443; <code>num</code> &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>undefined</code>.</p>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x443;&#x454;&#x442;&#x435;&#x441;&#x44C; &#x43F;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x445; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x430;&#x431;&#x43E; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457;, &#x442;&#x43E;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x446;&#x438;&#x43A;&#x43B;&#x443; <code>for-of</code> &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x438;&#x43A;&#x43B;&#x443; <code>for</code> &#x431;&#x443;&#x434;&#x435; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x43E;&#x44E; &#x456;&#x434;&#x435;&#x454;&#x44E;. &#x426;&#x438;&#x43A;&#x43B; <code>for-of</code> &#x441;&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x44F;&#x454; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x43E;&#x43C; &#x43C;&#x435;&#x43D;&#x448;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x44F;&#x43A;&#x438; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x441;&#x43B;&#x456;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430; &#x43C;&#x435;&#x43D;&#x448;&#x43E;&#x44E; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44E; &#x443;&#x43C;&#x43E;&#x432;. &#x417;&#x430;&#x43B;&#x438;&#x448;&#x442;&#x435; &#x442;&#x440;&#x430;&#x434;&#x438;&#x446;&#x456;&#x439;&#x43D;&#x438;&#x439; &#x446;&#x438;&#x43A;&#x43B; <code>for</code> &#x434;&#x43B;&#x44F; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x438;&#x445; &#x43A;&#x435;&#x440;&#x443;&#x44E;&#x447;&#x438;&#x445; &#x443;&#x43C;&#x43E;&#x432;.</p>
<p>W&gt; &#x41E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>for-of</code> &#x43A;&#x438;&#x43D;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x43F;&#x440;&#x438; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x437; &#x43D;&#x435;&#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C;, <code>null</code> &#x430;&#x431;&#x43E; <code>undefined</code>.</p>
<h3 id="&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;-&#x434;&#x43E;-&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;-&#x437;&#x430;-&#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;">&#x414;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;</h3>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44C; <code>Symbol.iterator</code> &#x434;&#x43B;&#x44F; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x434;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> values = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>];
<span class="hljs-keyword">let</span> iterator = values[<span class="hljs-built_in">Symbol</span>.iterator]();

<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 1, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 2, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 3, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: undefined, done: true }&quot;</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; <code>values</code> &#x442;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x439;&#x43E;&#x433;&#x43E; &#x434;&#x43B;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x426;&#x435; &#x442;&#x43E;&#x439; &#x436;&#x435; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430; &#x43A;&#x443;&#x43B;&#x456;&#x441;&#x430;&#x43C;&#x438; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x446;&#x438;&#x43A;&#x43B;&#x443; <code>for-of</code>.</p>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>Symbol.iterator</code> &#x437;&#x430;&#x434;&#x430;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438;, &#x447;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">isIterable</span>(<span class="hljs-params">object</span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">typeof</span> object[<span class="hljs-built_in">Symbol</span>.iterator] === <span class="hljs-string">&quot;function&quot;</span>;
}

<span class="hljs-built_in">console</span>.log(isIterable([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>]));     <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(isIterable(<span class="hljs-string">&quot;Hello&quot;</span>));       <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(isIterable(<span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>()));     <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(isIterable(<span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>()));     <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(isIterable(<span class="hljs-keyword">new</span> <span class="hljs-built_in">WeakMap</span>())); <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(isIterable(<span class="hljs-keyword">new</span> <span class="hljs-built_in">WeakSet</span>())); <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; <code>isIterable()</code> &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x454;, &#x447;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x456; &#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E;. &#x426;&#x438;&#x43A;&#x43B; <code>for-of</code> &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x443; &#x436; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;.</p>
<p>&#x420;&#x430;&#x43D;&#x456;&#x448;&#x435; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456; &#x431;&#x443;&#x43B;&#x43E; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>Symbol.iterator</code> &#x437; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.iterator</code> &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x445; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;.</p>
<h3 id="&#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;-&#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x445;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x456;&#x432;">&#x421;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;</h3>
<p>&#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;, &#x449;&#x43E; &#x431;&#x443;&#x43B;&#x438; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x456; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C;&#x438;, &#x43D;&#x435; &#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x430;&#x43B;&#x435; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x457;&#x445; &#x442;&#x430;&#x43A;&#x438;&#x43C;&#x438; &#x447;&#x435;&#x440;&#x435;&#x437; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>Symbol.iterator</code>, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> collection = {
    items: [],
    *[<span class="hljs-built_in">Symbol</span>.iterator]() {
        <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> item <span class="hljs-keyword">of</span> <span class="hljs-keyword">this</span>.items) {
            <span class="hljs-keyword">yield</span> item;
        }
    }

};

collection.items.push(<span class="hljs-number">1</span>);
collection.items.push(<span class="hljs-number">2</span>);
collection.items.push(<span class="hljs-number">3</span>);

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> x <span class="hljs-keyword">of</span> collection) {
    <span class="hljs-built_in">console</span>.log(x);
}
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435;:</p>
<pre><code>1
2
3
</code></pre><p>&#x421;&#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; <code>collection</code>. &#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Symbol.iterator</code>, &#x44F;&#x43A;&#x438;&#x439; &#x454; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C; (&#x437;&#x432;&#x435;&#x440;&#x43D;&#x456;&#x442;&#x44C; &#x443;&#x432;&#x430;&#x433;&#x443;, &#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x456;&#x43C;&#x2019;&#x44F;&#x43C; &#x441;&#x442;&#x43E;&#x457;&#x442;&#x44C; &#x437;&#x456;&#x440;&#x43E;&#x447;&#x43A;&#x430;). &#x413;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x446;&#x438;&#x43A;&#x43B; <code>for-of</code> &#x434;&#x43B;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x442;&#x430; <code>yield</code> - &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x433;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;, &#x44F;&#x43A;&#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; <code>collection</code> &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;, &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>collection</code> &#x43F;&#x43E;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432; <code>this.items</code>, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454; &#x446;&#x44E; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443;.</p>
<p>I&gt; &#x414;&#x430;&#x43B;&#x456; &#x443; &#x446;&#x456;&#x439; &#x433;&#x43B;&#x430;&#x432;&#x456; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B; &#xAB;&#x414;&#x435;&#x43B;&#x435;&#x433;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;&#xBB; &#x43E;&#x43F;&#x438;&#x441;&#x443;&#x454; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x43F;&#x456;&#x434;&#x445;&#x43E;&#x434;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;.</p>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440; &#x432;&#x438; &#x43F;&#x43E;&#x431;&#x430;&#x447;&#x438;&#x43B;&#x438; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x456;&#x432; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x430;&#x43B;&#x435; &#x454; &#x43D;&#x430;&#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x443; ECMAScript 6 &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;, &#x449;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443; &#x437; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x44F;&#x43C;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x43E;&#x44E;.</p>
<h2 id="&#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456;-&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;">&#x412;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;</h2>
<p>&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x454; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; ECMAScript 6, &#x456;, &#x44F;&#x43A; &#x441;&#x43B;&#x456;&#x434; &#x437;&#x434;&#x43E;&#x433;&#x430;&#x434;&#x430;&#x442;&#x438;&#x441;&#x44C;, &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x434;&#x43B;&#x44F; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432;: &#x43C;&#x43E;&#x432;&#x430; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x454; &#x457;&#x445; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x412;&#x430;&#x43C; &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x43D;&#x430;&#x434;&#x43E;&#x431;&#x438;&#x442;&#x438;&#x441;&#x44C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x445; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x43B;&#x438;&#x448;&#x435; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43D;&#x435; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x442;&#x438;&#x43C;&#x443;&#x442;&#x44C; &#x432;&#x430;&#x448;&#x438;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x430;&#x43C;, &#x449;&#x43E; &#x43D;&#x430;&#x439;&#x447;&#x430;&#x441;&#x442;&#x456;&#x448;&#x435; &#x441;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x435; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x430;&#x431;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x438;. &#x412; &#x456;&#x43D;&#x448;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x443; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x456; &#x441;&#x432;&#x43E;&#x454;&#x457; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x43A;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;. &#x41C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43F;&#x43E;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x43C;&#x438; &#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x44F;&#x43C;&#x438;.</p>
<h3 id="&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;-&#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439;">&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439;</h3>
<p>ECMAScript 6 &#x43C;&#x430;&#x454; &#x442;&#x440;&#x438; &#x442;&#x438;&#x43F;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;&#x2013;&#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439;: &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;, &#x43C;&#x430;&#x43F;&#x438; &#x442;&#x430; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;. &#x414;&#x43B;&#x44F; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x457;&#x445;&#x43D;&#x456;&#x43C; &#x432;&#x43C;&#x456;&#x441;&#x442;&#x43E;&#x43C; &#x432;&#x441;&#x456; &#x442;&#x440;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x456; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;:</p>
<ul>
<li><code>entries()</code> - &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x430;&#x440;&#x438; &#x201C;&#x43A;&#x43B;&#x44E;&#x447;&#x2013;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x201D;;</li>
<li><code>values()</code> - &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457;;</li>
<li><code>keys()</code> - &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x43C;&#x438;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457;;</li>
</ul>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457; &#x447;&#x435;&#x440;&#x435;&#x437; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x437; &#x446;&#x438;&#x445; &#x442;&#x440;&#x44C;&#x43E;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;.</p>
<h4 id="&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;-entries">&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; entries()</h4>
<p>&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>entries()</code> &#x43F;&#x440;&#x438; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>next()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x434;&#x432;&#x43E;&#x445;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x414;&#x432;&#x43E;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x454; &#x43A;&#x43B;&#x44E;&#x447; &#x442;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457;. &#x414;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x431;&#x443;&#x434;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x439; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;; &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x431;&#x443;&#x434;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; (&#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x443; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x430;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x443;&#x431;&#x43B;&#x44E;&#x44E;&#x442;&#x44C; &#x43A;&#x43B;&#x44E;&#x447;&#x456;); &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x43F; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x431;&#x443;&#x434;&#x435; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C;.</p>
<p>&#x41E;&#x441;&#x44C; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;&#x432; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> colors = [ <span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span>, <span class="hljs-string">&quot;blue&quot;</span> ];
<span class="hljs-keyword">let</span> tracking = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>([<span class="hljs-number">1234</span>, <span class="hljs-number">5678</span>, <span class="hljs-number">9012</span>]);
<span class="hljs-keyword">let</span> data = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>();

data.set(<span class="hljs-string">&quot;title&quot;</span>, <span class="hljs-string">&quot;Understanding ECMAScript 6&quot;</span>);
data.set(<span class="hljs-string">&quot;format&quot;</span>, <span class="hljs-string">&quot;ebook&quot;</span>);

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> entry <span class="hljs-keyword">of</span> colors.entries()) {
    <span class="hljs-built_in">console</span>.log(entry);
}

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> entry <span class="hljs-keyword">of</span> tracking.entries()) {
    <span class="hljs-built_in">console</span>.log(entry);
}

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> entry <span class="hljs-keyword">of</span> data.entries()) {
    <span class="hljs-built_in">console</span>.log(entry);
}
</code></pre>
<p>&#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; <code>console.log()</code> &#x434;&#x430;&#x44E;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x432;&#x456;&#x434;:</p>
<pre><code>[0, &quot;red&quot;]
[1, &quot;green&quot;]
[2, &quot;blue&quot;]
[1234, 1234]
[5678, 5678]
[9012, 9012]
[&quot;title&quot;, &quot;Understanding ECMAScript 6&quot;]
[&quot;format&quot;, &quot;ebook&quot;]
</code></pre><p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430; <code>entries()</code> &#x442;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x446;&#x438;&#x43A;&#x43B; <code>for-of</code> &#x434;&#x43B;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;. &#x412;&#x438;&#x432;&#x456;&#x434; &#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x44C; &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x454;, &#x44F;&#x43A;&#x456; &#x43F;&#x430;&#x440;&#x438; &#x43A;&#x43B;&#x44E;&#x447;&#x456;&#x432; &#x442;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;.</p>
<h4 id="&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;-values">&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; values()</h4>
<p>&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>values()</code> &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430;&#x43A;, &#x44F;&#x43A; &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x44E;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> colors = [ <span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span>, <span class="hljs-string">&quot;blue&quot;</span> ];
<span class="hljs-keyword">let</span> tracking = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>([<span class="hljs-number">1234</span>, <span class="hljs-number">5678</span>, <span class="hljs-number">9012</span>]);
<span class="hljs-keyword">let</span> data = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>();

data.set(<span class="hljs-string">&quot;title&quot;</span>, <span class="hljs-string">&quot;Understanding ECMAScript 6&quot;</span>);
data.set(<span class="hljs-string">&quot;format&quot;</span>, <span class="hljs-string">&quot;ebook&quot;</span>);

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> value <span class="hljs-keyword">of</span> colors.values()) {
    <span class="hljs-built_in">console</span>.log(value);
}

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> value <span class="hljs-keyword">of</span> tracking.values()) {
    <span class="hljs-built_in">console</span>.log(value);
}

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> value <span class="hljs-keyword">of</span> data.values()) {
    <span class="hljs-built_in">console</span>.log(value);
}
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435; &#x442;&#x430;&#x43A;&#x435;:</p>
<pre><code>&quot;red&quot;
&quot;green&quot;
&quot;blue&quot;
1234
5678
9012
&quot;Understanding ECMAScript 6&quot;
&quot;ebook&quot;
</code></pre><p>&#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>values()</code>, &#x44F;&#x43A; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x441;&#x430;&#x43C;&#x435; &#x442;&#x456; &#x434;&#x430;&#x43D;&#x456;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43A;&#x43E;&#x436;&#x43D;&#x456;&#x439; &#x437; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439; &#x431;&#x435;&#x437; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x43E;&#x457; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x457; &#x43F;&#x440;&#x43E; &#x442;&#x435;, &#x434;&#x435; &#x446;&#x456; &#x434;&#x430;&#x43D;&#x456; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457;.</p>
<h4 id="&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;-keys">&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; keys()</h4>
<p>&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>keys()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x432;&#x441;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x441;&#x443;&#x442;&#x43D;&#x456; &#x443; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457;. &#x414;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x446;&#x435; &#x43B;&#x438;&#x448;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;, &#x430; &#x43D;&#x435; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x414;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x446;&#x435; &#x43A;&#x43B;&#x44E;&#x447;&#x456;, &#x44F;&#x43A;&#x456; &#x454; &#x43E;&#x434;&#x43D;&#x43E;&#x447;&#x430;&#x441;&#x43D;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;, &#x456; &#x442;&#x43E;&#x43C;&#x443; <code>keys()</code> &#x442;&#x430; <code>values()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C; &#x43E;&#x434;&#x438;&#x43D; &#x456; &#x442;&#x43E;&#x439; &#x436;&#x435; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;. &#x414;&#x43B;&#x44F; &#x43C;&#x430;&#x43F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>keys()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43A;&#x43B;&#x44E;&#x447;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x449;&#x43E; &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x454; &#x432;&#x441;&#x456; &#x442;&#x440;&#x438; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x438;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> colors = [ <span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span>, <span class="hljs-string">&quot;blue&quot;</span> ];
<span class="hljs-keyword">let</span> tracking = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>([<span class="hljs-number">1234</span>, <span class="hljs-number">5678</span>, <span class="hljs-number">9012</span>]);
<span class="hljs-keyword">let</span> data = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>();

data.set(<span class="hljs-string">&quot;title&quot;</span>, <span class="hljs-string">&quot;Understanding ECMAScript 6&quot;</span>);
data.set(<span class="hljs-string">&quot;format&quot;</span>, <span class="hljs-string">&quot;ebook&quot;</span>);

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> key <span class="hljs-keyword">of</span> colors.keys()) {
    <span class="hljs-built_in">console</span>.log(key);
}

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> key <span class="hljs-keyword">of</span> tracking.keys()) {
    <span class="hljs-built_in">console</span>.log(key);
}

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> key <span class="hljs-keyword">of</span> data.keys()) {
    <span class="hljs-built_in">console</span>.log(key);
}
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x434;&#x430;&#x454; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x432;&#x456;&#x434;:</p>
<pre><code>0
1
2
1234
5678
9012
&quot;title&quot;
&quot;format&quot;
</code></pre><p>&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>keys()</code> &#x437;&#x447;&#x438;&#x442;&#x443;&#x454; &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x43A;&#x43B;&#x44E;&#x447; &#x443; <code>colors</code>, <code>tracking</code> &#x442;&#x430; <code>data</code>, &#x456; &#x446;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x442;&#x440;&#x44C;&#x43E;&#x445; &#x446;&#x438;&#x43A;&#x43B;&#x430;&#x445; <code>for-of</code>. &#x414;&#x43B;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;&#x2013;&#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43B;&#x438;&#x448;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x456; &#x43A;&#x43B;&#x44E;&#x447;&#x456;, &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x441;&#x442;&#x435; &#x456;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x426;&#x435; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x446;&#x438;&#x43A;&#x43B; <code>for-in</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x446;&#x438;&#x43A;&#x43B; <code>for-in</code> &#x456;&#x442;&#x435;&#x440;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x435; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438;, &#x449;&#x43E; &#x454; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x430;&#x43C;&#x438;.</p>
<h4 id="&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;-&#x437;&#x430;-&#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;-&#x434;&#x43B;&#x44F;-&#x442;&#x438;&#x43F;&#x456;&#x432;-&#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439;">&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439;</h4>
<p>&#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x442;&#x438;&#x43F; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x454; &#x441;&#x432;&#x456;&#x439; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x439; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; <code>for-of</code> &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43D;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x439; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>values()</code> &#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x442;&#x430; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;, &#x442;&#x43E;&#x434;&#x456; &#x44F;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>entries()</code> &#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x43F;. &#x426;&#x435; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;&#x2013;&#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439; &#x443; &#x446;&#x438;&#x43A;&#x43B;&#x430;&#x445; <code>for-of</code> &#x442;&#x440;&#x456;&#x448;&#x43A;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C;. &#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> colors = [ <span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span>, <span class="hljs-string">&quot;blue&quot;</span> ];
<span class="hljs-keyword">let</span> tracking = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>([<span class="hljs-number">1234</span>, <span class="hljs-number">5678</span>, <span class="hljs-number">9012</span>]);
<span class="hljs-keyword">let</span> data = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>();

data.set(<span class="hljs-string">&quot;title&quot;</span>, <span class="hljs-string">&quot;Understanding ECMAScript 6&quot;</span>);
data.set(<span class="hljs-string">&quot;format&quot;</span>, <span class="hljs-string">&quot;print&quot;</span>);

<span class="hljs-comment">// &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435;, &#x449;&#x43E; &#x439; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; colors.values()</span>
<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> value <span class="hljs-keyword">of</span> colors) {
    <span class="hljs-built_in">console</span>.log(value);
}

<span class="hljs-comment">// &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435;, &#x449;&#x43E; &#x439; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; tracking.values()</span>
<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> num <span class="hljs-keyword">of</span> tracking) {
    <span class="hljs-built_in">console</span>.log(num);
}

<span class="hljs-comment">// &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435;, &#x449;&#x43E; &#x439; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; data.entries()</span>
<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> entry <span class="hljs-keyword">of</span> data) {
    <span class="hljs-built_in">console</span>.log(entry);
}
</code></pre>
<p>&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43D;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x439;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439;&#x2013;&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x442;&#x430; &#x43C;&#x430;&#x43F; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x438;&#x439;, &#x449;&#x43E;&#x431; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x442;&#x438; &#x442;&#x435;, &#x44F;&#x43A; &#x446;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F;, &#x442;&#x43E;&#x43C;&#x443; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43E;&#x441;&#x44C; &#x446;&#x435;:</p>
<pre><code>&quot;red&quot;
&quot;green&quot;
&quot;blue&quot;
1234
5678
9012
[&quot;title&quot;, &quot;Understanding ECMAScript 6&quot;]
[&quot;format&quot;, &quot;print&quot;]
</code></pre><p>&#x41C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x442;&#x430; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x457; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x442;&#x43E;&#x434;&#x456; &#x44F;&#x43A; &#x43C;&#x430;&#x43F;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x443; &#x442;&#x43E;&#x43C;&#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x457;&#x445; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Map</code>. &#x417; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x431;&#x43E;&#x43A;&#x443;, &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x442;&#x430; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x456; &#x43C;&#x430;&#x43F;&#x438; &#x43D;&#x435; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;. &#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x430; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x438;&#x445; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x44C; &#x43D;&#x435; &#x434;&#x430;&#x454; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x443; &#x434;&#x456;&#x437;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44C;, &#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x454; &#x443; &#x446;&#x438;&#x445; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x44F;&#x445;, &#x449;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x443; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x43F;&#x43E; &#x43D;&#x438;&#x445;.</p>
<h3 id="a-&#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x442;&#x430;-&#x446;&#x438;&#x43A;&#x43B;&#x438;-for-of">A&gt; &#x414;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x446;&#x438;&#x43A;&#x43B;&#x438; for-of</h3>
<p>A&gt; &#x41F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x43F; &#x454; &#x434;&#x443;&#x436;&#x435; &#x437;&#x440;&#x443;&#x447;&#x43D;&#x43E;&#x44E; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x446;&#x438;&#x43A;&#x43B;&#x443; <code>for-of</code> &#x437; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x44F;&#x43A; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> data = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>();

data.set(<span class="hljs-string">&quot;title&quot;</span>, <span class="hljs-string">&quot;Understanding ECMAScript 6&quot;</span>);
data.set(<span class="hljs-string">&quot;format&quot;</span>, <span class="hljs-string">&quot;ebook&quot;</span>);

<span class="hljs-comment">// &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435;, &#x449;&#x43E; &#x439; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; data.entries()</span>
<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> [key, value] <span class="hljs-keyword">of</span> data) {
    <span class="hljs-built_in">console</span>.log(key + <span class="hljs-string">&quot;=&quot;</span> + value);
}
</code></pre>
<p>A&gt; &#x426;&#x438;&#x43A;&#x43B; <code>for-of</code> &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x449;&#x43E;&#x431; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>key</code> &#x442;&#x430; <code>value</code> &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x443; &#x43C;&#x430;&#x43F;&#x456;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x43E;&#x434;&#x43D;&#x43E;&#x447;&#x430;&#x441;&#x43D;&#x43E; &#x431;&#x435;&#x437; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x438; &#x432;&#x438;&#x442;&#x44F;&#x433;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x434;&#x432;&#x43E;&#x445;&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x430;&#x431;&#x43E; &#x434;&#x456;&#x441;&#x442;&#x430;&#x432;&#x430;&#x442;&#x438; &#x437; &#x43C;&#x430;&#x43F;&#x438; &#x43A;&#x43B;&#x44E;&#x447; &#x447;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x43F; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x446;&#x438;&#x43A;&#x43B;&#x443; <code>for-of</code> &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x43F; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x436;&#x435; &#x437;&#x440;&#x443;&#x447;&#x43D;&#x438;&#x43C;, &#x44F;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;.</p>
<h3 id="&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x456;-&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;">&#x420;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;</h3>
<p>&#x41F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; &#x440;&#x435;&#x43B;&#x456;&#x437;&#x443; ECMAScript 5, &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x443; JavaScript &#x43F;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43E;&#x432;&#x43E; &#x441;&#x442;&#x430;&#x432;&#x430;&#x43B;&#x438; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x43C;&#x438; &#x43D;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, ECMAScript 5 &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x432; &#x437;&#x430;&#x43F;&#x438;&#x441; &#x437; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x443;&#x436;&#x43A;&#x430;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x443; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x445; ((&#x44F;&#x43A; &#x43E;&#x442; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; text[0], &#x449;&#x43E;&#x431; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x456; &#x442;.&#x434;.) &#x410;&#x43B;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441; &#x437; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x443;&#x436;&#x43A;&#x430;&#x43C;&#x438; &#x447;&#x430;&#x441;&#x442;&#x456;&#x448;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x437; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x441;&#x43B;&#x43E;&#x432;&#x430;&#x43C;&#x438; (code units), &#x43D;&#x456;&#x436; &#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x456;&#x43D; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x432;&#x43E;&#x445;&#x431;&#x430;&#x439;&#x442;&#x43D;&#x438;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;, &#x449;&#x43E; &#x456; &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x454; &#x446;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> message = <span class="hljs-string">&quot;A &#x20BB7; B&quot;</span>;

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i=<span class="hljs-number">0</span>; i &lt; message.length; i++) {
    <span class="hljs-built_in">console</span>.log(message[i]);
}
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x437;&#x430;&#x43F;&#x438;&#x441; &#x437; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x443;&#x436;&#x43A;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>length</code> &#x434;&#x43B;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x442;&#x430; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x443; Unicode&#x2013;&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443;. &#x412;&#x438;&#x432;&#x456;&#x434; &#x431;&#x443;&#x434;&#x435; &#x434;&#x435;&#x449;&#x43E; &#x43D;&#x435;&#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x439;:</p>
<pre><code>A
(&#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x456;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;)
(&#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x456;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;)
(&#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x456;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;)
(&#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x456;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;)
B
</code></pre><p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x432;&#x43E;&#x445;&#x431;&#x430;&#x439;&#x442;&#x43D;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x442;&#x440;&#x430;&#x43A;&#x442;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x434;&#x432;&#x430; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x438;&#x445; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x445; &#x441;&#x43B;&#x43E;&#x432;&#x430;, &#x43C;&#x456;&#x436; <code>A</code> &#x442;&#x430; <code>B</code> &#x432;&#x438;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x447;&#x43E;&#x442;&#x438;&#x440;&#x438; &#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x438;.</p>
<p>&#x41D;&#x430; &#x449;&#x430;&#x441;&#x442;&#x44F;, ECMAScript 6 &#x43D;&#x430;&#x446;&#x456;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x43D;&#x430; &#x43F;&#x43E;&#x432;&#x43D;&#x443; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x443; Unicode (&#x434;&#x438;&#x432;&#x456;&#x442;&#x44C;&#x441;&#x44F; &#x413;&#x43B;&#x430;&#x432;&#x443; 2), &#x442;&#x43E;&#x43C;&#x443; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x43F;&#x440;&#x43E;&#x431;&#x443;&#x454; &#x432;&#x438;&#x440;&#x456;&#x448;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443; &#x437; &#x456;&#x442;&#x435;&#x440;&#x430;&#x446;&#x456;&#x454;&#x44E; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438;. &#x41C;&#x43E;&#x436;&#x43D;&#x430; &#x437;&#x434;&#x43E;&#x433;&#x430;&#x434;&#x430;&#x442;&#x438;&#x441;&#x44C;, &#x449;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x445; &#x441;&#x43B;&#x456;&#x432;. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x430; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x442;&#x430; &#x446;&#x438;&#x43A;&#x43B; <code>for-of</code>, &#x43C;&#x438; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x454;&#x43C;&#x43E; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43F;&#x440;&#x438;&#x439;&#x43D;&#x44F;&#x442;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x432;&#x456;&#x434;. &#x41E;&#x441;&#x44C; &#x432;&#x438;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> message = <span class="hljs-string">&quot;A &#x20BB7; B&quot;</span>;

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> c <span class="hljs-keyword">of</span> message) {
    <span class="hljs-built_in">console</span>.log(c);
}
</code></pre>
<p>&#x412;&#x456;&#x43D; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435; &#x43E;&#x441;&#x44C; &#x446;&#x435;:</p>
<pre><code>A
(&#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x456;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;)
&#x20BB7;
(&#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x456;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A;)
B
</code></pre><p>&#x422;&#x430;&#x43A;&#x438;&#x439; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x431; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x438; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x456; &#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438;: &#x446;&#x438;&#x43A;&#x43B; &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x43E; &#x432;&#x438;&#x432;&#x456;&#x432; Unicode&#x2013;&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x434;&#x43E;&#x431;&#x440;&#x435;, &#x44F;&#x43A; &#x456; &#x440;&#x435;&#x448;&#x442;&#x443; &#x456;&#x43D;&#x448;&#x438;&#x445;.</p>
<h3 id="&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;-nodelist">&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; NodeList</h3>
<p>&#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x430; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430; (Document Object Model (DOM)) &#x43C;&#x430;&#x454; &#x442;&#x438;&#x43F; <code>NodeList</code>, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x443; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;. &#x414;&#x43B;&#x44F; &#x442;&#x438;&#x445;, &#x445;&#x442;&#x43E; &#x43F;&#x438;&#x448;&#x435; JavaScript &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x443; &#x443; &#x432;&#x435;&#x431;&#x2013;&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445;, &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x456;&#x436; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438; <code>NodeList</code> &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x431;&#x443;&#x43B;&#x43E; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x438;&#x43C;. &#x42F;&#x43A; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; <code>NodeList</code>, &#x442;&#x430;&#x43A; &#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>length</code> &#x434;&#x43B;&#x44F; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;: &#x432;&#x43E;&#x43D;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43E;&#x431;&#x43E;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x437;&#x430;&#x43F;&#x438;&#x441; &#x437; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x443;&#x436;&#x43A;&#x430;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443; &#x434;&#x43E; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x438;&#x445; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;. &#x412;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44C;&#x43E;, &#x43E;&#x434;&#x43D;&#x430;&#x43A;, <code>NodeList</code> &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x2013;&#x440;&#x456;&#x437;&#x43D;&#x43E;&#x43C;&#x443; &#x456; &#x446;&#x435; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x434;&#x43E; &#x43F;&#x43B;&#x443;&#x442;&#x430;&#x43D;&#x438;&#x43D;&#x438;.</p>
<p>&#x417; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x443; ECMAScript 6, DOM &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>NodeList</code> (&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x44E; &#x43C;&#x456;&#x440;&#x43E;&#x44E; &#x446;&#x435; &#x441;&#x442;&#x43E;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; HTML, &#x43D;&#x456;&#x436; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; ECMAScript 6) &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>NodeList</code> &#x443; &#x446;&#x438;&#x43A;&#x43B;&#x456; <code>for-of</code> &#x430;&#x431;&#x43E; &#x432; &#x456;&#x43D;&#x448;&#x43E;&#x43C;&#x443; &#x43C;&#x456;&#x441;&#x446;&#x456;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> divs = <span class="hljs-built_in">document</span>.getElementsByTagName(<span class="hljs-string">&quot;div&quot;</span>);

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> div <span class="hljs-keyword">of</span> divs) {
    <span class="hljs-built_in">console</span>.log(div.id);
}
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; <code>getElementsByTagName()</code> &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; <code>NodeList</code>, &#x449;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x454; &#x432;&#x441;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; <code>&lt;div&gt;</code> &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456; <code>document</code>. &#x41F;&#x43E;&#x442;&#x456;&#x43C; &#x446;&#x438;&#x43A;&#x43B; <code>for-of</code> &#x456;&#x442;&#x435;&#x440;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x441;&#x456;&#x43C;&#x430; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; ID &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;, &#x444;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x447;&#x438; &#x43A;&#x43E;&#x434; &#x442;&#x430;&#x43A;&#x438;&#x43C;, &#x43D;&#x430;&#x447;&#x435; &#x432;&#x456;&#x43D; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;.</p>
<h2 id="&#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;-&#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443;-&#x442;&#x430;-&#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x456;-&#x43D;&#x435;&#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;">&#x41E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x442;&#x430; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x456; &#x43D;&#x435;&#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;</h2>
<p>&#x41F;&#x440;&#x438;&#x433;&#x430;&#x434;&#x430;&#x454;&#x43C;&#x43E; &#x437; &#x413;&#x43B;&#x430;&#x432;&#x438; 7, &#x449;&#x43E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; (<code>...</code>) &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> set = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Set</span>([<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">3</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>, <span class="hljs-number">5</span>]),
    array = [...set];

<span class="hljs-built_in">console</span>.log(array);             <span class="hljs-comment">// [1,2,3,4,5]</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43F;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x437; <code>set</code>. &#x41E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x437; &#x443;&#x441;&#x456;&#x43C;&#x430; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;, &#x44F;&#x43A;&#x456; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x438;. &#x412;&#x441;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x447;&#x438;&#x442;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x442;&#x430; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x443; &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x456; &#x437; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;. &#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D; &#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438;, &#x430;&#x43B;&#x435; &#x432;&#x456;&#x43D; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x434;&#x43E;&#x431;&#x440;&#x435; &#x437; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x43C; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C;. &#x41E;&#x441;&#x44C; &#x456;&#x43D;&#x448;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> map = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>([ [<span class="hljs-string">&quot;name&quot;</span>, <span class="hljs-string">&quot;Nicholas&quot;</span>], [<span class="hljs-string">&quot;age&quot;</span>, <span class="hljs-number">25</span>]]),
    array = [...map];

<span class="hljs-built_in">console</span>.log(array);         <span class="hljs-comment">// [ [&quot;name&quot;, &quot;Nicholas&quot;], [&quot;age&quot;, 25]]</span>
</code></pre>
<p>&#x422;&#x443;&#x442; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; <code>map</code> &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x43F; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x430;&#x440;&#x438; &#x201C;&#x43A;&#x43B;&#x44E;&#x447;&#x2013;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x201D;, &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x442;&#x430;&#x43A;, &#x44F;&#x43A; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x44F;&#x43A;&#x438;&#x439; &#x431;&#x443;&#x43B;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x43B;&#x438; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>new Map()</code>.</p>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x443; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x441;&#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x440;&#x430;&#x437;&#x456;&#x432;, &#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E;, &#x456; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x434;&#x435;, &#x434;&#x435; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x437; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;. &#x426;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x2019;&#x44F;&#x432;&#x43B;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43D;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x443; &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x43B;&#x438;&#x441;&#x44C; &#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> smallNumbers = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>],
    bigNumbers = [<span class="hljs-number">100</span>, <span class="hljs-number">101</span>, <span class="hljs-number">102</span>],
    allNumbers = [<span class="hljs-number">0</span>, ...smallNumbers, ...bigNumbers];

<span class="hljs-built_in">console</span>.log(allNumbers.length);     <span class="hljs-comment">// 7</span>
<span class="hljs-built_in">console</span>.log(allNumbers);    <span class="hljs-comment">// [0, 1, 2, 3, 100, 101, 102]</span>
</code></pre>
<p>&#x41E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; <code>allNumbers</code> &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x443; <code>smallNumbers</code> &#x442;&#x430; <code>bigNumbers</code>. &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>allNumbers</code> &#x443; &#x442;&#x456;&#x439; &#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456;, &#x432; &#x44F;&#x43A;&#x456;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x456; &#x43F;&#x440;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x456; <code>allNumbers</code>: <code>0</code> &#x2014; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439;, &#x437;&#x430; &#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x456; <code>smallNumbers</code>, &#x430; &#x437;&#x430; &#x43D;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; <code>bigNumbers</code>. &#x41E;&#x440;&#x438;&#x433;&#x456;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x437;&#x43C;&#x456;&#x43D;&#x435;&#x43D;&#x438;&#x43C;&#x438; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x457;&#x445;&#x43D;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x441;&#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x443; <code>allNumbers</code>.</p>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x437; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x43C; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C;, &#x446;&#x435; &#x43D;&#x430;&#x439;&#x43B;&#x435;&#x433;&#x448;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x456;&#x457; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432; (&#x43D;&#x435; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x445; &#x441;&#x43B;&#x456;&#x432;) &#x442;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; <code>NodeList</code> &#x437; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x443; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x432;&#x443;&#x437;&#x43B;&#x456;&#x432;.</p>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x438; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x438; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;, &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x447;&#x438; <code>for-of</code> &#x442;&#x430; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443;, &#x447;&#x430;&#x441; &#x43F;&#x43E;&#x434;&#x438;&#x432;&#x438;&#x442;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x456; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;.</p>
<h2 id="&#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x430;-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x441;&#x442;&#x44C;-&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;">&#x420;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;</h2>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438;, &#x437;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x43F;&#x440;&#x43E; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;, &#x442;&#x430; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x457;&#x445; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x454; &#x43D;&#x430;&#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x456;&#x448;&#x438;&#x43C;&#x438;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x457;&#x445; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;, &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x443; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x44F;&#x445;. &#x41F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43A;&#x438; ECMAScript, &#x437;&#x2019;&#x44F;&#x432;&#x43B;&#x44F;&#x43B;&#x43E;&#x441;&#x44C; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x456;&#x434;&#x435;&#x439; &#x442;&#x430; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x437;&#x430;&#x43E;&#x445;&#x43E;&#x447;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456;. &#x414;&#x435;&#x44F;&#x43A;&#x456; &#x437; &#x446;&#x438;&#x445; &#x43D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x44C; &#x454; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x447;&#x43D;&#x438;&#x43C;&#x438;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x457;&#x445; &#x440;&#x430;&#x437;&#x43E;&#x43C;, &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x434;&#x443;&#x436;&#x435; &#x446;&#x456;&#x43A;&#x430;&#x432;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;.</p>
<h3 id="&#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430;-&#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;-&#x443;-&#x456;&#x43D;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;">&#x41F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x443; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;</h3>
<p>&#x41F;&#x440;&#x43E;&#x442;&#x44F;&#x433;&#x43E;&#x43C; &#x446;&#x456;&#x454;&#x457; &#x433;&#x43B;&#x430;&#x432;&#x438;, &#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x445;, &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x432;&#x438;&#x434;&#x430;&#x432;&#x430;&#x43B;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>next()</code> &#x430;&#x431;&#x43E; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; <code>yield</code> &#x443; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;. &#x41F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x432; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>next()</code>. &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>next()</code>, &#x446;&#x435;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x441;&#x442;&#x430;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>yield</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;. &#x426;&#x44F; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x434;&#x443;&#x436;&#x435; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x430; &#x434;&#x43B;&#x44F; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43E;&#x433;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x443; &#x44F;&#x43A; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createIterator</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">let</span> first = <span class="hljs-keyword">yield</span> <span class="hljs-number">1</span>;
    <span class="hljs-keyword">let</span> second = <span class="hljs-keyword">yield</span> first + <span class="hljs-number">2</span>;       <span class="hljs-comment">// 4 + 2</span>
    <span class="hljs-keyword">yield</span> second + <span class="hljs-number">3</span>;                   <span class="hljs-comment">// 5 + 3</span>
}

<span class="hljs-keyword">let</span> iterator = createIterator();

<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 1, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next(<span class="hljs-number">4</span>));          <span class="hljs-comment">// &quot;{ value: 6, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next(<span class="hljs-number">5</span>));          <span class="hljs-comment">// &quot;{ value: 8, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: undefined, done: true }&quot;</span>
</code></pre>
<p>&#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>next()</code> &#x454; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x43C;: &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x443; &#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;, &#x432;&#x456;&#x43D; &#x431;&#x443;&#x434;&#x435; &#x432;&#x442;&#x440;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;, &#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>next()</code>, &#x441;&#x442;&#x430;&#x44E;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;, &#x44F;&#x43A;&#x456; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>yield</code>, &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>next()</code> &#x43C;&#x456;&#x433; &#x431;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>yield</code> &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;, &#x44F;&#x43A;&#x449;&#x43E; &#x431; &#x432;&#x456;&#x43D; &#x431;&#x443;&#x432; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C; <code>yield</code>. &#x426;&#x435; &#x43D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x456; &#x442;&#x43E;&#x43C;&#x443; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x437;&#x43C;&#x456;&#x441;&#x442;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43F;&#x440;&#x438; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>next()</code>.</p>
<p>&#x41F;&#x440;&#x438; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>next()</code>, &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>4</code>. &#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; <code>first</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>4</code>. &#x423; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456; <code>yield</code>, &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x447;&#x438; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F;, &#x43F;&#x440;&#x430;&#x432;&#x430; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x438; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>next()</code>, &#x430; &#x43B;&#x456;&#x432;&#x430; &#x447;&#x438;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x438; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>next()</code>, &#x43F;&#x435;&#x440;&#x435;&#x434; &#x442;&#x438;&#x43C;, &#x44F;&#x43A; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>next()</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; <code>4</code>, &#x446;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>first</code> &#x456; &#x442;&#x43E;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;.</p>
<p>&#x414;&#x440;&#x443;&#x433;&#x438;&#x439; <code>yield</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; <code>yield</code> &#x456; &#x434;&#x43E;&#x434;&#x430;&#x454; &#x434;&#x432;&#x430;, &#x456; &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x448;&#x456;&#x441;&#x442;&#x44C;. &#x41A;&#x43E;&#x43B;&#x438; &#x443; &#x442;&#x440;&#x435;&#x442;&#x454; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>next()</code>, &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>5</code>.  &#x426;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; <code>second</code>, &#x430; &#x442;&#x43E;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x442;&#x440;&#x435;&#x442;&#x44C;&#x43E;&#x43C;&#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456; <code>yield</code>, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; <code>8</code>.</p>
<p>&#x41B;&#x435;&#x433;&#x448;&#x435; &#x434;&#x443;&#x43C;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x434;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;. &#x417;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; 8-1 &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x44F;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x437;&#x443;&#x43F;&#x438;&#x43D;&#x43A;&#x430;&#x43C;&#x438; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43A;&#x43E;&#x43B;&#x44C;&#x43E;&#x440;&#x456;&#x432;.</p>
<p><img src="images/fg0601.png" alt="&#x417;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; 8-1: &#x412;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x443; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;"></p>
<p>&#x416;&#x43E;&#x432;&#x442;&#x438;&#x439; &#x43A;&#x43E;&#x43B;&#x456;&#x440; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x454; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>next()</code> &#x442;&#x430; &#x432;&#x435;&#x441;&#x44C; &#x43A;&#x43E;&#x434;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;. &#x411;&#x43B;&#x430;&#x43A;&#x438;&#x442;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x43B;&#x456;&#x440; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>next(4)</code> &#x456; &#x432;&#x435;&#x441;&#x44C; &#x43A;&#x43E;&#x434;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x438; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;. &#x420;&#x43E;&#x436;&#x435;&#x432;&#x438;&#x439; &#x43A;&#x43E;&#x43B;&#x456;&#x440; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>next(5)</code> &#x442;&#x430; &#x43A;&#x43E;&#x434;&#x443;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;. &#x421;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x454; &#x442;&#x435;, &#x44F;&#x43A; &#x43A;&#x43E;&#x434; &#x443; &#x43F;&#x440;&#x430;&#x432;&#x456;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x456; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x437; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x456; &#x437;&#x443;&#x43F;&#x438;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x442;&#x438;&#x43C;, &#x44F;&#x43A; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x434; &#x443; &#x43B;&#x456;&#x432;&#x456;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x456;. &#x426;&#x435; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x437;&#x43D;&#x435;&#x432;&#x430;&#x434;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x438;&#x445; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x434;&#x435;&#x449;&#x43E; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x456;&#x448;&#x438;&#x43C;, &#x43D;&#x456;&#x436; &#x43D;&#x430;&#x43B;&#x430;&#x433;&#x43E;&#x434;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x445; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439;.</p>
<p>&#x412;&#x438; &#x432;&#x436;&#x435; &#x43F;&#x43E;&#x431;&#x430;&#x447;&#x438;&#x43B;&#x438;, &#x449;&#x43E; <code>yield</code> &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x438;&#x441;&#x44C; &#x44F;&#x43A; <code>return</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>next()</code> &#x44F;&#x43A;&#x435;&#x441;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x446;&#x435; &#x43D;&#x435; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x439;&#x43E;&#x43C;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;. &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;.</p>
<h3 id="&#x43A;&#x438;&#x434;&#x430;&#x43D;&#x43D;&#x44F;-&#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;-&#x432;-&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x445;">&#x41A;&#x438;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A; &#x432; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x445;</h3>
<p>&#x412; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x43D;&#x435; &#x43B;&#x438;&#x448;&#x435; &#x434;&#x430;&#x43D;&#x456;, &#x430;&#x43B;&#x435; &#x439; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;. &#x414;&#x43B;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>throw()</code>, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x443; &#x447;&#x438; &#x43A;&#x438;&#x434;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x456;&#x43D; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;. &#x426;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x430; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x44F;&#x43A; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;, &#x442;&#x430;&#x43A; &#x456; &#x43A;&#x438;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A; (&#x434;&#x432;&#x430; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x438; &#x432;&#x438;&#x445;&#x43E;&#x434;&#x443; &#x437; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;). &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x443; <code>throw()</code>, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x438;&#x439;, &#x43A;&#x43E;&#x43B;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createIterator</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">let</span> first = <span class="hljs-keyword">yield</span> <span class="hljs-number">1</span>;
    <span class="hljs-keyword">let</span> second = <span class="hljs-keyword">yield</span> first + <span class="hljs-number">2</span>;       <span class="hljs-comment">// yield 4 + 2, &#x442;&#x43E;&#x434;&#x456; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x438;</span>
    <span class="hljs-keyword">yield</span> second + <span class="hljs-number">3</span>;                   <span class="hljs-comment">// &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438;</span>
}

<span class="hljs-keyword">let</span> iterator = createIterator();

<span class="hljs-built_in">console</span>.log(iterator.next());                   <span class="hljs-comment">// &quot;{ value: 1, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next(<span class="hljs-number">4</span>));                  <span class="hljs-comment">// &quot;{ value: 6, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.throw(<span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Boom&quot;</span>))); <span class="hljs-comment">// &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x43A;&#x438;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x43F;&#x435;&#x440;&#x448;&#x456; &#x434;&#x432;&#x430; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x437; <code>yield</code> &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;, &#x430;&#x43B;&#x435; &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>throw()</code>, &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x43A;&#x438;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>let second</code>. &#x426;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x443;&#x43F;&#x438;&#x43D;&#x44F;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x443;, &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x44F;&#x43A; &#x446;&#x435; &#x431;&#x438; &#x441;&#x442;&#x430;&#x43B;&#x43E;&#x441;&#x44C;, &#x44F;&#x43A;&#x449;&#x43E; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;. &#x404;&#x434;&#x438;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x2014; &#x446;&#x435; &#x43C;&#x456;&#x441;&#x446;&#x435;, &#x434;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;. &#x417;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; 8-2 &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x454;, &#x44F;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x43C;&#x443; &#x43A;&#x440;&#x43E;&#x446;&#x456;.</p>
<p><img src="images/fg0602.png" alt="&#x417;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; 8-2: &#x41A;&#x438;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;"></p>
<p>&#x41D;&#x430; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F;, &#x447;&#x435;&#x440;&#x432;&#x43E;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x43B;&#x456;&#x440; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43A;&#x43E;&#x434;&#x443;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435;&#x442;&#x44C;&#x441;&#x44F; <code>throw()</code>, &#x430; &#x447;&#x435;&#x440;&#x432;&#x43E;&#x43D;&#x430; &#x437;&#x456;&#x440;&#x43A;&#x430; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x434;&#x435;, &#x43F;&#x440;&#x438;&#x431;&#x43B;&#x438;&#x437;&#x43D;&#x43E;, &#x43A;&#x438;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;. &#x41F;&#x435;&#x440;&#x448;&#x456; &#x434;&#x432;&#x430; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>yield</code> &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F;, &#x430;&#x43B;&#x435; &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>throw()</code>, &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x43A;&#x438;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x456;&#x43D;&#x448;&#x438;&#x439; &#x43A;&#x43E;&#x434;.</p>
<p>&#x417;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x446;&#x435;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43B;&#x43E;&#x432;&#x438;&#x442;&#x438; &#x442;&#x430;&#x43A;&#x456; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x431;&#x43B;&#x43E;&#x43A;&#x443; <code>try-catch</code>:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createIterator</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">let</span> first = <span class="hljs-keyword">yield</span> <span class="hljs-number">1</span>;
    <span class="hljs-keyword">let</span> second;

    <span class="hljs-keyword">try</span> {
        second = <span class="hljs-keyword">yield</span> first + <span class="hljs-number">2</span>;       <span class="hljs-comment">// yield 4 + 2, &#x442;&#x43E;&#x434;&#x456; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x438;</span>
    } <span class="hljs-keyword">catch</span> (ex) {
        second = <span class="hljs-number">6</span>;                     <span class="hljs-comment">// &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;, &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x457;&#x442;&#x438; &#x456;&#x43D;&#x448;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;</span>
    }
    <span class="hljs-keyword">yield</span> second + <span class="hljs-number">3</span>;
}

<span class="hljs-keyword">let</span> iterator = createIterator();

<span class="hljs-built_in">console</span>.log(iterator.next());                   <span class="hljs-comment">// &quot;{ value: 1, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next(<span class="hljs-number">4</span>));                  <span class="hljs-comment">// &quot;{ value: 6, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.throw(<span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Boom&quot;</span>))); <span class="hljs-comment">// &quot;{ value: 9, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());                   <span class="hljs-comment">// &quot;{ value: undefined, done: true }&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x431;&#x43B;&#x43E;&#x43A; <code>try-catch</code> &#x43E;&#x433;&#x43E;&#x440;&#x43D;&#x443;&#x442;&#x438;&#x439; &#x434;&#x43E;&#x432;&#x43A;&#x43E;&#x43B;&#x430; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>yield</code>. &#x41A;&#x43E;&#x43B;&#x438; &#x446;&#x435;&#x439; <code>yield</code> &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x435;&#x437; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;, &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E; &#x44F;&#x43A; <code>second</code> &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x457;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x438;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x442;&#x43E;&#x43C;&#x443; &#x431;&#x43B;&#x43E;&#x43A; <code>catch</code> &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454; &#x439;&#x43E;&#x43C;&#x443; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x448;&#x456;&#x441;&#x442;&#x44C;. &#x422;&#x43E;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x433;&#x43E; <code>yield</code> &#x456; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x434;&#x435;&#x432;&apos;&#x44F;&#x442;&#x44C;.</p>
<p>&#x417;&#x432;&#x435;&#x440;&#x43D;&#x456;&#x442;&#x44C; &#x443; &#x432;&#x430;&#x433;&#x443; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x431;&#x443;&#x43B;&#x43E;&#x441;&#x44C; &#x434;&#x435;&#x449;&#x43E; &#x446;&#x456;&#x43A;&#x430;&#x432;&#x435;: &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>throw()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x2013;&#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>next()</code>. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x431;&#x443;&#x43B;&#x430; &#x432;&#x43F;&#x456;&#x439;&#x43C;&#x430;&#x43D;&#x430; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;, &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x443; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x438;&#x43B;&#x43E;&#x441;&#x44C; &#x434;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x433;&#x43E; <code>yield</code> &#x442;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x43B;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, <code>9</code>.</p>
<p>&#x41A;&#x440;&#x430;&#x449;&#x435; &#x434;&#x443;&#x43C;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E; <code>next()</code> &#x442;&#x430; <code>throw()</code> &#x44F;&#x43A; &#x43F;&#x440;&#x43E; &#x456;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x456;&#x457; &#x434;&#x43B;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>next()</code> &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x443; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x438;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; (&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x437; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;), &#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>throw()</code> &#x43D;&#x430;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x443; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x438;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x438;&#x434;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;. &#x429;&#x43E; &#x441;&#x442;&#x430;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x437;&#x430;&#x43B;&#x435;&#x436;&#x438;&#x442;&#x44C; &#x432;&#x456;&#x434; &#x43A;&#x43E;&#x434;&#x443; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;.</p>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>next()</code> &#x442;&#x430; <code>throw()</code> &#x43A;&#x435;&#x440;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x445;&#x43E;&#x434;&#x43E;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; <code>yield</code>, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>return</code>. &#x410;&#x43B;&#x435; <code>return</code> &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x43F;&#x43E;&#x2014;&#x456;&#x43D;&#x448;&#x43E;&#x43C;&#x443;, &#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x432;&#x456;&#x43D; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x443; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x445; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;&#x445;. &#x42F;&#x43A; &#x441;&#x430;&#x43C;&#x435;, &#x432;&#x438; &#x43F;&#x43E;&#x431;&#x430;&#x447;&#x438;&#x442;&#x435; &#x443; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x43C;&#x443; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456;.</p>
<h3 id="&#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;-return-&#x443;-&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x445;">&#x41E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; return &#x443; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x445;</h3>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;&#x43C;&#x438;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>return</code> &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x432;&#x447;&#x430;&#x441;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x445;&#x43E;&#x434;&#x443; &#x442;&#x430; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443; &#x434;&#x43B;&#x44F; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443;  <code>next()</code>. &#x423; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;&#x432; &#x443; &#x446;&#x456;&#x439; &#x433;&#x43B;&#x430;&#x432;&#x456;, &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>next()</code> &#x434;&#x43B;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x432; <code>undefined</code>, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x430;&#x434;&#x430;&#x442;&#x438; &#x456;&#x43D;&#x448;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; <code>return</code> &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x432;&#x438; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x431; &#x446;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x437; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x43E;&#x44E; &#x456;&#x43D;&#x448;&#x43E;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E;. &#x423; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456; <code>return</code> &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x441;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x435;&#x43D;&#x43E;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>done</code> &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>true</code>, &#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x43E; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x435;, &#x441;&#x442;&#x430;&#x454; &#x43F;&#x43E;&#x43B;&#x435;&#x43C; <code>value</code>. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x449;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x443;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E;  <code>return</code>:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createIterator</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">yield</span> <span class="hljs-number">1</span>;
    <span class="hljs-keyword">return</span>;
    <span class="hljs-keyword">yield</span> <span class="hljs-number">2</span>;
    <span class="hljs-keyword">yield</span> <span class="hljs-number">3</span>;
}

<span class="hljs-keyword">let</span> iterator = createIterator();

<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 1, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: undefined, done: true }&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43C;&#x430;&#x454; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>yield</code>, &#x437;&#x430; &#x44F;&#x43A;&#x438;&#x43C; &#x441;&#x43B;&#x456;&#x434;&#x443;&#x454; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>return</code>. <code>return</code> &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x449;&#x43E; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x43D;&#x430;&#x434;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x438;&#x43C;&#x443;&#x442;&#x44C;, &#x456; &#x442;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x448;&#x442;&#x443; &#x456;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x456;&#x439; <code>yield</code> &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; (&#x457;&#x445; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x434;&#x43E;&#x441;&#x44F;&#x433;&#x43D;&#x443;&#x442;&#x438;).</p>
<p>&#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x442;&#x440;&#x435;&#x431;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;, &#x456; &#x44F;&#x43A;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x435; &#x43F;&#x43E;&#x43B;&#x435;&#x43C; <code>value</code> &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;&#x2013;&#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createIterator</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">yield</span> <span class="hljs-number">1</span>;
    <span class="hljs-keyword">return</span> <span class="hljs-number">42</span>;
}

<span class="hljs-keyword">let</span> iterator = createIterator();

<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 1, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 42, done: true }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: undefined, done: true }&quot;</span>
</code></pre>
<p>&#x422;&#x443;&#x442; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>42</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43F;&#x43E;&#x43B;&#x456; <code>value</code> &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>next()</code> (&#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x2014; &#x443; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43B;&#x435; <code>done</code> &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454; <code>true</code>). &#x422;&#x440;&#x435;&#x442;&#x456;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>next()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;, &#x443; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>value</code> &#x437;&#x43D;&#x43E;&#x432;&#x443; &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454; <code>undefined</code>. &#x411;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x432;&#x438; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x438; &#x447;&#x435;&#x440;&#x435;&#x437; <code>return</code>, &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x2013;&#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456; &#x43B;&#x438;&#x448;&#x435; &#x440;&#x430;&#x437;, &#x43F;&#x435;&#x440;&#x435;&#x434; &#x442;&#x438;&#x43C;, &#x44F;&#x43A; &#x43F;&#x43E;&#x43B;&#x435; <code>value</code> &#x431;&#x443;&#x434;&#x435; &#x441;&#x43A;&#x438;&#x43D;&#x443;&#x442;&#x43E; &#x434;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>undefined</code>.</p>
<p>I&gt; &#x41E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x442;&#x430; <code>for-of</code> &#x456;&#x433;&#x43D;&#x43E;&#x440;&#x443;&#x44E;&#x442;&#x44C; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x456;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x456;&#x457; <code>return</code>. &#x42F;&#x43A; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x430;&#x447;&#x430;&#x442;&#x44C;, &#x449;&#x43E; <code>done</code> &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454; <code>true</code>, &#x432;&#x43E;&#x43D;&#x438; &#x437;&#x443;&#x43F;&#x438;&#x43D;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x435;&#x437; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>value</code>. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x445; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x456; &#x43F;&#x440;&#x438; &#x434;&#x435;&#x43B;&#x435;&#x433;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;.</p>
<h3 id="&#x434;&#x435;&#x43B;&#x435;&#x433;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;">&#x414;&#x435;&#x43B;&#x435;&#x433;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;</h3>
<p>&#x423; &#x434;&#x435;&#x44F;&#x43A;&#x438;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x430;&#x445; &#x437;&#x440;&#x443;&#x447;&#x43D;&#x43E; &#x441;&#x43A;&#x43E;&#x43C;&#x431;&#x456;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x434;&#x432;&#x43E;&#x445; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x443; &#x43E;&#x434;&#x438;&#x43D;. &#x413;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x434;&#x435;&#x43B;&#x435;&#x433;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43E; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x444;&#x43E;&#x440;&#x43C;&#x438; <code>yield</code> &#x437; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x43C; &#x437;&#x456;&#x440;&#x43E;&#x447;&#x43A;&#x438; (<code>*</code>). &#x42F;&#x43A; &#x456; &#x437; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;, &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x434;&#x435; &#x441;&#x442;&#x43E;&#x457;&#x442;&#x44C; &#x437;&#x456;&#x440;&#x43E;&#x447;&#x43A;&#x430;, &#x43F;&#x43E;&#x43A;&#x438; &#x432;&#x43E;&#x43D;&#x430; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x456;&#x436; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x438;&#x43C; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>yield</code> &#x442;&#x430; &#x456;&#x43C;&#x2019;&#x44F;&#x43C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createNumberIterator</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">yield</span> <span class="hljs-number">1</span>;
    <span class="hljs-keyword">yield</span> <span class="hljs-number">2</span>;
}

<span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createColorIterator</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">yield</span> <span class="hljs-string">&quot;red&quot;</span>;
    <span class="hljs-keyword">yield</span> <span class="hljs-string">&quot;green&quot;</span>;
}

<span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createCombinedIterator</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">yield</span> *createNumberIterator();
    <span class="hljs-keyword">yield</span> *createColorIterator();
    <span class="hljs-keyword">yield</span> <span class="hljs-literal">true</span>;
}

<span class="hljs-keyword">var</span> iterator = createCombinedIterator();

<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 1, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 2, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: &quot;red&quot;, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: &quot;green&quot;, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: true, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: undefined, done: true }&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>createCombinedIterator()</code> &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x434;&#x435;&#x43B;&#x435;&#x433;&#x443;&#x454; &#x441;&#x43F;&#x435;&#x440;&#x448;&#x443; &#x434;&#x43E; <code>createNumberIterator()</code>, &#x430; &#x442;&#x43E;&#x434;&#x456; &#x434;&#x43E; <code>createColorIterator()</code>. &#x421;&#x43F;&#x456;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x437;&#x43E;&#x432;&#x43D;&#x456; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x442;&#x430;&#x43A;, &#x43D;&#x430;&#x447;&#x435; &#x446;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x441;&#x43F;&#x456;&#x43B;&#x44C;&#x43D;&#x438;&#x439;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x432;&#x441;&#x456; &#x446;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>next()</code> &#x434;&#x435;&#x43B;&#x435;&#x433;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E;&#x433;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;, &#x43F;&#x43E;&#x43A;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;, &#x449;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x456; &#x447;&#x435;&#x440;&#x435;&#x437; <code>createNumberIterator()</code> &#x442;&#x430; <code>createColorIterator()</code>, &#x43D;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x443;&#x442;&#x44C; &#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x43D;&#x456;&#x43C;&#x438;. &#x422;&#x43E;&#x434;&#x456; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x454; <code>yield</code> &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; <code>true</code>.</p>
<p>&#x414;&#x435;&#x43B;&#x435;&#x433;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x433;&#x43B;&#x438;&#x431;&#x43B;&#x435;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;. &#x426;&#x435; &#x454; &#x43D;&#x430;&#x439;&#x43B;&#x435;&#x433;&#x448;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x432;&#x438;&#x445;&#x43E;&#x434;&#x443; &#x456; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x434;&#x443;&#x436;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43C; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x456; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x438;&#x445; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createNumberIterator</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">yield</span> <span class="hljs-number">1</span>;
    <span class="hljs-keyword">yield</span> <span class="hljs-number">2</span>;
    <span class="hljs-keyword">return</span> <span class="hljs-number">3</span>;
}

<span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createRepeatingIterator</span>(<span class="hljs-params">count</span>) </span>{
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i=<span class="hljs-number">0</span>; i &lt; count; i++) {
        <span class="hljs-keyword">yield</span> <span class="hljs-string">&quot;repeat&quot;</span>;
    }
}

<span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createCombinedIterator</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">let</span> result = <span class="hljs-keyword">yield</span> *createNumberIterator();
    <span class="hljs-keyword">yield</span> *createRepeatingIterator(result);
}

<span class="hljs-keyword">var</span> iterator = createCombinedIterator();

<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 1, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 2, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: &quot;repeat&quot;, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: &quot;repeat&quot;, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: &quot;repeat&quot;, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: undefined, done: true }&quot;</span>
</code></pre>
<p>&#x422;&#x443;&#x442; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>createCombinedIterator()</code> &#x434;&#x435;&#x43B;&#x435;&#x433;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; <code>createNumberIterator()</code> &#x442;&#x430; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; <code>result</code>. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>createNumberIterator()</code> &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; <code>return 3</code>, &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x454; <code>3</code>. &#x422;&#x43E;&#x434;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>result</code> &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>createRepeatingIterator()</code> &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;, &#x449;&#x43E; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x440;&#x430;&#x437;&#x456;&#x432; &#x442;&#x440;&#x435;&#x431;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x440;&#x44F;&#x434;&#x43E;&#x43A; (&#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x442;&#x440;&#x438;&#x447;&#x456;).</p>
<p>&#x417;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>3</code> &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x438; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>next()</code>. &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x430;&#x440;&#x430;&#x437;, &#x432;&#x43E;&#x43D;&#x43E; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x432;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x43D;&#x43E; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>createCombinedIterator()</code>. &#x41F;&#x440;&#x43E;&#x442;&#x435;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x432;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x446;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x448;&#x438; &#x449;&#x435; &#x43E;&#x434;&#x43D;&#x443; &#x456;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x456;&#x44E; <code>yield</code>, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createNumberIterator</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">yield</span> <span class="hljs-number">1</span>;
    <span class="hljs-keyword">yield</span> <span class="hljs-number">2</span>;
    <span class="hljs-keyword">return</span> <span class="hljs-number">3</span>;
}

<span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createRepeatingIterator</span>(<span class="hljs-params">count</span>) </span>{
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> i=<span class="hljs-number">0</span>; i &lt; count; i++) {
        <span class="hljs-keyword">yield</span> <span class="hljs-string">&quot;repeat&quot;</span>;
    }
}

<span class="hljs-function"><span class="hljs-keyword">function</span> *<span class="hljs-title">createCombinedIterator</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">let</span> result = <span class="hljs-keyword">yield</span> *createNumberIterator();
    <span class="hljs-keyword">yield</span> result;
    <span class="hljs-keyword">yield</span> *createRepeatingIterator(result);
}

<span class="hljs-keyword">var</span> iterator = createCombinedIterator();

<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 1, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 2, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: 3, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: &quot;repeat&quot;, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: &quot;repeat&quot;, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: &quot;repeat&quot;, done: false }&quot;</span>
<span class="hljs-built_in">console</span>.log(iterator.next());           <span class="hljs-comment">// &quot;{ value: undefined, done: true }&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>yield</code> &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x435; &#x437; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>createNumberIterator()</code> &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x414;&#x435;&#x43B;&#x435;&#x433;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x454; &#x434;&#x443;&#x436;&#x435; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x43E;&#x44E; &#x43F;&#x430;&#x440;&#x430;&#x434;&#x438;&#x433;&#x43C;&#x43E;&#x44E;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x454; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x434;&#x443;&#x436;&#x435; &#x446;&#x456;&#x43A;&#x430;&#x432;&#x438;&#x445; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x43E; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x43A;&#x43E;&#x43D;&#x2019;&#x44E;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x43C;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F;&#x43C;&#x438;.</p>
<p>I&gt; &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>yield *</code> &#x432;&#x456;&#x434;&#x440;&#x430;&#x437;&#x443; &#x43D;&#x430;&#x434; &#x440;&#x44F;&#x434;&#x43A;&#x430;&#x43C;&#x438; (&#x44F;&#x43A; &#x43E;&#x442; <code>yield * &quot;hello&quot;</code>), &#x456; &#x442;&#x43E;&#x434;&#x456; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x438;&#x439; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432;.</p>
<h2 id="&#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x439;-&#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;-&#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;">&#x410;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;</h2>
<p>&#x411;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x443;&#x432;&#x430;&#x433;&#x438; &#x434;&#x43E;&#x432;&#x43A;&#x43E;&#x43B;&#x430; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x441;&#x442;&#x43E;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x410;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x443; JavaScript &#x2014; &#x446;&#x435; &#x43F;&#x430;&#x43B;&#x438;&#x446;&#x44F; &#x437; &#x434;&#x432;&#x43E;&#x43C;&#x430; &#x43A;&#x456;&#x43D;&#x446;&#x44F;&#x43C;&#x438;: &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;, &#x430;&#x43B;&#x435; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x456; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x43C;&#x443;&#x448;&#x443;&#x44E;&#x442;&#x44C; &#x437;&#x430;&#x433;&#x43B;&#x438;&#x431;&#x438;&#x442;&#x438;&#x441;&#x44C; &#x432; &#x43E;&#x440;&#x433;&#x430;&#x43D;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44E; &#x43A;&#x43E;&#x434;&#x443;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x437;&#x440;&#x443;&#x447;&#x43D;&#x43E; &#x437;&#x443;&#x43F;&#x438;&#x43D;&#x44F;&#x442;&#x438; &#x43A;&#x43E;&#x434; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;, &#x432;&#x43E;&#x43D;&#x438; &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x448;&#x438;&#x440;&#x43E;&#x43A;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;, &#x43F;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x430;&#x43D;&#x456; &#x437; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x44E; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x43E;&#x44E;.</p>
<p>&#x417;&#x432;&#x438;&#x447;&#x43D;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44E; &#x454; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x449;&#x43E; &#x43C;&#x430;&#x454; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x443; &#x437; &#x434;&#x438;&#x441;&#x43A;&#x443; &#x443; Node.js:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> fs = <span class="hljs-built_in">require</span>(<span class="hljs-string">&quot;fs&quot;</span>);

fs.readFile(<span class="hljs-string">&quot;config.json&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err, contents</span>) </span>{
    <span class="hljs-keyword">if</span> (err) {
        <span class="hljs-keyword">throw</span> err;
    }

    doSomethingWith(contents);
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Done&quot;</span>);
});
</code></pre>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>fs.readFile()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x456;&#x43C;&#x435;&#x43D;&#x435;&#x43C; &#x444;&#x430;&#x439;&#x43B;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x442;&#x440;&#x435;&#x431;&#x430; &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x442;&#x438;, &#x442;&#x430; &#x437; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;. &#x41A;&#x43E;&#x43B;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x438;&#x442;&#x44C;&#x441;&#x44F;, &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;. &#x417;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x454;, &#x447;&#x438; &#x441;&#x442;&#x430;&#x43B;&#x430;&#x441;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;, &#x456;, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x435; &#x441;&#x442;&#x430;&#x43B;&#x430;&#x441;&#x44C;, &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x438;&#x439; <code>contents</code>. &#x426;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x434;&#x43E;&#x431;&#x440;&#x435;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x445; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;, &#x44F;&#x43A;&#x456; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x437;&#x456; &#x437;&#x440;&#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456;, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x442;&#x438; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; &#x43E;&#x434;&#x438;&#x43D; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E;, &#x430;&#x431;&#x43E; &#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x435;&#x440;&#x456;&#x44E; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x445; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;. &#x421;&#x430;&#x43C;&#x435; &#x442;&#x443;&#x442; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x442;&#x430;  <code>yield</code> &#x441;&#x442;&#x430;&#x44E;&#x442;&#x44C; &#x432; &#x43D;&#x430;&#x433;&#x43E;&#x434;&#x456;.</p>
<h3 id="&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x439;-&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;-&#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;">&#x41F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;</h3>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>yield</code> &#x437;&#x443;&#x43F;&#x438;&#x43D;&#x44F;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x456;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x438; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443;, &#x447;&#x435;&#x43A;&#x430;&#x454; &#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>next()</code>, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; &#x431;&#x435;&#x437; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x438; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432;. &#x414;&#x43B;&#x44F; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443;, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x456; &#x441;&#x442;&#x430;&#x440;&#x442;&#x443;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;&#x430;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">run</span>(<span class="hljs-params">taskDef</span>) </span>{

    <span class="hljs-comment">// &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x43C;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x443;&#x441;&#x44E;&#x434;&#x438;</span>
    <span class="hljs-keyword">let</span> task = taskDef();

    <span class="hljs-comment">// &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x43C;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-keyword">let</span> result = task.next();

    <span class="hljs-comment">// &#x440;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x441;&#x442;&#x456;&#x439;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; next()</span>
    <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">step</span>(<span class="hljs-params"></span>) </span>{

        <span class="hljs-comment">// &#x44F;&#x43A;&#x449;&#x43E; &#x454; &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;</span>
        <span class="hljs-keyword">if</span> (!result.done) {
            result = task.next();
            step();
        }
    }

    <span class="hljs-comment">// &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x43C;&#x43E; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;</span>
    step();

}
</code></pre>
<p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>run()</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; (&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;&#x2013;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;). &#x412;&#x43E;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x442;&#x430; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x446;&#x435;&#x439; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x443; <code>task</code>. &#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>task</code> &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x437;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x430; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x456;&#x43D;&#x448;&#x438;&#x43C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;&#x43C; (&#x44F; &#x43F;&#x43E;&#x44F;&#x441;&#x43D;&#x44E; &#x447;&#x43E;&#x43C;&#x443; &#x43F;&#x456;&#x437;&#x43D;&#x456;&#x448;&#x435; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456;). &#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>next()</code> &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x456;&#x442;&#x435;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x456; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x434;&#x430;&#x43B;&#x44C;&#x448;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>step()</code> &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x454; &#x447;&#x438; <code>result.done</code> &#x440;&#x456;&#x432;&#x43D;&#x435; <code>false</code>, &#x456;, &#x44F;&#x43A;&#x449;&#x43E; &#x442;&#x430;&#x43A;, &#x442;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; <code>next()</code> &#x43F;&#x435;&#x440;&#x435;&#x434; &#x440;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x438;&#x43C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x43E;&#x43C; &#x441;&#x430;&#x43C;&#x43E;&#x457; &#x441;&#x435;&#x431;&#x435;. &#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>next()</code> &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; <code>result</code>, &#x44F;&#x43A;&#x438;&#x439; &#x449;&#x43E;&#x440;&#x430;&#x437;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x449;&#x43E;&#x431; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x430;&#x43A;&#x442;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>step()</code> &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>result.done</code>, &#x449;&#x43E;&#x431; &#x431;&#x430;&#x447;&#x438;&#x442;&#x438; &#x447;&#x438; &#x454; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x430;, &#x44F;&#x43A;&#x443; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438;.</p>
<p>&#x417; &#x442;&#x430;&#x43A;&#x43E;&#x44E; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x454;&#x44E; <code>run()</code>, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x438; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x43C;&#x430; &#x456;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x456;&#x44F;&#x43C;&#x438; <code>yield</code>, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js">run(<span class="hljs-function"><span class="hljs-keyword">function</span>*(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-number">1</span>);
    <span class="hljs-keyword">yield</span>;
    <span class="hljs-built_in">console</span>.log(<span class="hljs-number">2</span>);
    <span class="hljs-keyword">yield</span>;
    <span class="hljs-built_in">console</span>.log(<span class="hljs-number">3</span>);
});
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x442;&#x440;&#x438; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x44C;, &#x449;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x431;&#x443;&#x43B;&#x438;&#x441;&#x44C; &#x432;&#x441;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; <code>next()</code>. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x43E;&#x447;&#x435;&#x440;&#x433;&#x43E;&#x432;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x454; &#x434;&#x443;&#x436;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43C;. &#x41D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C; &#x43A;&#x440;&#x43E;&#x43A;&#x43E;&#x43C; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x443; &#x442;&#x430; &#x437; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;.</p>
<h3 id="&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x430;-&#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;-&#x437;-&#x434;&#x430;&#x43D;&#x438;&#x43C;&#x438;">&#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x430; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x437; &#x434;&#x430;&#x43D;&#x438;&#x43C;&#x438;</h3>
<p>&#x41D;&#x430;&#x439;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x454; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E;&#x433;&#x43E; &#x447;&#x435;&#x440;&#x435;&#x437;  <code>yield</code> &#x443; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>next()</code>. &#x429;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x446;&#x435;, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; <code>result.value</code>, &#x44F;&#x43A; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">run</span>(<span class="hljs-params">taskDef</span>) </span>{

    <span class="hljs-comment">// &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x43C;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x443;&#x441;&#x44E;&#x434;&#x438;</span>
    <span class="hljs-keyword">let</span> task = taskDef();

    <span class="hljs-comment">// &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x43C;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-keyword">let</span> result = task.next();

    <span class="hljs-comment">// &#x440;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x441;&#x442;&#x456;&#x439;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; next()</span>
    <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">step</span>(<span class="hljs-params"></span>) </span>{

        <span class="hljs-comment">// &#x44F;&#x43A;&#x449;&#x43E; &#x454; &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;</span>
        <span class="hljs-keyword">if</span> (!result.done) {
            result = task.next(result.value);
            step();
        }
    }

    <span class="hljs-comment">// &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x43C;&#x43E; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;</span>
    step();

}
</code></pre>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440; <code>result.value</code> &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>next()</code> &#x44F;&#x43A; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;, &#x456; &#x442;&#x43E;&#x43C;&#x443; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x43C;&#x456;&#x436; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43C;&#x438; <code>yield</code>, &#x44F;&#x43A; &#x43E;&#x441;&#x44C; &#x442;&#x443;&#x442;:</p>
<pre><code class="lang-js">run(<span class="hljs-function"><span class="hljs-keyword">function</span>*(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">let</span> value = <span class="hljs-keyword">yield</span> <span class="hljs-number">1</span>;
    <span class="hljs-built_in">console</span>.log(value);         <span class="hljs-comment">// 1</span>

    value = <span class="hljs-keyword">yield</span> value + <span class="hljs-number">3</span>;
    <span class="hljs-built_in">console</span>.log(value);         <span class="hljs-comment">// 4</span>
});
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x434;&#x432;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x44C;: 1 &#x442;&#x430; 4. &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; 1 &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x437; <code>yield 1</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; 1 &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430;&#x437;&#x430;&#x434; &#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; <code>value</code>. 4 &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x43D;&#x43D;&#x44F; 3 &#x434;&#x43E; <code>value</code> &#x442;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x456; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443; &#x43D;&#x430;&#x437;&#x430;&#x434; &#x443; <code>value</code>. &#x422;&#x435;&#x43F;&#x435;&#x440; &#x434;&#x430;&#x43D;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x456;&#x436; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43C;&#x438; <code>yield</code> &#x2014; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x434;&#x43D;&#x443; &#x43C;&#x430;&#x43B;&#x435;&#x43D;&#x44C;&#x43A;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x443; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x442;&#x438; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438;.</p>
<h3 id="&#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x439;-&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;-&#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;">&#x410;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;</h3>
<p>&#x41F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x432; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456; &#x434;&#x430;&#x43D;&#x456; &#x43C;&#x456;&#x436; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43C;&#x438; <code>yield</code>, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441; &#x454; &#x434;&#x435;&#x449;&#x43E; &#x456;&#x43D;&#x448;&#x438;&#x43C;. &#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x435;&#x43D; &#x437;&#x43D;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; &#x442;&#x430; &#x442;&#x435;, &#x44F;&#x43A; &#x457;&#x445; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x442;&#x438;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x437; <code>yield</code> &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x457; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;, &#x446;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x43C;&#x443;&#x441;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x44F;&#x43A;&#x43E;&#x441;&#x44C; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x454; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x44E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x454;&#x44E;, &#x43D;&#x430; &#x44F;&#x43A;&#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x43C;&#x430;&#x454; &#x437;&#x430;&#x447;&#x435;&#x43A;&#x430;&#x442;&#x438;.</p>
<p>&#x41E;&#x441;&#x44C; &#x43E;&#x434;&#x438;&#x43D; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431;, &#x44F;&#x43A;&#x438;&#x43C; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x438;&#x433;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x454; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x44E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x454;&#x44E;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">fetchData</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">callback</span>) </span>{
        callback(<span class="hljs-literal">null</span>, <span class="hljs-string">&quot;Hi!&quot;</span>);
    };
}
</code></pre>
<p>&#x417; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x441;&#x43B;&#x456;&#x434; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x44F;&#x43A;&#x430; &#x43C;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x43E;&#x43C; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>fetchData()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;. &#x41A;&#x43E;&#x43B;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x432;&#x43E;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454; &#x444;&#x443;&#x43D;&#x446;&#x456;&#x44E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x437; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x448;&#x43C;&#x430;&#x442;&#x43A;&#x43E;&#x43C; &#x434;&#x430;&#x43D;&#x438;&#x445; (&#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x43C; <code>&quot;Hi!&quot;</code>). &#x410;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; <code>callback</code> &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x435;&#x43D; &#x43F;&#x440;&#x438;&#x439;&#x442;&#x438; &#x437; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x434;&#x43B;&#x44F; &#x432;&#x43F;&#x435;&#x432;&#x43D;&#x435;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x434;&#x456;&#x454; &#x437; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x43C; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>fetchData()</code> &#x454; &#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x44E;, &#x430;&#x43B;&#x435; &#x432;&#x438; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x457;&#x457; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x44E; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x432;&#x448;&#x438; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x437; &#x43D;&#x435;&#x432;&#x435;&#x43B;&#x438;&#x43A;&#x43E;&#x44E; &#x437;&#x430;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x43E;&#x44E;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">fetchData</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">callback</span>) </span>{
        setTimeout(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
            callback(<span class="hljs-literal">null</span>, <span class="hljs-string">&quot;Hi!&quot;</span>);
        }, <span class="hljs-number">50</span>);
    };
}
</code></pre>
<p>&#x422;&#x430;&#x43A;&#x430; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F; <code>fetchData()</code> &#x432;&#x43D;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x437;&#x430;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x443; &#x43D;&#x430; 50 &#x43C;&#x441; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x438;&#x43C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x43E;&#x43C;, &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x44E;&#x447;&#x438; &#x442;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C;, &#x449;&#x43E; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x43E; &#x434;&#x43E;&#x431;&#x440;&#x435; &#x44F;&#x43A; &#x434;&#x43B;&#x44F; &#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E;, &#x442;&#x430;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443;. &#x412;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x435;&#x432;&#x43D;&#x456;, &#x449;&#x43E; &#x43A;&#x43E;&#x436;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x449;&#x43E; &#x43C;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x437; <code>yield</code>, &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x443;.</p>
<p>&#x417; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x438;&#x43C; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43C;&#x43E;&#x436;&#x435; &#x441;&#x438;&#x433;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x430; &#x454; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x44E;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x442;&#x430;&#x43A;, &#x449;&#x43E;&#x431; &#x432;&#x456;&#x43D; &#x432;&#x440;&#x430;&#x445;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x432; &#x442;&#x430;&#x43A;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443;. &#x429;&#x43E;&#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; <code>result.value</code> &#x454; &#x444;&#x443;&#x43D;&#x446;&#x456;&#x454;&#x44E;, &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x457;&#x457;, &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>next()</code>. &#x41E;&#x441;&#x44C; &#x43E;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">run</span>(<span class="hljs-params">taskDef</span>) </span>{

    <span class="hljs-comment">// &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x43C;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x443;&#x441;&#x44E;&#x434;&#x438;</span>
    <span class="hljs-keyword">let</span> task = taskDef();

    <span class="hljs-comment">// &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x43C;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-keyword">let</span> result = task.next();

    <span class="hljs-comment">// &#x440;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x441;&#x442;&#x456;&#x439;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; next()</span>
    <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">step</span>(<span class="hljs-params"></span>) </span>{

        <span class="hljs-comment">// &#x44F;&#x43A;&#x449;&#x43E; &#x454; &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;</span>
        <span class="hljs-keyword">if</span> (!result.done) {
            <span class="hljs-keyword">if</span> (<span class="hljs-keyword">typeof</span> result.value === <span class="hljs-string">&quot;function&quot;</span>) {
                result.value(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err, data</span>) </span>{
                    <span class="hljs-keyword">if</span> (err) {
                        result = task.throw(err);
                        <span class="hljs-keyword">return</span>;
                    }

                    result = task.next(data);
                    step();
                });
            } <span class="hljs-keyword">else</span> {
                result = task.next(result.value);
                step();
            }

        }
    }

    <span class="hljs-comment">// &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x43C;&#x43E; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;</span>
    step();

}
</code></pre>
<p>&#x42F;&#x43A;&#x449;&#x43E; <code>result.value</code> &#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E; (&#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C; <code>===</code>), &#x442;&#x43E;&#x434;&#x456; &#x432;&#x43E;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;. &#x426;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443; &#x43F;&#x440;&#x438;&#x439;&#x43D;&#x44F;&#x442;&#x43E;&#x43C;&#x443; &#x432; Node.js: &#x43A;&#x43E;&#x43B;&#x438; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x430; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; (<code>err</code>), &#x430; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E;. &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x440;&#x438;&#x441;&#x443;&#x442;&#x43D;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>err</code>, &#x446;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x437;&apos;&#x44F;&#x432;&#x438;&#x43B;&#x430;&#x441;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x456; &#x442;&#x43E;&#x434;&#x456;, &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; <code>task.next()</code>, &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>task.throw()</code> &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x432;&#x438;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C;&#x443; &#x43C;&#x456;&#x441;&#x446;&#x456;. &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x43D;&#x435;&#x43C;&#x430;&#x454;, &#x442;&#x43E;&#x434;&#x456; <code>data</code> &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>task.next()</code>, &#x430; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;. &#x422;&#x43E;&#x434;&#x456;, &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x443;, &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>step()</code>. &#x42F;&#x43A;&#x449;&#x43E; <code>result.value</code> &#x43D;&#x435; &#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E;, &#x442;&#x43E;&#x434;&#x456; &#x432;&#x43E;&#x43D;&#x43E; &#x432;&#x456;&#x434;&#x440;&#x430;&#x437;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>next()</code>.</p>
<p>&#x426;&#x44F; &#x43D;&#x43E;&#x432;&#x430; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x433;&#x43E;&#x442;&#x43E;&#x432;&#x430; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x438; &#x432;&#x441;&#x456;&#x445; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x445; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;. &#x414;&#x43B;&#x44F; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x437; &#x444;&#x430;&#x439;&#x43B;&#x443; &#x443; Node.js, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x43E;&#x431;&#x433;&#x43E;&#x440;&#x442;&#x43A;&#x443; &#x434;&#x43E;&#x432;&#x43A;&#x43E;&#x43B;&#x430; <code>fs.readFile()</code>, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x441;&#x445;&#x43E;&#x436;&#x443; &#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; <code>fetchData()</code> &#x43D;&#x430; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> fs = <span class="hljs-built_in">require</span>(<span class="hljs-string">&quot;fs&quot;</span>);

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">readFile</span>(<span class="hljs-params">filename</span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">callback</span>) </span>{
        fs.readFile(filename, callback);
    };
}
</code></pre>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>readFile()</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;, &#x456;&#x43C;&#x2019;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x443;, &#x442;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>fs.readFile()</code>, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454; &#x457;&#x457; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x446;&#x435; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; <code>yield</code> &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js">run(<span class="hljs-function"><span class="hljs-keyword">function</span>*(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">let</span> contents = <span class="hljs-keyword">yield</span> readFile(<span class="hljs-string">&quot;config.json&quot;</span>);
    doSomethingWith(contents);
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Done&quot;</span>);
});
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44E; <code>readFile()</code> &#x431;&#x435;&#x437; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x438;&#x445; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x432; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;. &#x411;&#x456;&#x43B;&#x44F; <code>yield</code> &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;. &#x41F;&#x43E;&#x43A;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x437; &#x443;&#x441;&#x456;&#x43C; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x43C; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x43E;&#x43C;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x43B;&#x43E;&#x433;&#x456;&#x43A;&#x443;, &#x449;&#x43E; &#x447;&#x438;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;.</p>
<p>&#x417;&#x432;&#x456;&#x441;&#x43D;&#x43E; &#x454; &#x43D;&#x435;&#x434;&#x43E;&#x43B;&#x456;&#x43A;&#x438; &#x43F;&#x456;&#x434;&#x445;&#x43E;&#x434;&#x443;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x432;&#x441;&#x44F; &#x443; &#x446;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x445;, &#x437;&#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x430;, &#x432;&#x438; &#x43D;&#x435; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x435;&#x432;&#x43D;&#x456;, &#x449;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x454; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x44E;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x437;&#x430;&#x440;&#x430;&#x437; &#x43D;&#x430;&#x439;&#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x448;&#x435; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x438; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x438; &#x442;&#x435;&#x43E;&#x440;&#x456;&#x44E;, &#x43D;&#x430; &#x44F;&#x43A;&#x456;&#x439; &#x431;&#x430;&#x437;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x43D;&#x430;&#x434;&#x430;&#x454; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x43F;&#x43B;&#x430;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x445; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;, &#x456; &#x413;&#x43B;&#x430;&#x432;&#x430; 11 &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x43E; &#x446;&#x435; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x448;&#x435;.</p>
<h2 id="&#x43F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;">&#x41F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;</h2>
<p>&#x406;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x454; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; ECMAScript 6 &#x456; &#x454; &#x43A;&#x43E;&#x440;&#x435;&#x43D;&#x435;&#x43C; &#x434;&#x43B;&#x44F; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x438;&#x445; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x43C;&#x43E;&#x432;&#x438;. &#x423; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x430;&#x445; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43D;&#x430;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x443; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x439; API. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x454; &#x43D;&#x430;&#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x456;&#x448;&#x438;&#x445; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x456;&#x432; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x443; ECMAScript 6.</p>
<p>&#x421;&#x438;&#x43C;&#x432;&#x43E;&#x43B; <code>Symbol.iterator</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x42F;&#x43A; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456;, &#x442;&#x430;&#x43A; &#x456; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x456; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x446;&#x435;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;, &#x449;&#x43E;&#x431; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;. &#x42F;&#x43A;&#x449;&#x43E; <code>Symbol.iterator</code> &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;, &#x442;&#x43E;&#x434;&#x456; &#x446;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x432;&#x432;&#x430;&#x436;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;.</p>
<p>&#x426;&#x438;&#x43A;&#x43B; <code>for-of</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x441;&#x435;&#x440;&#x456;&#x457; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x443; &#x446;&#x438;&#x43A;&#x43B;&#x456;. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>for-of</code> &#x454; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C;, &#x43D;&#x456;&#x436; &#x456;&#x442;&#x435;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x442;&#x440;&#x430;&#x434;&#x438;&#x446;&#x456;&#x439;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x443; <code>for</code>, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x430;&#x43C; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x456; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x438;&#x43A;&#x43B;&#x443;. &#x426;&#x438;&#x43A;&#x43B; <code>for-of</code> &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x447;&#x438;&#x442;&#x430;&#x454; &#x443;&#x441;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x456; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x443;&#x454; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x429;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>for-of</code> &#x43B;&#x435;&#x433;&#x448;&#x438;&#x43C;, &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x443; ECMAScript 6 &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x412;&#x441;&#x456; &#x442;&#x438;&#x43F;&#x438; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439; (&#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;, &#x43C;&#x430;&#x43F;&#x438; &#x442;&#x430; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x438;) &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;, &#x44F;&#x43A;&#x456; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x456; &#x442;&#x430;&#x43A;, &#x449;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x457;&#x445;&#x43D;&#x456;&#x439; &#x432;&#x43C;&#x456;&#x441;&#x442; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456;&#x448;&#x438;&#x43C;. &#x420;&#x44F;&#x434;&#x43A;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x44F;&#x43A;&#x438;&#x439; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C; &#x456;&#x442;&#x435;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438; &#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443; (&#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x456;&#x442;&#x435;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x441;&#x43B;&#x43E;&#x432;&#x430;&#x43C;&#x438;).</p>
<p>&#x41E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x437; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x43C;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438; &#x456; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x43E;&#x44E; &#x457;&#x445; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x456;&#x44E; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;. &#x41A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x456;&#x44F; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x437; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x442;&#x430; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;.</p>
<p>&#x413;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x2014; &#x446;&#x435; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x44F;&#x43A;&#x430; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;. &#x41E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x43C; &#x437;&#x456;&#x440;&#x43E;&#x447;&#x43A;&#x438; (<code>*</code>) &#x442;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>yield</code>, &#x44F;&#x43A;&#x456; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x44E;&#x442;&#x44C;, &#x44F;&#x43A;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x438; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x43C;&#x443; &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>next()</code>.</p>
<p>&#x414;&#x435;&#x43B;&#x435;&#x433;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x43D;&#x430;&#x434;&#x430;&#x454; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x443; &#x456;&#x43D;&#x43A;&#x430;&#x43F;&#x441;&#x443;&#x43B;&#x44F;&#x446;&#x456;&#x44E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x438; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;, &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x447;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x445; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x443; &#x43D;&#x43E;&#x432;&#x438;&#x445; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x445;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43B;&#x438; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435;, &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>yield *</code>, &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; <code>yield</code>. &#x426;&#x435; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;.</p>
<p>&#x41C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x446;&#x456;&#x43A;&#x430;&#x432;&#x438;&#x43C; &#x442;&#x430; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x43C; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x43E;&#x43C; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x442;&#x430; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x447;&#x438;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x434;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;, &#x430;&#x43B;&#x435; &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435; <code>yield</code>, &#x449;&#x43E;&#x431; &#x447;&#x435;&#x43A;&#x430;&#x442;&#x438; &#x43D;&#x430; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x445; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="07-Sets-And-Maps.html" class="navigation navigation-prev " aria-label="Previous page: Глава 7: Множини та мапи">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="09-Classes.html" class="navigation navigation-next " aria-label="Next page: Глава 9: Знайомство з класами у JavaScript">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Глава 8: Ітератори та генератори","level":"1.10","depth":1,"next":{"title":"Глава 9: Знайомство з класами у JavaScript","level":"1.11","depth":1,"path":"manuscript/09-Classes.md","ref":"manuscript/09-Classes.md","articles":[]},"previous":{"title":"Глава 7: Множини та мапи","level":"1.9","depth":1,"path":"manuscript/07-Sets-And-Maps.md","ref":"manuscript/07-Sets-And-Maps.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","yametrika","ga","rss","github-buttons"],"pluginsConfig":{"yametrika":{"number":"41711034"},"github":{"url":"https://github.com/denysdovhan/understandinges6ua"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Рoзуміння ECMAScript 6","description":"Український переклад книги «Understanding ES6».","author":"Denys Dovhan and Terry Sahaidak","site_url":"http://understandinges6.denysdovhan.com/","feed_url":"http://understandinges6.denysdovhan.com/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"github-buttons":{"repo":"denysdovhan/understandinges6ua","types":["star"],"size":"small"},"ga":{"configuration":"auto","token":"UA-40496885-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/denysdovhan/understandinges6ua/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"manuscript/08-Iterators-And-Generators.md","mtime":"2017-01-16T14:14:39.023Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-01-16T14:16:21.136Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-yametrika/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

