
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Глава 9: Знайомство з класами у JavaScript · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="10-Arrays.html" />
    
    
    <link rel="prev" href="08-Iterators-And-Generators.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"denysdovhan/understandinges6ua","types":["star"],"size":"small"};
    </script>

    <link href="http://understandinges6.denysdovhan.com/rss.xml" title="Рoзуміння ECMAScript 6" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Рoзуміння ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-Block-Bindings.html">
            
                <a href="01-Block-Bindings.html">
            
                    
                    Глава 1: Блочне зв’язування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02-Strings-and-Regular-Expressions.html">
            
                <a href="02-Strings-and-Regular-Expressions.html">
            
                    
                    Глава 2: Рядки та регулярні вирази
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03-Functions.html">
            
                <a href="03-Functions.html">
            
                    
                    Глава 3: Функції
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="04-Objects.html">
            
                <a href="04-Objects.html">
            
                    
                    Глава 4: Розширена функціональність об’єктів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="05-Destructuring.html">
            
                <a href="05-Destructuring.html">
            
                    
                    Глава 5: Деструктурування для легшого доступу до даних
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="06-Symbols.html">
            
                <a href="06-Symbols.html">
            
                    
                    Глава 6: Символи та їх властивості
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="07-Sets-And-Maps.html">
            
                <a href="07-Sets-And-Maps.html">
            
                    
                    Глава 7: Множини та мапи
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="08-Iterators-And-Generators.html">
            
                <a href="08-Iterators-And-Generators.html">
            
                    
                    Глава 8: Ітератори та генератори
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="09-Classes.html">
            
                <a href="09-Classes.html">
            
                    
                    Глава 9: Знайомство з класами у JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10-Arrays.html">
            
                <a href="10-Arrays.html">
            
                    
                    Глава 10: Покращені можливості масивів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11-Promises.html">
            
                <a href="11-Promises.html">
            
                    
                    Глава 11: Проміси та асинхронне програмування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12-Proxies-and-Reflection.html">
            
                <a href="12-Proxies-and-Reflection.html">
            
                    
                    Глава 12: Проксі та АРІ рефлексії
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" >
            
                <span>
            
                    
                    Глава 13: Інкапсуляція коду через модулі
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" >
            
                <span>
            
                    
                    Додаток А: Дрібніші зміни у ECMAScript 6
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" >
            
                <span>
            
                    
                    Додаток Б: Розуміння ECMAScript 7 (2016)
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Глава 9: Знайомство з класами у JavaScript</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x437;&#x43D;&#x430;&#x439;&#x43E;&#x43C;&#x441;&#x442;&#x432;&#x43E;-&#x437;-&#x43A;&#x43B;&#x430;&#x441;&#x430;&#x43C;&#x438;-&#x443;-javascript">&#x417;&#x43D;&#x430;&#x439;&#x43E;&#x43C;&#x441;&#x442;&#x432;&#x43E; &#x437; &#x43A;&#x43B;&#x430;&#x441;&#x430;&#x43C;&#x438; &#x443; JavaScript</h1>
<p>&#x41D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x441;&#x442;&#x456; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;-&#x43E;&#x440;&#x456;&#x454;&#x43D;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x43E;&#x432; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, JavaScript &#x43D;&#x435; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x432; &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x456; &#x43A;&#x43B;&#x430;&#x441;&#x438;&#x447;&#x43D;&#x435; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x441;&#x43E;&#x431;&#x443; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x438;&#x445; &#x456; &#x43F;&#x43E;&#x432;&apos;&#x44F;&#x437;&#x430;&#x43D;&#x438;&#x445; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x43A;&#x43E;&#x43B;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x43B;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E;. &#x426;&#x435; &#x441;&#x43F;&#x430;&#x43D;&#x442;&#x435;&#x43B;&#x438;&#x447;&#x438;&#x43B;&#x43E; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432;, &#x456; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; pre-ECMAScript 1, &#x432;&#x435;&#x441;&#x44C; &#x447;&#x430;&#x441; &#x434;&#x43E; ECMAScript 5 &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x43D;&#x43E;, &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x43B;&#x438; &#x443;&#x442;&#x438;&#x43B;&#x456;&#x442;&#x438;, &#x449;&#x43E;&#x431; &#x456;&#x43C;&#x456;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x432; JavaScript. &#x423; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441;, &#x43A;&#x43E;&#x43B;&#x438; &#x434;&#x435;&#x44F;&#x43A;&#x456; JavaScript &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x431;&#x443;&#x43B;&#x456; &#x432;&#x43F;&#x435;&#x432;&#x43D;&#x435;&#x43D;&#x456;, &#x449;&#x43E; &#x43C;&#x43E;&#x432;&#x430; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x454; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;, &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x430; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A;, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x445; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x446;&#x456;&#x454;&#x457; &#x43C;&#x435;&#x442;&#x438; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x43B;&#x430; &#x434;&#x43E; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x432; ECMAScript 6.</p>
<p>&#x41F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x432;&#x438;&#x432;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; ECMAScript 6 &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x43E; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x456; &#x43C;&#x435;&#x445;&#x430;&#x43D;&#x456;&#x437;&#x43C;&#x438;, &#x44F;&#x43A;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x43A;&#x43B;&#x430;&#x441;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x446;&#x435;&#x439; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x43E;&#x431;&#x433;&#x43E;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x434;&#x43E;&#x43C;&#x43E;&#x433;&#x43B;&#x438;&#x441;&#x44F; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x438; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E;&#x457; &#x434;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x437;&#x430;&#x441;&#x43E;&#x431;&#x430;&#x43C;&#x438; ECMAScript 5. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x44F;&#x43A; &#x432;&#x438; &#x43F;&#x43E;&#x431;&#x430;&#x447;&#x438;&#x442;&#x435; &#x437;&#x433;&#x43E;&#x434;&#x43E;&#x43C;, ECMAScript 6 &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x43D;&#x435; &#x454; &#x441;&#x430;&#x43C;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x43C;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x430;&#x43C;&#x438;, &#x44F;&#x43A; &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x432; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432;&#x430;&#x445;. &#x412;&#x43E;&#x43D;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;, &#x44F;&#x43A;&#x456; &#x43D;&#x430;&#x434;&#x430;&#x454; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x456;&#x447;&#x43D;&#x438;&#x439; &#x445;&#x430;&#x440;&#x430;&#x43A;&#x442;&#x435;&#x440; JavaScript.</p>
<h2 id="&#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x456;-&#x434;&#x43E;-&#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;-&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x438;-&#x432;-ecmascript-5">&#x41F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x456; &#x434;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x438; &#x432; ECMAScript 5</h2>
<p>&#x412; ECMAScript 5 &#x442;&#x430; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435;, JavaScript &#x43D;&#x435; &#x43C;&#x430;&#x432; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;. &#x41D;&#x430;&#x439;&#x431;&#x43B;&#x438;&#x436;&#x447;&#x438;&#x43C; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x434;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x431;&#x443;&#x43B;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x443; &#x437; &#x43F;&#x43E;&#x434;&#x430;&#x43B;&#x44C;&#x448;&#x438;&#x43C; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x434;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430;, &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434;, &#x44F;&#x43A; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43E;, &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">PersonType</span>(<span class="hljs-params">name</span>) </span>{
    <span class="hljs-keyword">this</span>.name = name;
}

PersonType.prototype.sayName = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">this</span>.name);
};

<span class="hljs-keyword">let</span> person = <span class="hljs-keyword">new</span> PersonType(<span class="hljs-string">&quot;Nicholas&quot;</span>);
person.sayName();   <span class="hljs-comment">// &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &quot;Nicholas&quot;</span>

<span class="hljs-built_in">console</span>.log(person <span class="hljs-keyword">instanceof</span> PersonType);  <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(person <span class="hljs-keyword">instanceof</span> <span class="hljs-built_in">Object</span>);      <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, <code>PersonType</code> &#x2014; &#x446;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;&#x2013;&#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;, &#x44F;&#x43A;&#x430; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x454;&#x434;&#x438;&#x43D;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x437; &#x456;&#x43C;&apos;&#x44F;&#x43C; <code>name</code>. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>sayName()</code> &#x437;&#x432;&apos;&#x44F;&#x437;&#x430;&#x43D;&#x438;&#x439; &#x437; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x43E;&#x43C;, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x43E;&#x434;&#x43D;&#x430; &#x439; &#x442;&#x430; &#x441;&#x430;&#x43C;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x454; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x44E; &#x432;&#x441;&#x456;&#x43C; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;&#x43C; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443; <code>PersonType</code>. &#x41F;&#x43E;&#x442;&#x456;&#x43C;, &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443; <code>PersonType</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>new</code>. &#x41E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x456;&#x439; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442; <code>person</code> &#x432;&#x432;&#x430;&#x436;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x43C; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x456;&#x432; <code>PersonType</code> &#x442;&#x430; <code>Object</code> &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E; &#x434;&#x43E; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x456;&#x432;.</p>
<p>&#x426;&#x435;&#x439; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x438;&#x439; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x454; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43E;&#x44E; &#x431;&#x430;&#x433;&#x430;&#x442;&#x44C;&#x43E;&#x445; JavaScript &#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A;, &#x44F;&#x43A;&#x456; &#x456;&#x43C;&#x456;&#x442;&#x443;&#x44E;&#x442;&#x44C; &#x43A;&#x43B;&#x430;&#x441;&#x438;, &#x456; &#x441;&#x430;&#x43C;&#x435; &#x437; &#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x431;&#x435;&#x440;&#x443;&#x442;&#x44C; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43E;&#x43A; &#x43A;&#x43B;&#x430;&#x441;&#x438;.</p>
<h2 id="&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;-&#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;">&#x41E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;</h2>
<p>&#x41D;&#x430;&#x439;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x43E;&#x44E; &#x444;&#x43E;&#x440;&#x43C;&#x43E;&#x44E; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x432; ECMAScript 6 &#x454; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x44F;&#x43A;&#x435; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x43C; &#x43D;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x432; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432;&#x430;&#x445;.</p>
<h3 id="&#x431;&#x430;&#x437;&#x43E;&#x432;&#x435;-&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;-&#x43A;&#x43B;&#x430;&#x441;&#x443;">&#x411;&#x430;&#x437;&#x43E;&#x432;&#x435; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443;</h3>
<p>&#x41E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>class</code> &#x437;&#x430; &#x44F;&#x43A;&#x438;&#x43C; &#x441;&#x43B;&#x456;&#x434;&#x443;&#x454; &#x456;&#x43C;&apos;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x406;&#x43D;&#x448;&#x430; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E;&#x44E; &#x434;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x432; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;&#x445; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x43D;&#x435; &#x432;&#x438;&#x43C;&#x430;&#x433;&#x430;&#x44E;&#x447;&#x438; &#x43A;&#x43E;&#x43C;&#x438; &#x43C;&#x456;&#x436; &#x43D;&#x438;&#x43C;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43E;&#x441;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x435; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">PersonClass</span> </span>{

    <span class="hljs-comment">// &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; PersonType</span>
    <span class="hljs-keyword">constructor</span>(name) {
        <span class="hljs-keyword">this</span>.name = name;
    }

    <span class="hljs-comment">// &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; PersonType.prototype.sayName</span>
    sayName() {
        <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">this</span>.name);
    }
}

<span class="hljs-keyword">let</span> person = <span class="hljs-keyword">new</span> PersonClass(<span class="hljs-string">&quot;Nicholas&quot;</span>);
person.sayName();   <span class="hljs-comment">// &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &quot;Nicholas&quot;</span>

<span class="hljs-built_in">console</span>.log(person <span class="hljs-keyword">instanceof</span> PersonClass);     <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(person <span class="hljs-keyword">instanceof</span> <span class="hljs-built_in">Object</span>);          <span class="hljs-comment">// true</span>

<span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> PersonClass);                    <span class="hljs-comment">// &quot;function&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> PersonClass.prototype.sayName);  <span class="hljs-comment">// &quot;function&quot;</span>
</code></pre>
<p>&#x41E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443; <code>PersonClass</code> &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E; &#x434;&#x43E; <code>PersonType</code> &#x437; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;. &#x410;&#x43B;&#x435; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x44F;&#x43A; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;, &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x437; &#x456;&#x43C;&apos;&#x44F;&#x43C; <code>constructor</code>. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x43B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;, &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43D;&#x456;&#x44F;&#x43A;&#x43E;&#x457; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>function</code>. &#x412;&#x441;&#x456; &#x456;&#x43D;&#x448;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x43D;&#x435; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x435;&#x43D;&#x441;&#x443;, &#x442;&#x430;&#x43A; &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x441;&#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;, &#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435;.</p>
<p>I&gt; <em>&#x412;&#x43B;&#x430;&#x441;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;</em>, &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x44F;&#x43A;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x456;, &#x430; &#x43D;&#x435; &#x432; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x456;, &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x456; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x430;&#x431;&#x43E; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;. &#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; <code>name</code> &#x454; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x43E;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E;. &#x42F; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x44E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x432;&#x441;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430;, &#x449;&#x43E;&#x431; &#x454;&#x434;&#x438;&#x43D;&#x435; &#x43C;&#x456;&#x441;&#x446;&#x435; &#x432; &#x43A;&#x43B;&#x430;&#x441;&#x456; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x43B;&#x43E; &#x437;&#x430; &#x43D;&#x438;&#x445; &#x443;&#x441;&#x456;&#x445;.</p>
<p>&#x426;&#x456;&#x43A;&#x430;&#x432;&#x43E;, &#x449;&#x43E; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x454; &#x43B;&#x438;&#x448;&#x435; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x438;&#x43C; &#x446;&#x443;&#x43A;&#x440;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x438;&#x445; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x44C; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x446;&#x44C;&#x43A;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432;. &#x41E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; <code>PersonClass</code> &#x444;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x44F;&#x43A;&#x430; &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x44F;&#x43A; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>constructor</code>, &#x442;&#x43E;&#x43C;&#x443; <code>typeof PersonClass</code> &#x432;&#x438;&#x432;&#x435;&#x434;&#x435; <code>&quot;function&quot;</code> &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>sayName()</code> &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>PersonClass.prototype</code> &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E; &#x432;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x438;&#x43D;&#x430;&#x43C; &#x43C;&#x456;&#x436; <code>sayName()</code> &#x442;&#x430; <code>PersonType.prototype</code> &#x443; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;. &#x426;&#x456; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x437;&#x43C;&#x456;&#x448;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x446;&#x44C;&#x43A;&#x456; &#x442;&#x438;&#x43F;&#x438; &#x442;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x438;, &#x43D;&#x435; &#x442;&#x443;&#x440;&#x431;&#x443;&#x44E;&#x447;&#x438;&#x441;&#x44C; &#x437;&#x430;&#x43D;&#x430;&#x434;&#x442;&#x43E; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x43F;&#x440;&#x43E; &#x442;&#x435;, &#x449;&#x43E; &#x441;&#x430;&#x43C;&#x435; &#x432;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x435;.</p>
<h3 id="&#x43D;&#x430;&#x432;&#x456;&#x449;&#x43E;-&#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;-&#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;-&#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;">&#x41D;&#x430;&#x432;&#x456;&#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;</h3>
<p>&#x41D;&#x435;&#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x456;&#x436; &#x43A;&#x43B;&#x430;&#x441;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x446;&#x44C;&#x43A;&#x438;&#x43C;&#x438; &#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438;, &#x454; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x456; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x456;, &#x43F;&#x440;&#x43E; &#x44F;&#x43A;&#x456; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x430;&#x442;&#x438;:</p>
<ol>
<li>&#x41E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;, &#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x44C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439;, &#x43D;&#x435; &#x43F;&#x456;&#x434;&#x43D;&#x456;&#x43C;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F;. &#x41E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E; &#x434;&#x43E; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; <code>let</code>, &#x456; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x442;&#x44C; &#x432; &#x442;&#x438;&#x43C;&#x447;&#x430;&#x441;&#x43E;&#x432;&#x456;&#x439; &#x43C;&#x435;&#x440;&#x442;&#x432;&#x456;&#x439; &#x437;&#x43E;&#x43D;&#x456;, &#x43F;&#x43E;&#x43A;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x434;&#x43E;&#x441;&#x44F;&#x433;&#x43D;&#x435; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;;</li>
<li>&#x412;&#x435;&#x441;&#x44C; &#x43A;&#x43E;&#x434; &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x441;&#x443;&#x432;&#x43E;&#x440;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;. &#x41D;&#x435; &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x438; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x443;&#x432;&#x43E;&#x440;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x443;;</li>
<li>&#x423;&#x441;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x454; &#x43D;&#x435;&#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438;. &#x426;&#x435; &#x454; &#x441;&#x443;&#x442;&#x442;&#x454;&#x432;&#x43E;&#x44E; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x432;&#x456;&#x434; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x446;&#x44C;&#x43A;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432;, &#x434;&#x435; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>Object.defineProperty()</code> &#x449;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43D;&#x435;&#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x43C;;</li>
<li>&#x412;&#x441;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43D;&#x435; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>[[Construct]]</code> &#x456; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x454;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x457;&#x445; &#x437; <code>new</code>;</li>
<li>&#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x431;&#x435;&#x437; <code>new</code> &#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x43A;&#x443;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;;</li>
<li>&#x421;&#x43F;&#x440;&#x43E;&#x431;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x456;&#x43C;&apos;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;.</li>
</ol>
<p>&#x41C;&#x430;&#x44E;&#x447;&#x438; &#x432;&#x441;&#x435; &#x446;&#x435; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;, &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; <code>PersonClass</code> &#x437; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x454; &#x43F;&#x440;&#x44F;&#x43C;&#x43E; &#x442;&#x43E;&#x442;&#x43E;&#x436;&#x43D;&#x456;&#x43C; &#x434;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43A;&#x43B;&#x430;&#x441;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x43F;&#x440;&#x44F;&#x43C;&#x438;&#x439; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x434;&#x43E; PersonClass</span>
<span class="hljs-keyword">let</span> PersonType2 = (<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
<span class="hljs-meta">
    &quot;use strict&quot;</span>;

    <span class="hljs-keyword">const</span> PersonType2 = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">name</span>) </span>{

        <span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x43C;&#x43E;&#x441;&#x44F;, &#x449;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x431;&#x443;&#x43B;&#x430; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x430; &#x437; new</span>
        <span class="hljs-keyword">if</span> (<span class="hljs-keyword">typeof</span> <span class="hljs-keyword">new</span>.target === <span class="hljs-string">&quot;undefined&quot;</span>) {
            <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Constructor must be called with new.&quot;</span>);
        }

        <span class="hljs-keyword">this</span>.name = name;
    }

    <span class="hljs-built_in">Object</span>.defineProperty(PersonType2.prototype, <span class="hljs-string">&quot;sayName&quot;</span>, {
        value: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{

            <span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x43C;&#x43E;&#x441;&#x44F;, &#x449;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43D;&#x435; &#x431;&#x443;&#x432; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x438;&#x439; &#x437; new</span>
            <span class="hljs-keyword">if</span> (<span class="hljs-keyword">typeof</span> <span class="hljs-keyword">new</span>.target !== <span class="hljs-string">&quot;undefined&quot;</span>) {
                <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Method cannot be called with new.&quot;</span>);
            }

            <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">this</span>.name);
        },
        enumerable: <span class="hljs-literal">false</span>,
        writable: <span class="hljs-literal">true</span>,
        configurable: <span class="hljs-literal">true</span>
    });

    <span class="hljs-keyword">return</span> PersonType2;
}());
</code></pre>
<p>&#x41F;&#x43E;-&#x43F;&#x435;&#x440;&#x448;&#x435;, &#x437;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;, &#x449;&#x43E; &#x442;&#x443;&#x442; &#x43C;&#x438; &#x43C;&#x430;&#x454;&#x43C;&#x43E; &#x434;&#x432;&#x430; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; <code>PersonType2</code>: &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; <code>let</code> &#x443; &#x437;&#x43E;&#x432;&#x43D;&#x456;&#x448;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;, &#x442;&#x430; &#x437; <code>const</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; <a href="https://developer.mozilla.org/ru/docs/%D0%A1%D0%BB%D0%BE%D0%B2%D0%B0%D1%80%D1%8C/IIFE" target="_blank">&#x41D;&#x412;&#x424;&#x412; (IIFE)</a> (&#x43D;&#x435;&#x433;&#x430;&#x439;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;). &#x41E;&#x441;&#x44C; &#x44F;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x44E;&#x442;&#x44C; &#x437;&#x430;&#x431;&#x43E;&#x440;&#x43E;&#x43D;&#x443; &#x43D;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441; &#x456;&#x43C;&apos;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441;, &#x44F;&#x43A; &#x43A;&#x43E;&#x434; &#x43F;&#x43E;&#x437;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x43E;&#x43C; &#x43C;&#x430;&#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x435; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x454; <code>new.target</code>, &#x449;&#x43E;&#x431; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44F;, &#x449;&#x43E; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x435; &#x437; <code>new</code>; &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x456;, &#x442;&#x43E; &#x431;&#x443;&#x434;&#x443; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;. &#x414;&#x430;&#x43B;&#x456;, &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>sayName()</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x44F;&#x43A; &#x43D;&#x435;&#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x439;, &#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x454; <code>new.target</code>, &#x449;&#x43E;&#x431; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44F;, &#x449;&#x43E; &#x439;&#x43E;&#x433;&#x43E; &#x43D;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x43E; &#x437; <code>new</code>. &#x424;&#x456;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43A;&#x440;&#x43E;&#x43A; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;&#x2013;&#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;.</p>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x432;&#x441;&#x435;, &#x449;&#x43E; &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x442;&#x44C; &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x431;&#x435;&#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443;, &#x442;&#x430; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x437;&#x43D;&#x430;&#x447;&#x43D;&#x43E; &#x441;&#x43F;&#x440;&#x43E;&#x449;&#x443;&#x454; &#x432;&#x441;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x441;&#x442;&#x44C;.</p>
<h3 id="a-&#x441;&#x442;&#x430;&#x43B;&#x456;-&#x456;&#x43C;&#x435;&#x43D;&#x430;-&#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;">A&gt; &#x421;&#x442;&#x430;&#x43B;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;</h3>
<p>A&gt; &#x406;&#x43C;&apos;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x44F;&#x43A; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; <code>const</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x456;&#x43C;&apos;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x43F;&#x43E;&#x437;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x43E;&#x43C;, &#x430;&#x43B;&#x435; &#x43D;&#x435; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Foo</span> </span>{
   <span class="hljs-keyword">constructor</span>() {
       Foo = <span class="hljs-string">&quot;bar&quot;</span>;    <span class="hljs-comment">// &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x456;</span>
   }
}

<span class="hljs-comment">// &#x430;&#x43B;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443;</span>
Foo = <span class="hljs-string">&quot;baz&quot;</span>;
</code></pre>
<p>A&gt; &#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, <code>Foo</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x454; &#x441;&#x43E;&#x431;&#x43E;&#x44E; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x435; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437; <code>Foo</code> &#x43F;&#x43E;&#x437;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x43E;&#x43C;. &#x412;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x456;&#x439; <code>Foo</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43E; &#x442;&#x430;&#x43A;, &#x43D;&#x430;&#x447;&#x435; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x437; <code>const</code>, &#x456; &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x456;&#x43D; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x439;. &#x41F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x432;&#x438;&#x43D;&#x438;&#x43A;&#x430;&#x454; &#x43A;&#x43E;&#x43B;&#x438; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x43D;&#x430;&#x43C;&#x430;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; <code>Foo</code> &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;. &#x410;&#x43B;&#x435;, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; &#x437;&#x43E;&#x432;&#x43D;&#x456;&#x448;&#x43D;&#x454; <code>Foo</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x435;, &#x44F;&#x43A;&#x431;&#x438; &#x446;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x437; <code>let</code> &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x44C;-&#x43A;&#x43E;&#x43B;&#x438;.</p>
<h2 id="&#x432;&#x438;&#x440;&#x430;&#x437;&#x438;-&#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;">&#x412;&#x438;&#x440;&#x430;&#x437;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;</h2>
<p>&#x41A;&#x43B;&#x430;&#x441;&#x438; &#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x441;&#x445;&#x43E;&#x436;&#x456; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x434;&#x432;&#x456; &#x444;&#x43E;&#x440;&#x43C;&#x438;: &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x442;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43F;&#x435;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; (<code>function</code> &#x430;&#x431;&#x43E; <code>class</code>, &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;), &#x449;&#x43E; &#x439;&#x434;&#x435; &#x437;&#x430; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x444;&#x43E;&#x440;&#x43C;&#x443; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;, &#x44F;&#x43A;&#x456;&#x439; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x454; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x43F;&#x456;&#x441;&#x43B;&#x44F; <code>function</code>, &#x442;&#x430; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x444;&#x43E;&#x440;&#x43C;&#x443; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;, &#x44F;&#x43A;&#x430; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x454; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x43F;&#x456;&#x441;&#x43B;&#x44F; <code>class</code>. &#x426;&#x456; <em>&#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;</em> &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x432; &#x43F;&#x440;&#x438; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;, &#x430;&#x431;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x456; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439;.</p>
<h3 id="&#x431;&#x430;&#x437;&#x43E;&#x432;&#x438;&#x439;-&#x432;&#x438;&#x440;&#x430;&#x437;-&#x43A;&#x43B;&#x430;&#x441;&#x443;">&#x411;&#x430;&#x437;&#x43E;&#x432;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x43A;&#x43B;&#x430;&#x441;&#x443;</h3>
<p>&#x41E;&#x441;&#x44C; &#x432;&#x438;&#x440;&#x430;&#x437; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443; <code>PersonClass</code>, &#x430; &#x434;&#x430;&#x43B;&#x456; &#x441;&#x43B;&#x456;&#x434;&#x443;&#x454; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;, &#x449;&#x43E; &#x439;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> PersonClass = <span class="hljs-class"><span class="hljs-keyword">class</span> </span>{

    <span class="hljs-comment">// &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; PersonType</span>
    <span class="hljs-keyword">constructor</span>(name) {
        <span class="hljs-keyword">this</span>.name = name;
    }

    <span class="hljs-comment">// &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x434;&#x43E; PersonType.prototype.sayName</span>
    sayName() {
        <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">this</span>.name);
    }
};

<span class="hljs-keyword">let</span> person = <span class="hljs-keyword">new</span> PersonClass(<span class="hljs-string">&quot;Nicholas&quot;</span>);
person.sayName();   <span class="hljs-comment">// &#x432;&#x438;&#x432;&#x435;&#x434;&#x435; &quot;Nicholas&quot;</span>

<span class="hljs-built_in">console</span>.log(person <span class="hljs-keyword">instanceof</span> PersonClass);     <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(person <span class="hljs-keyword">instanceof</span> <span class="hljs-built_in">Object</span>);          <span class="hljs-comment">// true</span>

<span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> PersonClass);                    <span class="hljs-comment">// &quot;function&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> PersonClass.prototype.sayName);  <span class="hljs-comment">// &quot;function&quot;</span>
</code></pre>
<p>&#x42F;&#x43A; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x446;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x43D;&#x435; &#x432;&#x438;&#x43C;&#x430;&#x433;&#x430;&#x44E;&#x442;&#x44C; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x443; &#x43F;&#x456;&#x441;&#x43B;&#x44F; <code>class</code>. &#x41A;&#x440;&#x456;&#x43C; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443;, &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x456; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43A;&#x43B;&#x430;&#x441;&#x443;.</p>
<p>&#x412; &#x430;&#x43D;&#x43E;&#x43D;&#x456;&#x43C;&#x43D;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x44F;&#x43A; &#x432; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, <code>PersonClass.name</code> &#x454; &#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x43C;. &#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443;, <code>PersonClass.name</code> &#x431;&#x443;&#x434;&#x435; <code>&quot;PersonClass&quot;</code>.</p>
<p>I&gt; &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x435; &#x432;&#x438; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x430;&#x431;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x432;&#x437;&#x430;&#x433;&#x430;&#x43B;&#x456; &#x454; &#x43F;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x441;&#x442;&#x438;&#x43B;&#x44E;. &#x41D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439; &#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;, &#x43E;&#x431;&#x438;&#x434;&#x432;&#x430;, &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x43D;&#x435; &#x43F;&#x456;&#x434;&#x456;&#x439;&#x43C;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x456; &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x431;&#x456;&#x440; &#x43C;&#x430;&#x454; &#x43D;&#x435;&#x432;&#x435;&#x43B;&#x438;&#x43A;&#x438;&#x439; &#x432;&#x43F;&#x43B;&#x438;&#x432; &#x43D;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x443;. &#x404;&#x434;&#x438;&#x43D;&#x430; &#x456;&#x441;&#x442;&#x43E;&#x442;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x43E;&#x43B;&#x44F;&#x433;&#x430;&#x454; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x430;&#x43D;&#x43E;&#x43D;&#x456;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x43C;&#x430;&#x44E;&#x442;&#x44C; <code>name</code> &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;, &#x44F;&#x43A;&#x430; &#x454; &#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x43C;, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>name</code>, &#x44F;&#x43A;&#x430; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43D;&#x430;&#x437;&#x432;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x443; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;,<code>PersonClass.name</code> &#x454; <code>&quot;PersonClass&quot;</code>, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443;).</p>
<h3 id="&#x456;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x456;-&#x432;&#x438;&#x440;&#x430;&#x437;&#x438;-&#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;">&#x406;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;</h3>
<p>&#x41F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x439; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x432; &#x430;&#x43D;&#x43E;&#x43D;&#x456;&#x43C;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x432; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x430;&#x43B;&#x435; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x430;&#x445;, &#x432;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x432;&#x438;&#x440;&#x430;&#x437;&#x430;&#x43C; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;. &#x429;&#x43E;&#x431; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x446;&#x435;, &#x432;&#x441;&#x442;&#x430;&#x432;&#x442;&#x435; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>class</code>, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> PersonClass = <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">PersonClass2</span> </span>{

    <span class="hljs-comment">// &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; PersonType</span>
    <span class="hljs-keyword">constructor</span>(name) {
        <span class="hljs-keyword">this</span>.name = name;
    }

    <span class="hljs-comment">// &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x434;&#x43E; PersonType.prototype.sayName</span>
    sayName() {
        <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">this</span>.name);
    }
};

<span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> PersonClass);        <span class="hljs-comment">// &quot;function&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> PersonClass2);       <span class="hljs-comment">// &quot;undefined&quot;</span>
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x432;&#x438;&#x440;&#x430;&#x437; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x43C;&#x430;&#x454; &#x456;&#x43C;&apos;&#x44F; <code>PersonClass2</code>. &#x406;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440; <code>PersonClass2</code> &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x440;&#x430;&#x437;&#x43E;&#x43C; &#x437; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x432;&#x456;&#x43D; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x438;&#x439; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x43A;&#x43B;&#x430;&#x441;&#x443; (&#x442;&#x430;&#x43A;&#x438;&#x445; &#x44F;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>sayName()</code> &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;). &#x417;&#x430; &#x43C;&#x435;&#x436;&#x430;&#x43C;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x443;, <code>typeof PersonClass2</code> &#x454; <code>&quot;undefined&quot;</code> &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x442;&#x443;&#x442; &#x43D;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437; <code>PersonClass2</code>. &#x429;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438; &#x447;&#x43E;&#x43C;&#x443; &#x442;&#x430;&#x43A; &#x441;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43F;&#x43E;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x43D;&#x430; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x435; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43A;&#x43B;&#x430;&#x441;&#x438;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x43F;&#x440;&#x44F;&#x43C;&#x438;&#x439; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x434;&#x43E; &#x456;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x443; PersonClass</span>
<span class="hljs-keyword">let</span> PersonClass = (<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
<span class="hljs-meta">
    &quot;use strict&quot;</span>;

    <span class="hljs-keyword">const</span> PersonClass2 = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">name</span>) </span>{

        <span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x43C;&#x43E;&#x441;&#x44F;, &#x449;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x43E; &#x437; new</span>
        <span class="hljs-keyword">if</span> (<span class="hljs-keyword">typeof</span> <span class="hljs-keyword">new</span>.target === <span class="hljs-string">&quot;undefined&quot;</span>) {
            <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Constructor must be called with new.&quot;</span>);
        }

        <span class="hljs-keyword">this</span>.name = name;
    }

    <span class="hljs-built_in">Object</span>.defineProperty(PersonClass2.prototype, <span class="hljs-string">&quot;sayName&quot;</span>, {
        value: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
            <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">this</span>.name);
        },
        enumerable: <span class="hljs-literal">false</span>,
        writable: <span class="hljs-literal">true</span>,
        configurable: <span class="hljs-literal">true</span>
    });

    <span class="hljs-keyword">return</span> PersonClass2;
}());
</code></pre>
<p>&#x421;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x456;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x43D;&#x435; &#x43D;&#x430; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x440;&#x443;&#x448;&#x456;&#x44F; JavaScript. &#x414;&#x43B;&#x44F; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x44C; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x437;&#x43E;&#x432;&#x43D;&#x456;&#x448;&#x43D;&#x454; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; (&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; <code>let</code>) &#x43C;&#x430;&#x454; &#x442;&#x435; &#x436; &#x456;&#x43C;&apos;&#x44F;, &#x449;&#x43E; &#x456; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x454; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; (&#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; <code>const</code>). &#x406;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x441;&#x432;&#x43E;&#x454; &#x456;&#x43C;&apos;&#x44F; &#x43F;&#x440;&#x438; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x456; <code>const</code>, &#x442;&#x43E;&#x43C;&#x443; <code>PersonClass2</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x443;.</p>
<p>&#x423; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; &#x456;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x43D;&#x430;&#x439;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;, &#x454; &#x449;&#x435; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x441;&#x445;&#x43E;&#x436;&#x43E;&#x433;&#x43E; &#x43C;&#x456;&#x436; &#x43D;&#x438;&#x43C;&#x438;. &#x41E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x456; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;, &#x456; &#x446;&#x435; &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x454; &#x431;&#x435;&#x437;&#x43B;&#x456;&#x447; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x44F;&#x43A;&#x456; &#x44F; &#x43E;&#x43F;&#x438;&#x448;&#x443; &#x434;&#x430;&#x43B;&#x456;.</p>
<h2 id="&#x43A;&#x43B;&#x430;&#x441;&#x438;-&#x44F;&#x43A;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x438;-&#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E;-&#x440;&#x43E;&#x434;&#x443;">&#x41A;&#x43B;&#x430;&#x441;&#x438; &#x44F;&#x43A; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x434;&#x443;</h2>
<p>&#x412; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456;, &#x43F;&#x435;&#x432;&#x43D;&#x430; &#x441;&#x443;&#x442;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x43E;&#x436;&#x435; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; <em>&#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x43E;&#x43C; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x434;&#x443;</em> (<a href="https://uk.wikipedia.org/wiki/%D0%9E%D0%B1%27%D1%94%D0%BA%D1%82_%D0%BF%D0%B5%D1%80%D1%88%D0%BE%D0%B3%D0%BE_%D0%BA%D0%BB%D0%B0%D1%81%D1%83" target="_blank">First-class citizen</a>), &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x430; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x430; &#x44F;&#x43A; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x43C;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x443; &#x432;&#x430;&#x437;&#x456;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x430; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E;, &#x442;&#x430; &#x437;&#x432;&apos;&#x44F;&#x437;&#x430;&#x43D;&#x430; &#x437;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x44E;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x432; JavaScript &#x454; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443; (&#x456;&#x43D;&#x43E;&#x434;&#x456; &#x457;&#x445; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x44C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;&#x43C;&#x438; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443;), &#x456; &#x446;&#x435; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; JavaScript &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;.</p>
<p>ECMAScript 6 &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454; &#x446;&#x44E; &#x442;&#x440;&#x430;&#x434;&#x438;&#x446;&#x456;&#x44E;, &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x447;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x426;&#x435; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x431;&#x430;&#x433;&#x430;&#x442;&#x44C;&#x43C;&#x430; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x43C;&#x438; &#x448;&#x43B;&#x44F;&#x445;&#x430;&#x43C;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x434;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">createObject</span>(<span class="hljs-params">classDef</span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> classDef();
}

<span class="hljs-keyword">let</span> obj = createObject(<span class="hljs-class"><span class="hljs-keyword">class</span> </span>{

    sayHi() {
        <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Hi!&quot;</span>);
    }
});

obj.sayHi();        <span class="hljs-comment">// &quot;Hi!&quot;</span>
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>createObject()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x430; &#x437; &#x430;&#x43D;&#x43E;&#x43D;&#x456;&#x43C;&#x43D;&#x438;&#x43C; &#x432;&#x438;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x441;&#x443;&#x442;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; <code>new</code>, &#x456; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x446;&#x44E; &#x441;&#x443;&#x442;&#x43D;&#x456;&#x441;&#x442;&#x44C;. &#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>obj</code> &#x437;&#x433;&#x43E;&#x434;&#x43E;&#x43C; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x443; &#x441;&#x443;&#x442;&#x43D;&#x456;&#x441;&#x442;&#x44C;.</p>
<p>&#x406;&#x43D;&#x448;&#x438;&#x43C; &#x446;&#x456;&#x43A;&#x430;&#x432;&#x438;&#x43C; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x43C; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x454; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; <a href="https://uk.wikipedia.org/wiki/%D0%9E%D0%B4%D0%B8%D0%BD%D0%B0%D0%BA_(%D1%88%D0%B0%D0%B1%D0%BB%D0%BE%D0%BD_%D0%BF%D1%80%D0%BE%D0%B5%D0%BA%D1%82%D1%83%D0%B2%D0%B0%D0%BD%D0%BD%D1%8F" target="_blank">&#x441;&#x438;&#x43D;&#x433;&#x43B;&#x442;&#x43E;&#x43D;&#x456;&#x432;</a>) &#x43F;&#x440;&#x438; &#x43D;&#x435;&#x433;&#x430;&#x439;&#x43D;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x43E;&#x432;&#x456; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x429;&#x43E;&#x431; &#x446;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438;, &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; <code>new</code> &#x437; &#x432;&#x438;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x456; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x43A;&#x440;&#x443;&#x433;&#x43B;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x432; &#x43A;&#x456;&#x43D;&#x446;&#x456;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> person = <span class="hljs-keyword">new</span> <span class="hljs-class"><span class="hljs-keyword">class</span> </span>{

    <span class="hljs-keyword">constructor</span>(name) {
        <span class="hljs-keyword">this</span>.name = name;
    }

    sayName() {
        <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">this</span>.name);
    }

}(<span class="hljs-string">&quot;Nicholas&quot;</span>);

person.sayName();       <span class="hljs-comment">// &quot;Nicholas&quot;</span>
</code></pre>
<p>&#x422;&#x443;&#x442; &#x432;&#x438;&#x440;&#x430;&#x437; &#x430;&#x43D;&#x43E;&#x43D;&#x456;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x456; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x433;&#x430;&#x439;&#x43D;&#x43E;. &#x426;&#x44F; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x44C; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43D;&#x433;&#x43B;&#x442;&#x43E;&#x43D;&#x456;&#x432;, &#x43D;&#x435; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x44E;&#x447;&#x438; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x43A;&#x43B;&#x430;&#x441; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438;. (&#x41F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x430;&#x439;&#x442;&#x435;, &#x449;&#x43E; <code>PersonClass</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x430; &#x43D;&#x435; &#x437;&#x43E;&#x432;&#x43D;&#x456;.) &#x41A;&#x440;&#x443;&#x433;&#x43B;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x432; &#x43A;&#x456;&#x43D;&#x446;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x454; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x43D;&#x438;&#x43A;&#x43E;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x432;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x449;&#x43E; &#x432; &#x442;&#x43E;&#x439; &#x441;&#x430;&#x43C;&#x438;&#x439; &#x447;&#x430;&#x441; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x457;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;.</p>
<p>&#x41F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456; &#x441;&#x444;&#x43E;&#x43A;&#x443;&#x441;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43D;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x430;&#x445; &#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438;. &#x410;&#x43B;&#x435; &#x432;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;, &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x43D;&#x430; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x438; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443;.</p>
<h2 id="&#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;-&#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x438;">&#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x438;</h2>
<p>&#x412; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441;, &#x44F;&#x43A; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430;, &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x438; &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443;. &#x429;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#xAB;&#x433;&#x435;&#x442;&#x435;&#x440;&#xBB; (&#x43C;&#x435;&#x442;&#x43E;&#x434; &#x437;&#x447;&#x438;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;), &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x439;&#x442;&#x435; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>get</code> &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x43F;&#x440;&#x43E;&#x431;&#x456;&#x43B;, &#x430; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;; &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#xAB;&#x441;&#x435;&#x442;&#x435;&#x440;&#xBB; (&#x43C;&#x435;&#x442;&#x43E;&#x434; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;), &#x440;&#x43E;&#x431;&#x456;&#x442;&#x44C; &#x442;&#x435; &#x436; &#x441;&#x430;&#x43C;&#x435;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>set</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">CustomHTMLElement</span> </span>{

    <span class="hljs-keyword">constructor</span>(element) {
        <span class="hljs-keyword">this</span>.element = element;
    }

    get html() {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.element.innerHTML;
    }

    set html(value) {
        <span class="hljs-keyword">this</span>.element.innerHTML = value;
    }
}

<span class="hljs-keyword">var</span> descriptor = <span class="hljs-built_in">Object</span>.getOwnPropertyDescriptor(CustomHTMLElement.prototype, <span class="hljs-string">&quot;html&quot;</span>);
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;get&quot;</span> <span class="hljs-keyword">in</span> descriptor);   <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;set&quot;</span> <span class="hljs-keyword">in</span> descriptor);   <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(descriptor.enumerable); <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, &#x43A;&#x43B;&#x430;&#x441; <code>CustomHTMLElement</code> &#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x438;&#x439;, &#x44F;&#x43A; &#x43E;&#x431;&#x433;&#x43E;&#x440;&#x442;&#x43A;&#x430; &#x43D;&#x430;&#x432;&#x43A;&#x43E;&#x43B;&#x43E; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x43E;&#x433;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; DOM. &#x412;&#x456;&#x43D; &#x43C;&#x430;&#x454; &#x456; &#xAB;&#x433;&#x435;&#x442;&#x435;&#x440;&#xBB;, &#x456; &#xAB;&#x441;&#x435;&#x442;&#x435;&#x440;&#xBB; &#x434;&#x43B;&#x44F; <code>html</code>, &#x449;&#x43E; &#x434;&#x435;&#x43B;&#x435;&#x433;&#x443;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>innerHTML</code> &#x43D;&#x430; &#x441;&#x430;&#x43C; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;. &#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;&#x2013;&#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; <code>CustomHTMLElement.prototype</code> &#x456;, &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x44F;&#x43A; &#x456; &#x456;&#x43D;&#x448;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x431;&#x443;&#x434;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E; &#x44F;&#x43A; &#x43D;&#x435;&#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x430;. &#x41E;&#x441;&#x44C; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x432;&#x456;&#x434;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x435;&#x437; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x43F;&#x43E;&#x432;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x434;&#x43E; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;</span>
<span class="hljs-keyword">let</span> CustomHTMLElement = (<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
<span class="hljs-meta">
    &quot;use strict&quot;</span>;

    <span class="hljs-keyword">const</span> CustomHTMLElement = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">element</span>) </span>{

        <span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x43C;&#x43E;&#x441;&#x44F;, &#x449;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x430; &#x437; new</span>
        <span class="hljs-keyword">if</span> (<span class="hljs-keyword">typeof</span> <span class="hljs-keyword">new</span>.target === <span class="hljs-string">&quot;undefined&quot;</span>) {
            <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Constructor must be called with new.&quot;</span>);
        }

        <span class="hljs-keyword">this</span>.element = element;
    }

    <span class="hljs-built_in">Object</span>.defineProperty(CustomHTMLElement.prototype, <span class="hljs-string">&quot;html&quot;</span>, {
        enumerable: <span class="hljs-literal">false</span>,
        configurable: <span class="hljs-literal">true</span>,
        get: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
            <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.element.innerHTML;
        },
        set: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
            <span class="hljs-keyword">this</span>.element.innerHTML = value;
        }
    });

    <span class="hljs-keyword">return</span> CustomHTMLElement;
}());
</code></pre>
<p>&#x42F;&#x43A; &#x456; &#x432; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x445; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x445;, &#x446;&#x435;&#x439; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43A;&#x43E;&#x434;&#x443; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x430;&#x43E;&#x449;&#x430;&#x434;&#x438;&#x442;&#x438;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x43A;&#x43B;&#x430;&#x441; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x443; &#x431;&#x435;&#x437; &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x412;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x443; &#x434;&#x43B;&#x44F; <code>html</code> &#x441;&#x430;&#x43C;&#x435; &#x43F;&#x43E; &#x441;&#x43E;&#x431;&#x456; &#x43C;&#x430;&#x454; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x436;&#x435; &#x440;&#x43E;&#x437;&#x43C;&#x456;&#x440; &#x44F;&#x43A; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x435; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443;.</p>
<h2 id="&#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x456;-&#x456;&#x43C;&#x435;&#x43D;&#x430;-&#x447;&#x43B;&#x435;&#x43D;&#x456;&#x432;">&#x41E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x447;&#x43B;&#x435;&#x43D;&#x456;&#x432;</h2>
<p>&#x41F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x456;&#x436; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;&#x43C;&#x438; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x456; &#x43A;&#x43B;&#x430;&#x441;&#x430;&#x43C;&#x438; &#x449;&#x435; &#x43D;&#x435; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x438;&#x43B;&#x438;&#x441;&#x44F;. &#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x430;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x442;&#x43E;&#x433;&#x43E; &#x449;&#x43E;&#x431; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x439;&#x442;&#x435; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x43D;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x43D;&#x430;&#x432;&#x43A;&#x43E;&#x43B;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;, &#x449;&#x43E; &#x43C;&#x430;&#x454; &#x442;&#x43E;&#x439; &#x436;&#x435; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x456; &#x456;&#x43C;&#x435;&#x43D; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;&#x432; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> methodName = <span class="hljs-string">&quot;sayName&quot;</span>;

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">PersonClass</span> </span>{

    <span class="hljs-keyword">constructor</span>(name) {
        <span class="hljs-keyword">this</span>.name = name;
    }

    [methodName]() {
        <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">this</span>.name);
    }
};

<span class="hljs-keyword">let</span> me = <span class="hljs-keyword">new</span> PersonClass(<span class="hljs-string">&quot;Nicholas&quot;</span>);
me.sayName();           <span class="hljs-comment">// &quot;Nicholas&quot;</span>
</code></pre>
<p>&#x426;&#x44F; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F; <code>PersonClass</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443;, &#x449;&#x43E;&#x431; &#x43F;&#x440;&#x438;&#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x442;&#x438; &#x456;&#x43C;&apos;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x439;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x420;&#x44F;&#x434;&#x43E;&#x43A; <code>&quot;sayName&quot;</code> &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x439; <code>methodName</code>, &#x430; &#x43F;&#x43E;&#x442;&#x456;&#x43C; <code>methodName</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>sayName()</code> &#x43F;&#x456;&#x437;&#x43D;&#x456;&#x448;&#x435; &#x454; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;.</p>
<p>&#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> propertyName = <span class="hljs-string">&quot;html&quot;</span>;

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">CustomHTMLElement</span> </span>{

    <span class="hljs-keyword">constructor</span>(element) {
        <span class="hljs-keyword">this</span>.element = element;
    }

    get [propertyName]() {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.element.innerHTML;
    }

    set [propertyName](value) {
        <span class="hljs-keyword">this</span>.element.innerHTML = value;
    }
}
</code></pre>
<p>&#x422;&#x443;&#x442; &#xAB;&#x433;&#x435;&#x442;&#x435;&#x440;&#xBB; &#x456; &#xAB;&#x441;&#x435;&#x442;&#x435;&#x440;&#xBB; &#x434;&#x43B;&#x44F; <code>html</code> &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; <code>propertyName</code>. &#x414;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; <code>.html</code> &#x441;&#x442;&#x43E;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x412;&#x438; &#x43F;&#x43E;&#x431;&#x430;&#x447;&#x438;&#x43B;&#x438;, &#x449;&#x43E; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43C;&#x456;&#x436; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x430;&#x43C;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x442;&#x430; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x43C;&#x456;&#x436; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438;, &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438;&#x2013;&#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x430;&#x43C;&#x438;, &#x442;&#x430; &#x437;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x438;&#x43C;&#x438; &#x456;&#x43C;&#x435;&#x43D;&#x430;&#x43C;&#x438;. &#x404; &#x449;&#x435; &#x43E;&#x434;&#x43D;&#x430; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x456;&#x441;&#x442;&#x44C;, &#x44F;&#x43A;&#x443; &#x441;&#x43B;&#x456;&#x434; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x443;&#x442;&#x438;: &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;.</p>
<h2 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;-&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;">&#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438;-&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;</h2>
<p>&#x423; &#x413;&#x43B;&#x430;&#x432;&#x456; 8 &#x432;&#x438; &#x43D;&#x430;&#x432;&#x447;&#x438;&#x43B;&#x438;&#x441;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x432; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443;, &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x447;&#x438; &#x437;&#x456;&#x440;&#x43E;&#x447;&#x43A;&#x443; (<code>*</code>) &#x434;&#x43E; &#x456;&#x43C;&apos;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443;. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x441;&#x430;&#x43C;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x456; &#x434;&#x43B;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;, &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x447;&#x438; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x431;&#x443;&#x442;&#x438; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyClass</span> </span>{

    *createIterator() {
        <span class="hljs-keyword">yield</span> <span class="hljs-number">1</span>;
        <span class="hljs-keyword">yield</span> <span class="hljs-number">2</span>;
        <span class="hljs-keyword">yield</span> <span class="hljs-number">3</span>;
    }

}

<span class="hljs-keyword">let</span> instance = <span class="hljs-keyword">new</span> MyClass();
<span class="hljs-keyword">let</span> iterator = instance.createIterator();
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43A;&#x43B;&#x430;&#x441; &#x437; &#x456;&#x43C;&apos;&#x44F;&#x43C; <code>MyClass</code> &#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43C;-&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C; <code>createIterator()</code>. &#x41C;&#x435;&#x442;&#x43E;&#x434; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x436;&#x43E;&#x440;&#x441;&#x442;&#x43A;&#x43E; &#x437;&#x430;&#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x432; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;. &#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438;-&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442; &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x454; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x44E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x456; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x431;&#x440;&#x430;&#x442;&#x438; &#x446;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41C;&#x430;&#x441;&#x438;&#x432;&#x438;, &#x43D;&#x430;&#x431;&#x43E;&#x440;&#x438;, &#x442;&#x430; &#x43C;&#x430;&#x43F;&#x438;, &#x432;&#x441;&#x456; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;-&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x43B;&#x456;&#x43A;&#x443;, &#x449;&#x43E;&#x431; &#x43D;&#x430;&#x434;&#x430;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x437;&#x430;&#x441;&#x43E;&#x431;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x434;&#x456;&#x457; &#x437; &#x457;&#x445; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;.</p>
<p>&#x41D;&#x435;&#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;-&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x434;&#x443;&#x436;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x456;, &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x443; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x448;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x454; &#x43D;&#x430;&#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x456;&#x448;&#x438;&#x43C;, &#x44F;&#x43A;&#x449;&#x43E; &#x43A;&#x43B;&#x430;&#x441; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x454; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>Symbol.iterator</code>, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434;-&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x44F;&#x43A; &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Collection</span> </span>{

    <span class="hljs-keyword">constructor</span>() {
        <span class="hljs-keyword">this</span>.items = [];
    }

    *[<span class="hljs-built_in">Symbol</span>.iterator]() {
        <span class="hljs-keyword">yield</span> *<span class="hljs-keyword">this</span>.items.values();
    }
}

<span class="hljs-keyword">var</span> collection = <span class="hljs-keyword">new</span> Collection();
collection.items.push(<span class="hljs-number">1</span>);
collection.items.push(<span class="hljs-number">2</span>);
collection.items.push(<span class="hljs-number">3</span>);

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">let</span> x <span class="hljs-keyword">of</span> collection) {
    <span class="hljs-built_in">console</span>.log(x);
}

<span class="hljs-comment">// Output:</span>
<span class="hljs-comment">// 1</span>
<span class="hljs-comment">// 2</span>
<span class="hljs-comment">// 3</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x435; &#x456;&#x43C;&apos;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;, &#x449;&#x43E; &#x434;&#x435;&#x43B;&#x435;&#x433;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x443; <code>values()</code> &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; <code>this.items</code>. &#x411;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x439; &#x43A;&#x43B;&#x430;&#x441;, &#x44F;&#x43A;&#x438;&#x439; &#x43A;&#x435;&#x440;&#x443;&#x454; &#x43D;&#x430;&#x431;&#x43E;&#x440;&#x43E;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x435;&#x43D; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x447;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x439; &#x432;&#x438;&#x43C;&#x430;&#x433;&#x430;&#x44E;&#x442;&#x44C; &#x449;&#x43E;&#x431; &#x43A;&#x43E;&#x43B;&#x435;&#x43A;&#x446;&#x456;&#x457;, &#x44F;&#x43A;&#x438;&#x43C;&#x438; &#x432;&#x43E;&#x43D;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x443;&#x44E;&#x442;&#x44C;, &#x43C;&#x430;&#x43B;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;. &#x422;&#x435;&#x43F;&#x435;&#x440;, &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x439; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; <code>Collection</code> &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x438;&#x439; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x432; &#x446;&#x438;&#x43A;&#x43B;&#x456; <code>for-of</code> &#x430;&#x431;&#x43E; &#x437; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x414;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x456;&#x432; &#x434;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x43E;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x457;&#x445; &#x432; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;&#x445; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443;. &#x42F;&#x43A;&#x449;&#x43E; &#x436;, &#x437; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x431;&#x43E;&#x43A;&#x443;, &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x43C;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x430;&#x431;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x438; &#x432; &#x441;&#x430;&#x43C;&#x43E;&#x43C;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x456;, &#x442;&#x43E; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456; &#x447;&#x43B;&#x435;&#x43D;&#x438;.</p>
<h2 id="&#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456;-&#x447;&#x43B;&#x435;&#x43D;&#x438;">&#x421;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456; &#x447;&#x43B;&#x435;&#x43D;&#x438;</h2>
<p>&#x412;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430;&#x445; &#x434;&#x43B;&#x44F; &#x456;&#x43C;&#x456;&#x442;&#x430;&#x446;&#x456;&#x457; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x445; &#x447;&#x43B;&#x435;&#x43D;&#x456;&#x432; &#x454; &#x449;&#x435; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x43F;&#x43E;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x43C; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x43C; &#x432; ECMAScript 5 &#x456; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x440;&#x430;&#x43D;&#x43D;&#x456;&#x445; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F;&#x445;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">PersonType</span>(<span class="hljs-params">name</span>) </span>{
    <span class="hljs-keyword">this</span>.name = name;
}

<span class="hljs-comment">// &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434;</span>
PersonType.create = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">name</span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> PersonType(name);
};

<span class="hljs-comment">// &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x443;</span>
PersonType.prototype.sayName = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">this</span>.name);
};

<span class="hljs-keyword">var</span> person = PersonType.create(<span class="hljs-string">&quot;Nicholas&quot;</span>);
</code></pre>
<p>&#x412; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432;&#x430;&#x445; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x444;&#x430;&#x431;&#x440;&#x438;&#x447;&#x43D;&#x438;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x437; &#x456;&#x43C;&apos;&#x44F;&#x43C; <code>PersonType.create()</code> &#x431;&#x443;&#x434;&#x435; &#x432;&#x432;&#x430;&#x436;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43C;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x439;&#x43E;&#x433;&#x43E; &#x434;&#x430;&#x43D;&#x43D;&#x456; &#x43D;&#x435; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x430;&#x442;&#x44C; &#x432;&#x456;&#x434; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x443; <code>PersonType</code>. ECMAScript 6 &#x441;&#x43F;&#x440;&#x43E;&#x449;&#x443;&#x454; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x437;&#x430;&#x43F;&#x438;&#x441; <code>static</code> &#x43F;&#x435;&#x440;&#x435;&#x434; &#x456;&#x43C;&apos;&#x44F;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x430;&#x431;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x430;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43E;&#x441;&#x44C; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">PersonClass</span> </span>{

    <span class="hljs-comment">// &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x443; PersonType</span>
    <span class="hljs-keyword">constructor</span>(name) {
        <span class="hljs-keyword">this</span>.name = name;
    }

    <span class="hljs-comment">// &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; PersonType.prototype.sayName</span>
    sayName() {
        <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">this</span>.name);
    }

    <span class="hljs-comment">// &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; PersonType.create</span>
    <span class="hljs-keyword">static</span> create(name) {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> PersonClass(name);
    }
}

<span class="hljs-keyword">let</span> person = PersonClass.create(<span class="hljs-string">&quot;Nicholas&quot;</span>);
</code></pre>
<p>&#x412;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>PersonClass</code> &#x43C;&#x430;&#x454; &#x43E;&#x434;&#x438;&#x43D; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x437; &#x456;&#x43C;&apos;&#x44F;&#x43C; <code>&#x441;reate()</code>. &#x421;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x441;&#x430;&#x43C;&#x438;&#x439;, &#x449;&#x43E; &#x439; &#x434;&#x43B;&#x44F; <code>sayName()</code> &#x437;&#x430; &#x432;&#x438;&#x43D;&#x44F;&#x442;&#x43A;&#x43E;&#x43C; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>static</code>. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>static</code> &#x437; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x430;&#x431;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;&#x430; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x404;&#x434;&#x438;&#x43D;&#x435; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x43B;&#x44F;&#x433;&#x430;&#x454; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>static</code> &#x437; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>constructor</code>.</p>
<p>W&gt; &#x421;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456; &#x447;&#x43B;&#x435;&#x43D;&#x438; &#x43D;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x437; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x456;&#x432;. &#x412;&#x438; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x445; &#x447;&#x43B;&#x435;&#x43D;&#x456;&#x432; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x437; &#x43A;&#x43B;&#x430;&#x441;&#x443;.</p>
<h2 id="&#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x437;-&#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x43C;&#x438;-&#x43A;&#x43B;&#x430;&#x441;&#x430;&#x43C;&#x438;">&#x423;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x43C;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x430;&#x43C;&#x438;</h2>
<p>&#x414;&#x43E; &#x43F;&#x43E;&#x44F;&#x432;&#x438; ECMAScript 6, &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44F; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x431;&#x443;&#x43B;&#x43E; &#x434;&#x443;&#x436;&#x435; &#x43A;&#x43E;&#x448;&#x442;&#x43E;&#x432;&#x43D;&#x438;&#x43C; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x43E;&#x43C;. &#x41F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x435; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x432;&#x430;&#x43B;&#x43E; &#x431;&#x430;&#x433;&#x430;&#x442;&#x44C;&#x43E;&#x445; &#x43A;&#x440;&#x43E;&#x43A;&#x456;&#x432;. &#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;, &#x434;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435;&#x43C;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">Rectangle</span>(<span class="hljs-params">length, width</span>) </span>{
    <span class="hljs-keyword">this</span>.length = length;
    <span class="hljs-keyword">this</span>.width = width;
}

Rectangle.prototype.getArea = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.length * <span class="hljs-keyword">this</span>.width;
};

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">Square</span>(<span class="hljs-params">length</span>) </span>{
    Rectangle.call(<span class="hljs-keyword">this</span>, length, length);
}

Square.prototype = <span class="hljs-built_in">Object</span>.create(Rectangle.prototype, {
    <span class="hljs-keyword">constructor</span>: {
        value:Square,
        enumerable: <span class="hljs-literal">true</span>,
        writable: <span class="hljs-literal">true</span>,
        configurable: <span class="hljs-literal">true</span>
    }
});

<span class="hljs-keyword">var</span> square = <span class="hljs-keyword">new</span> Square(<span class="hljs-number">3</span>);

<span class="hljs-built_in">console</span>.log(square.getArea());              <span class="hljs-comment">// 9</span>
<span class="hljs-built_in">console</span>.log(square <span class="hljs-keyword">instanceof</span> Square);      <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(square <span class="hljs-keyword">instanceof</span> Rectangle);   <span class="hljs-comment">// true</span>
</code></pre>
<p><code>Square</code> &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; <code>Rectangle</code>, &#x456; &#x449;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x446;&#x435;, &#x432;&#x456;&#x43D; &#x43C;&#x430;&#x454; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; <code>Square.prototype</code> &#x437; &#x43D;&#x43E;&#x432;&#x438;&#x43C; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x43E;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x43C; &#x432;&#x456;&#x434; <code>Rectangle.prototype</code>, &#x430; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Rectangle.call)</code>. &#x426;&#x456; &#x43A;&#x440;&#x43E;&#x43A;&#x438; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x43F;&#x43B;&#x443;&#x442;&#x430;&#x43B;&#x438; &#x43D;&#x43E;&#x432;&#x430;&#x447;&#x43A;&#x456;&#x432; JavaScript &#x456; &#x431;&#x443;&#x43B;&#x438; &#x434;&#x436;&#x435;&#x440;&#x435;&#x43B;&#x43E;&#x43C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A; &#x434;&#x43B;&#x44F; &#x434;&#x43E;&#x441;&#x432;&#x456;&#x434;&#x447;&#x435;&#x43D;&#x438;&#x445; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432;.</p>
<p>&#x41A;&#x43B;&#x430;&#x441;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x43D;&#x43E; &#x43F;&#x43E;&#x43B;&#x435;&#x433;&#x448;&#x443;&#x44E;&#x442;&#x44C; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44E; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x414;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43D;&#x44C;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>extends</code>, &#x449;&#x43E;&#x431; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x437; &#x44F;&#x43A;&#x43E;&#x457; &#x43A;&#x43B;&#x430;&#x441; &#x43C;&#x430;&#x454; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x449;&#x43E;&#x441;&#x44C;. &#x41F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x438; &#x43F;&#x456;&#x434;&#x442;&#x44F;&#x433;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E;, &#x430; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x443;&#x430; &#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430; <code>super()</code>. &#x41E;&#x441;&#x44C; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x432; ECMAScript 6 &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Rectangle</span> </span>{
    <span class="hljs-keyword">constructor</span>(length, width) {
        <span class="hljs-keyword">this</span>.length = length;
        <span class="hljs-keyword">this</span>.width = width;
    }

    getArea() {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.length * <span class="hljs-keyword">this</span>.width;
    }
}

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Square</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Rectangle</span> </span>{
    <span class="hljs-keyword">constructor</span>(length) {

        <span class="hljs-comment">// &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435; &#x449;&#x43E; &#x439; Rectangle.call(this, length, length)</span>
        <span class="hljs-keyword">super</span>(length, length);
    }
}

<span class="hljs-keyword">var</span> square = <span class="hljs-keyword">new</span> Square(<span class="hljs-number">3</span>);

<span class="hljs-built_in">console</span>.log(square.getArea());              <span class="hljs-comment">// 9</span>
<span class="hljs-built_in">console</span>.log(square <span class="hljs-keyword">instanceof</span> Square);      <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(square <span class="hljs-keyword">instanceof</span> Rectangle);   <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x426;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x443; &#x43A;&#x43B;&#x430;&#x441; <code>Square</code> &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; <code>Rectangle</code> &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>extends</code>. &#x41A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x43A;&#x43B;&#x430;&#x441;&#x443; <code>Square</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; <code>super()</code> &#x449;&#x43E;&#x431; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x43A;&#x43B;&#x430;&#x441;&#x443; <code>Rectangle</code> &#x437; &#x437;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x43C;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;. &#x417;&#x432;&#x435;&#x440;&#x43D;&#x456;&#x442;&#x44C; &#x443;&#x432;&#x430;&#x433;&#x443;, &#x449;&#x43E; &#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; &#x43A;&#x43E;&#x434;&#x443; &#x432; ECMAScript 5, &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440; <code>Rectangle</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x435; &#x437; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43A;&#x43B;&#x430;&#x441;&#x443; (&#x43F;&#x456;&#x441;&#x43B;&#x44F; <code>extends</code>).</p>
<p>&#x41A;&#x43B;&#x430;&#x441;&#x438;, &#x44F;&#x43A;&#x456; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x456;&#x43D;&#x448;&#x438;&#x445;, &#x432;&#x456;&#x434;&#x43E;&#x43C;&#x456; &#x43D;&#x430;&#x43C; &#x44F;&#x43A; <em>&#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x438;</em>. &#x41F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x432;&#x438;&#x43C;&#x430;&#x433;&#x430;&#x44E;&#x442;&#x44C; &#x43E;&#x431;&#x43E;&#x432;&apos;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>super()</code> &#x43F;&#x440;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x456; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x443;. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x435; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x442;&#x43E; &#x431;&#x443;&#x434;&#x443; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;. &#x42F;&#x43A;&#x449;&#x43E; &#x436; &#x432;&#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;, &#x442;&#x43E; <code>super()</code> &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x437; &#x443;&#x441;&#x456;&#x43C;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x43F;&#x440;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x456; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x434;&#x432;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x456; &#x454; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x43C;&#x438;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Square</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Rectangle</span> </span>{
    <span class="hljs-comment">// &#x431;&#x435;&#x437; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430;</span>
}

<span class="hljs-comment">// &#x422;&#x435; &#x436; &#x441;&#x430;&#x43C;&#x435;, &#x449;&#x43E; &#x439;:</span>

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Square</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Rectangle</span> </span>{
    <span class="hljs-keyword">constructor</span>(...args) {
        <span class="hljs-keyword">super</span>(...args);
    }
}
</code></pre>
<p>&#x414;&#x440;&#x443;&#x433;&#x438;&#x439; &#x43A;&#x43B;&#x430;&#x441; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x445; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;. &#x412;&#x441;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x442;&#x43E;&#x43C;&#x443; &#x436; &#x441;&#x430;&#x43C;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x44F;&#x43A; &#x456; &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x456; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x410;&#x43B;&#x435; &#x432; &#x43D;&#x430;&#x448;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x431;&#x443;&#x434;&#x435; &#x43D;&#x435; &#x437;&#x43E;&#x432;&#x441;&#x456;&#x43C; &#x432;&#x456;&#x440;&#x43D;&#x43E;&#x44E;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x43A;&#x43B;&#x430;&#x441;&#x443; <code>Square</code> &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x454; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;. &#x41E;&#x441;&#x44C; &#x447;&#x43E;&#x43C;&#x443; &#x442;&#x443;&#x442; &#x43A;&#x440;&#x430;&#x449;&#x435; &#x432;&#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x44C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;.</p>
<p>W&gt; &#x404; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x440;&#x435;&#x447;&#x435;&#x439;, &#x44F;&#x43A;&#x456; &#x442;&#x440;&#x435;&#x431;&#x430; &#x43C;&#x430;&#x442;&#x438; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>super()</code>:</p>
<ol>
<li>W&gt; &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>super()</code> &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x43C;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x430;&#x43C;&#x438;. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x454;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x432; &#x43D;&#x435;&#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x43C;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x456; (&#x44F;&#x43A;&#x438;&#x439; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; <code>extends</code>), &#x430;&#x431;&#x43E; &#x432; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x442;&#x43E; &#x446;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;.</li>
<li>W&gt; &#x41F;&#x435;&#x440;&#x435;&#x434; &#x442;&#x438;&#x43C; &#x44F;&#x43A; &#x43D;&#x430;&#x43C;&#x430;&#x433;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; <code>this</code> &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x456; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; <code>super()</code>. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>super()</code> &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x437;&#x430; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44E; <code>this</code>, &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>this</code> &#x43F;&#x435;&#x440;&#x435;&#x434; &#x442;&#x438;&#x43C;, &#x44F;&#x43A; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; <code>super()</code> &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x434;&#x438; &#x434;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;.</li>
<li>W&gt; &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>super()</code> &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x43F;&#x43E;&#x437;&#x431;&#x443;&#x442;&#x438;&#x441;&#x44F; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432; &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442; &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x443;.</li>
</ol>
<h3 id="&#x43F;&#x435;&#x440;&#x435;&#x43A;&#x440;&#x438;&#x442;&#x442;&#x44F;-&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;-&#x43A;&#x43B;&#x430;&#x441;&#x443;">&#x41F;&#x435;&#x440;&#x435;&#x43A;&#x440;&#x438;&#x442;&#x442;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x43A;&#x43B;&#x430;&#x441;&#x443;</h3>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x445; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x456;&#x43C;&apos;&#x44F;&#x43C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>getArea()</code> &#x434;&#x43E; <code>Square</code>, &#x449;&#x43E;&#x431; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Square</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Rectangle</span> </span>{
    <span class="hljs-keyword">constructor</span>(length) {
        <span class="hljs-keyword">super</span>(length, length);
    }

    <span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x443;&#x454;&#x43C;&#x43E; &#x439; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x454;&#x43C;&#x43E; Rectangle.prototype.getArea()</span>
    getArea() {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.length * <span class="hljs-keyword">this</span>.length;
    }
}
</code></pre>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43C;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x43B;&#x438; <code>getArea()</code> &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; <code>Square</code>, &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Rectangle.prototype.getArea()</code> &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43D;&#x43E;&#x432;&#x438;&#x445; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x456;&#x432; &#x43A;&#x43B;&#x430;&#x441;&#x443; <code>Square</code>. &#x417;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E;, &#x432;&#x438; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x456;&#x43C;&apos;&#x44F;&#x43C;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>super.getArea()</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x44F;&#x43A; &#x442;&#x443;&#x442;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Square</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Rectangle</span> </span>{
    <span class="hljs-keyword">constructor</span>(length) {
        <span class="hljs-keyword">super</span>(length, length);
    }

    <span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x443;&#x454;&#x43C;&#x43E;, &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x454;&#x43C;&#x43E;, &#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x43C;&#x43E; Rectangle.prototype.getArea()</span>
    getArea() {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">super</span>.getArea();
    }
}
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>super</code> &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; <code>super</code>, &#x44F;&#x43A;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x440;&#x43E;&#x437;&#x43A;&#x440;&#x438;&#x442;&#x435; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 4 (&#x434;&#x438;&#x432;. &#xAB;&#x41B;&#x435;&#x433;&#x43A;&#x438;&#x439; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; super&#xBB;). &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>this</code> &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x442;&#x435; &#x43A;&#x43E;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E;, &#x442;&#x430;&#x43A; &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;.</p>
<h3 id="&#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x456;-&#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456;-&#x447;&#x43B;&#x435;&#x43D;&#x438;">&#x423;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456; &#x447;&#x43B;&#x435;&#x43D;&#x438;</h3>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x438;&#x439; &#x43A;&#x43B;&#x430;&#x441; &#x43C;&#x430;&#x454; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456; &#x447;&#x43B;&#x435;&#x43D;&#x438;, &#x442;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C;&#x438; &#x443; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x43C;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x456;. &#x423;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, ,&#x44F;&#x43A; &#x456; &#x432; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432;&#x430;&#x445;, &#x430;&#x43B;&#x435; &#x446;&#x435; &#x43D;&#x43E;&#x432;&#x430; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x446;&#x456;&#x44F; &#x434;&#x43B;&#x44F; JavaScript. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Rectangle</span> </span>{
    <span class="hljs-keyword">constructor</span>(length, width) {
        <span class="hljs-keyword">this</span>.length = length;
        <span class="hljs-keyword">this</span>.width = width;
    }

    getArea() {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.length * <span class="hljs-keyword">this</span>.width;
    }

    <span class="hljs-keyword">static</span> create(length, width) {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Rectangle(length, width);
    }
}

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Square</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Rectangle</span> </span>{
    <span class="hljs-keyword">constructor</span>(length) {

        <span class="hljs-comment">// &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435; &#x449;&#x43E; &#x439; Rectangle.call(this, length, length)</span>
        <span class="hljs-keyword">super</span>(length, length);
    }
}

<span class="hljs-keyword">var</span> rect = Square.create(<span class="hljs-number">3</span>, <span class="hljs-number">4</span>);

<span class="hljs-built_in">console</span>.log(rect <span class="hljs-keyword">instanceof</span> Rectangle);     <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(rect.getArea());                <span class="hljs-comment">// 12</span>
<span class="hljs-built_in">console</span>.log(rect <span class="hljs-keyword">instanceof</span> Square);        <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; &#x434;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443; <code>Rectangle</code> &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>create()</code>. &#x426;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x44F;&#x43A; <code>Square.create()</code> &#x447;&#x435;&#x440;&#x435;&#x437; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x442;&#x430; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Rectangle.create()</code>.</p>
<h3 id="&#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x456;-&#x43A;&#x43B;&#x430;&#x441;&#x438;-&#x437;-&#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;">&#x41F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x437; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432;</h3>
<p>&#x41C;&#x430;&#x431;&#x443;&#x442;&#x44C;, &#x43D;&#x430;&#x439;&#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x456;&#x448;&#x438;&#x43C; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x43E;&#x43C; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x445; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x432; ECMAScript 6 &#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x43A;&#x43B;&#x430;&#x441; &#x437; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>extends</code> &#x437; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x43C; &#x432;&#x438;&#x440;&#x430;&#x437;&#x43E;&#x43C;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x456;&#x43D; &#x432;&#x438;&#x440;&#x456;&#x448;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E; &#x437; <code>[[Construct]]</code> &#x456; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x43E;&#x43C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">Rectangle</span>(<span class="hljs-params">length, width</span>) </span>{
    <span class="hljs-keyword">this</span>.length = length;
    <span class="hljs-keyword">this</span>.width = width;
}

Rectangle.prototype.getArea = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.length * <span class="hljs-keyword">this</span>.width;
};

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Square</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Rectangle</span> </span>{
    <span class="hljs-keyword">constructor</span>(length) {
        <span class="hljs-keyword">super</span>(length, length);
    }
}

<span class="hljs-keyword">var</span> x = <span class="hljs-keyword">new</span> Square(<span class="hljs-number">3</span>);
<span class="hljs-built_in">console</span>.log(x.getArea());               <span class="hljs-comment">// 9</span>
<span class="hljs-built_in">console</span>.log(x <span class="hljs-keyword">instanceof</span> Rectangle);    <span class="hljs-comment">// true</span>
</code></pre>
<p><code>Rectangle</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x432; &#x441;&#x442;&#x438;&#x43B;&#x456; ECMAScript 5 &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430;, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; <code>Square</code> &#x454; &#x43A;&#x43B;&#x430;&#x441;&#x43E;&#x43C;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>Rectangle</code> &#x43C;&#x430;&#x454; <code>[[Construct]]</code> &#x442;&#x430; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;, &#x43A;&#x43B;&#x430;&#x441; <code>Square</code> &#x43C;&#x43E;&#x436;&#x435; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x437;&#x432;&#x456;&#x434;&#x442;&#x438;.</p>
<p>&#x421;&#x43F;&#x440;&#x438;&#x439;&#x43D;&#x44F;&#x442;&#x442;&#x44F; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443; &#x43F;&#x456;&#x441;&#x43B;&#x44F; <code>extends</code> &#x434;&#x430;&#x454; &#x442;&#x430;&#x43A;&#x456; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;, &#x44F;&#x43A; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x456;&#x447;&#x43D;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x456; &#x437;&#x432;&#x456;&#x434;&#x43A;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">Rectangle</span>(<span class="hljs-params">length, width</span>) </span>{
    <span class="hljs-keyword">this</span>.length = length;
    <span class="hljs-keyword">this</span>.width = width;
}

Rectangle.prototype.getArea = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.length * <span class="hljs-keyword">this</span>.width;
};

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">getBase</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> Rectangle;
}

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Square</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">getBase</span>() </span>{
    <span class="hljs-keyword">constructor</span>(length) {
        <span class="hljs-keyword">super</span>(length, length);
    }
}

<span class="hljs-keyword">var</span> x = <span class="hljs-keyword">new</span> Square(<span class="hljs-number">3</span>);
<span class="hljs-built_in">console</span>.log(x.getArea());               <span class="hljs-comment">// 9</span>
<span class="hljs-built_in">console</span>.log(x <span class="hljs-keyword">instanceof</span> Rectangle);    <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>getBase()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x43F;&#x440;&#x438; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x412;&#x43E;&#x43D;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>Rectangle</code>, &#x449;&#x43E; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x446;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x442;&#x43E;&#x442;&#x43E;&#x436;&#x43D;&#x438;&#x43C; &#x434;&#x43E; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x433;&#x43E;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x456;&#x439; &#x43A;&#x43B;&#x430;&#x441; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x456;&#x447;&#x43D;&#x43E;, &#x446;&#x435; &#x434;&#x430;&#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x43F;&#x456;&#x434;&#x445;&#x43E;&#x434;&#x438; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x432;&#x438; &#x444;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x43C;&#x456;&#x448;&#x43A;&#x438;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> SerializableMixin = {
    serialize() {
        <span class="hljs-keyword">return</span> <span class="hljs-built_in">JSON</span>.stringify(<span class="hljs-keyword">this</span>);
    }
};

<span class="hljs-keyword">let</span> AreaMixin = {
    getArea() {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.length * <span class="hljs-keyword">this</span>.width;
    }
};

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">mixin</span>(<span class="hljs-params">...mixins</span>) </span>{
    <span class="hljs-keyword">var</span> base = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{};
    <span class="hljs-built_in">Object</span>.assign(base.prototype, ...mixins);
    <span class="hljs-keyword">return</span> base;
}

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Square</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">mixin</span>(<span class="hljs-title">AreaMixin</span>, <span class="hljs-title">SerializableMixin</span>) </span>{
    <span class="hljs-keyword">constructor</span>(length) {
        <span class="hljs-keyword">super</span>();
        <span class="hljs-keyword">this</span>.length = length;
        <span class="hljs-keyword">this</span>.width = length;
    }
}

<span class="hljs-keyword">var</span> x = <span class="hljs-keyword">new</span> Square(<span class="hljs-number">3</span>);
<span class="hljs-built_in">console</span>.log(x.getArea());               <span class="hljs-comment">// 9</span>
<span class="hljs-built_in">console</span>.log(x.serialize());             <span class="hljs-comment">// &quot;{&quot;length&quot;:3,&quot;width&quot;:3}&quot;</span>
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x434;&#x43E;&#x43C;&#x456;&#x448;&#x43A;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43A;&#x43B;&#x430;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>mixin()</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x440;&#x435;&#x43F;&#x440;&#x435;&#x437;&#x435;&#x43D;&#x442;&#x443;&#x44E;&#x442;&#x44C; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x438; &#x434;&#x43E;&#x43C;&#x456;&#x448;&#x43E;&#x43A;. &#x412;&#x43E;&#x43D;&#x430; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x437; &#x456;&#x43C;&apos;&#x44F;&#x43C; <code>base</code> &#x442;&#x430; &#x43F;&#x440;&#x438;&#x432;&apos;&#x44F;&#x437;&#x443;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443; &#x434;&#x43E;&#x43C;&#x456;&#x448;&#x43E;&#x43A; &#x434;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>base</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E; <code>mixin()</code>, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; <code>Square</code> &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>extends</code>. &#x41C;&#x430;&#x439;&#x442;&#x435; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;, &#x449;&#x43E; &#x432;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x435; <code>extends</code>, &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; <code>super()</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430;.</p>
<p>&#x415;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; <code>Square</code> &#x43C;&#x430;&#x454; &#x456; <code>getArea()</code> &#x432;&#x456;&#x434; <code>AreaMixin</code>, &#x456; <code>serialize</code> &#x432;&#x456;&#x434; <code>SerializableMixin</code>. &#x426;&#x435; &#x434;&#x43E;&#x441;&#x44F;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x438;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>mixin()</code> &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x456;&#x447;&#x43D;&#x43E; &#x43D;&#x430;&#x43F;&#x43E;&#x432;&#x43D;&#x44E;&#x454; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F; &#x43D;&#x43E;&#x432;&#x43E;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x443;&#x441;&#x456;&#x43C;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x43C;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x457; &#x434;&#x43E;&#x43C;&#x456;&#x448;&#x43A;&#x438;. (&#x41C;&#x430;&#x439;&#x442;&#x435; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;, &#x449;&#x43E; &#x43F;&#x440;&#x438; &#x43D;&#x430;&#x44F;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x437; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43C;&#x438; &#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x434;&#x43E;&#x43C;&#x456;&#x448;&#x43A;&#x430;&#x445;, &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x431;&#x443;&#x434;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x430;.)</p>
<p>W&gt; &#x41F;&#x456;&#x441;&#x43B;&#x44F; <code>extends</code> &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x438;&#x439; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437;, &#x430;&#x43B;&#x435; &#x43D;&#x435; &#x432;&#x441;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x432;&#x430;&#x43B;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x43A;&#x43B;&#x430;&#x441;. &#x41E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x43E;, &#x437;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456; &#x43D;&#x438;&#x436;&#x447;&#x435; &#x442;&#x438;&#x43F;&#x438; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x434;&#x430;&#x432;&#x430;&#x442;&#x438;:</p>
<ul>
<li>W&gt; <code>null</code></li>
<li>W&gt; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;-&#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; (&#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x456; &#x432; &#x413;&#x43B;&#x430;&#x432;&#x456; 8)</li>
</ul>
<p>W&gt; &#x412; &#x446;&#x438;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x430;&#x445; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x430; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x431;&#x443;&#x434;&#x435; &#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438;, &#x43C;&#x438; &#x43D;&#x435; &#x43C;&#x430;&#x454;&#x43C;&#x43E; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;&#x441;&#x44F; &#x434;&#x43E; <code>[[Construct]]</code>.</p>
<h3 id="&#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x447;&#x435;&#x440;&#x435;&#x437;-&#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x438;">&#x423;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;.</h3>
<p>&#x417; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; JavaScript, &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x431;&#x430;&#x436;&#x430;&#x43B;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x441;&#x432;&#x43E;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x456; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x442;&#x438;&#x43F;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x447;&#x435;&#x440;&#x435;&#x437; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x412; ECMAScript 5 &#x442;&#x430; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435; &#x446;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x43D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;. &#x421;&#x43F;&#x440;&#x43E;&#x431;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x438;&#x447;&#x43D;&#x435; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x434;&#x430;&#x432;&#x430;&#x43B;&#x438; &#x440;&#x43E;&#x431;&#x43E;&#x447;&#x438;&#x439; &#x43A;&#x43E;&#x434;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;</span>
<span class="hljs-keyword">var</span> colors = [];
colors[<span class="hljs-number">0</span>] = <span class="hljs-string">&quot;red&quot;</span>;
<span class="hljs-built_in">console</span>.log(colors.length);         <span class="hljs-comment">// 1</span>

colors.length = <span class="hljs-number">0</span>;
<span class="hljs-built_in">console</span>.log(colors[<span class="hljs-number">0</span>]);             <span class="hljs-comment">// undefined</span>

<span class="hljs-comment">// &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x430; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x432; ES5</span>

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">MyArray</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">Array</span>.apply(<span class="hljs-keyword">this</span>, <span class="hljs-built_in">arguments</span>);
}

MyArray.prototype = <span class="hljs-built_in">Object</span>.create(<span class="hljs-built_in">Array</span>.prototype, {
    <span class="hljs-keyword">constructor</span>: {
        value: MyArray,
        writable: <span class="hljs-literal">true</span>,
        configurable: <span class="hljs-literal">true</span>,
        enumerable: <span class="hljs-literal">true</span>
    }
});

<span class="hljs-keyword">var</span> colors = <span class="hljs-keyword">new</span> MyArray();
colors[<span class="hljs-number">0</span>] = <span class="hljs-string">&quot;red&quot;</span>;
<span class="hljs-built_in">console</span>.log(colors.length);         <span class="hljs-comment">// 0</span>

colors.length = <span class="hljs-number">0</span>;
<span class="hljs-built_in">console</span>.log(colors[<span class="hljs-number">0</span>]);             <span class="hljs-comment">// &quot;red&quot;</span>
</code></pre>
<p>&#x412;&#x438;&#x432;&#x456;&#x434; <code>console.log()</code> &#x432; &#x43A;&#x456;&#x43D;&#x446;&#x456; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x44F;&#x43A; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; JavaScript &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x434;&#x43E; &#x43D;&#x435;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x431;&#x430;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432;. &#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>length</code> &#x442;&#x430; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x443; <code>MyArray</code> &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x44F;&#x43A; &#x432;&#x43E;&#x43D;&#x438; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x434;&#x430;&#x43D;&#x438;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B; &#x43D;&#x435; &#x43F;&#x43E;&#x448;&#x438;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x447;&#x435;&#x440;&#x435;&#x437; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; <code>Array.apply()</code> &#x430;&#x431;&#x43E; &#x437; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;.</p>
<p>&#x41E;&#x434;&#x43D;&#x456;&#x454;&#x44E; &#x437; &#x446;&#x456;&#x43B;&#x435;&#x439; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; ECMAScript 6 &#x454; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x412; &#x440;&#x430;&#x43C;&#x43A;&#x430;&#x445; &#x434;&#x43E;&#x441;&#x44F;&#x433;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x443; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x44C; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432; &#x431;&#x443;&#x43B;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x43E; &#x434;&#x432;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x43D;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x432; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x43D;&#x43D;&#x456; &#x437; &#x43A;&#x43B;&#x430;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x44E; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x43B;&#x44E; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432; ECMAScript 5 &#x442;&#x430; &#x441;&#x442;&#x430;&#x440;&#x456;&#x448;&#x438;&#x445; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44F;&#x445;:</p>
<ul>
<li>&#x412; &#x43A;&#x43B;&#x430;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x43C;&#x443; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x456; ECMAScript 5 &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>this</code> &#x432;&#x43F;&#x435;&#x440;&#x448;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x43C; &#x442;&#x438;&#x43F;&#x43E;&#x43C; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, <code>MyArray</code>), &#x456; &#x437;&#x433;&#x43E;&#x434;&#x43E;&#x43C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443; (&#x44F;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Array.apply()</code>). &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; <code>this</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; <code>MyArray</code> &#x456; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x434;&#x435;&#x43A;&#x43E;&#x440;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438; &#x432;&#x456;&#x434; <code>Array</code>.</li>
<li>&#x412; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456;, &#x449;&#x43E; &#x431;&#x430;&#x437;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x430;&#x445; &#x437; ECMAScript 6, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>this</code> &#x432;&#x43F;&#x435;&#x440;&#x448;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443; (<code>Array</code>) &#x456; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443; (<code>MyArray</code>). &#x412; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456; &#x447;&#x43E;&#x433;&#x43E; <code>this</code> &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x443;&#x441;&#x456;&#x454;&#x44E; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443; &#x442;&#x430; &#x43A;&#x43E;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x432;&#x435;&#x441;&#x44C; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;.</li>
</ul>
<p>&#x41D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x432; &#x434;&#x456;&#x457; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x431;&#x430;&#x437;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x430;&#x445;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyArray</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Array</span> </span>{
    <span class="hljs-comment">// &#x43F;&#x443;&#x441;&#x442;&#x438;&#x439;</span>
}

<span class="hljs-keyword">var</span> colors = <span class="hljs-keyword">new</span> MyArray();
colors[<span class="hljs-number">0</span>] = <span class="hljs-string">&quot;red&quot;</span>;
<span class="hljs-built_in">console</span>.log(colors.length);         <span class="hljs-comment">// 1</span>

colors.length = <span class="hljs-number">0</span>;
<span class="hljs-built_in">console</span>.log(colors[<span class="hljs-number">0</span>]);             <span class="hljs-comment">// undefined</span>
</code></pre>
<p>&#x41A;&#x43B;&#x430;&#x441; <code>MyArray</code> &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x432;&#x456;&#x434; <code>Array</code> &#x442;&#x430; &#x432; &#x43F;&#x43E;&#x434;&#x430;&#x43B;&#x44C;&#x448;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; <code>Array</code>. &#x412;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x434;&#x456;&#x44F; &#x437; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>length</code>, &#x442;&#x430; &#x43C;&#x430;&#x43D;&#x456;&#x43F;&#x443;&#x43B;&#x44F;&#x446;&#x456;&#x457; &#x437; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; <code>length</code> &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x44E;&#x442;&#x44C; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x44F;&#x43A; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x456;&#x434; <code>Array</code>, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x432;&#x430;&#x448;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x456; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x438;-&#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;, &#x442;&#x430;&#x43A; &#x456; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;. &#x417; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432;&#x441;&#x456;&#x454;&#x457; &#x446;&#x456;&#x454;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456; ECMAScript 6 &#x442;&#x430; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x435;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E; &#x432;&#x438;&#x440;&#x456;&#x448;&#x443;&#x44E;&#x442;&#x44C; &#x43F;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x430;&#x43B;&#x435; &#x446;&#x435;&#x439; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43E;&#x43A; &#x432;&#x441;&#x435; &#x449;&#x435; &#x432;&#x430;&#x440;&#x442;&#x438;&#x439; &#x434;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x436;&#x435;&#x43D;&#x44C;.</p>
<h3 id="&#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;-symbolspecies">&#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; Symbol.species</h3>
<p>&#x426;&#x456;&#x43A;&#x430;&#x432;&#x438;&#x43C; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x43E;&#x43C; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;, &#x43D;&#x430;&#x442;&#x43E;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x431;&#x443;&#x434;&#x435; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x43A;&#x43B;&#x430;&#x441; &#x437; &#x456;&#x43C;&#x2019;&#x44F;&#x43C; <code>MyArray</code>, &#x44F;&#x43A;&#x438;&#x439; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; <code>Array</code>, &#x442;&#x43E; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x44F;&#x43A; <code>slice()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x43A;&#x43B;&#x430;&#x441;&#x443; <code>MyArray</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyArray</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Array</span> </span>{
    <span class="hljs-comment">// &#x43F;&#x443;&#x441;&#x442;&#x438;&#x439;</span>
}

<span class="hljs-keyword">let</span> items = <span class="hljs-keyword">new</span> MyArray(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>),
    subitems = items.slice(<span class="hljs-number">1</span>, <span class="hljs-number">3</span>);

<span class="hljs-built_in">console</span>.log(items <span class="hljs-keyword">instanceof</span> MyArray);      <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(subitems <span class="hljs-keyword">instanceof</span> MyArray);   <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>slice()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x43A;&#x43B;&#x430;&#x441;&#x443; <code>MyArray</code>. &#x417;&#x430;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439;, &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>slice()</code>, &#x43F;&#x440;&#x438; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x432;&#x456;&#x434; <code>Array</code> &#x43C;&#x430;&#x432; &#x431;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; <code>Array</code>. &#x410;&#x43B;&#x435; &#x437;&#x430; &#x43A;&#x443;&#x43B;&#x456;&#x441;&#x430;&#x43C;&#x438; &#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.species</code>, &#x44F;&#x43A;&#x430; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x456; &#x432;&#x438;&#x449;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x438;.</p>
<p><code>Symbol.species</code> &#x2014; &#x434;&#x43E;&#x431;&#x440;&#x435;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x438;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;-&#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;, &#x44F;&#x43A;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;. &#x426;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454; &#x440;&#x43E;&#x43B;&#x44C; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; &#x442;&#x430;&#x43C;, &#x434;&#x435; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x434;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; (&#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;). &#x41D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x442;&#x438;&#x43F;&#x438; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; <code>Symbol.species</code>:</p>
<ul>
<li><code>Array</code></li>
<li><code>ArrayBuffer</code> (&#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x413;&#x43B;&#x430;&#x432;&#x456; 10)</li>
<li><code>Map</code></li>
<li><code>Promise</code></li>
<li><code>RegExp</code></li>
<li><code>Set</code></li>
<li>Typed Arrays (&#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x413;&#x43B;&#x430;&#x432;&#x456; 10)</li>
</ul>
<p>&#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x437; &#x446;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x43C;&#x430;&#x454; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x443; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.species</code> &#x44F;&#x43A;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>this</code>, &#x43C;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;, &#x449;&#x43E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x431;&#x443;&#x434;&#x435; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;-&#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x454;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B; &#x443; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x43E;&#x43C;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x456;, &#x442;&#x43E; &#x43A;&#x43E;&#x434; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; Symbol.species &#x441;&#x445;&#x43E;&#x436;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;</span>
<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyClass</span> </span>{
    <span class="hljs-keyword">static</span> get [<span class="hljs-built_in">Symbol</span>.species]() {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>;
    }

    <span class="hljs-keyword">constructor</span>(value) {
        <span class="hljs-keyword">this</span>.value = value;
    }

    clone() {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> <span class="hljs-keyword">this</span>.constructor[<span class="hljs-built_in">Symbol</span>.species](<span class="hljs-keyword">this</span>.value);
    }
}
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; <code>Symbol.species</code> &#x437;&#x430;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x43F;&#x440;&#x438;&#x432;&#x2019;&#x44F;&#x437;&#x430;&#x442;&#x438; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;-&#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440; &#x434;&#x43E; <code>MyClass</code>. &#x417;&#x432;&#x435;&#x440;&#x43D;&#x456;&#x442;&#x44C; &#x443;&#x432;&#x430;&#x433;&#x443;, &#x449;&#x43E; &#x43C;&#x438; &#x43C;&#x430;&#x454;&#x43C;&#x43E; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x433;&#x435;&#x442;&#x435;&#x440;, &#x431;&#x435;&#x437; &#x441;&#x435;&#x442;&#x435;&#x440;&#x443;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x43C;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x43C;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; <code>Symbol.species</code> &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x411;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x435; &#x437;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; <code>this.constructor[Symbol.species]</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>MyClass</code>. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>clone()</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x446;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x441;&#x430;&#x43C; &#x43A;&#x43B;&#x430;&#x441; <code>MyClass</code>, &#x449;&#x43E; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x43C;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x443;&#x432;&#x430;&#x442;&#x438; &#x446;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyClass</span> </span>{
    <span class="hljs-keyword">static</span> get [<span class="hljs-built_in">Symbol</span>.species]() {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>;
    }

    <span class="hljs-keyword">constructor</span>(value) {
        <span class="hljs-keyword">this</span>.value = value;
    }

    clone() {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> <span class="hljs-keyword">this</span>.constructor[<span class="hljs-built_in">Symbol</span>.species](<span class="hljs-keyword">this</span>.value);
    }
}

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyDerivedClass1</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">MyClass</span> </span>{
    <span class="hljs-comment">// empty</span>
}

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyDerivedClass2</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">MyClass</span> </span>{
    <span class="hljs-keyword">static</span> get [<span class="hljs-built_in">Symbol</span>.species]() {
        <span class="hljs-keyword">return</span> MyClass;
    }
}

<span class="hljs-keyword">let</span> instance1 = <span class="hljs-keyword">new</span> MyDerivedClass1(<span class="hljs-string">&quot;foo&quot;</span>),
    clone1 = instance1.clone(),
    instance2 = <span class="hljs-keyword">new</span> MyDerivedClass2(<span class="hljs-string">&quot;bar&quot;</span>),
    clone2 = instance2.clone();

<span class="hljs-built_in">console</span>.log(clone1 <span class="hljs-keyword">instanceof</span> MyClass);             <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(clone1 <span class="hljs-keyword">instanceof</span> MyDerivedClass1);     <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(clone2 <span class="hljs-keyword">instanceof</span> MyClass);             <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(clone2 <span class="hljs-keyword">instanceof</span> MyDerivedClass2);     <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x422;&#x443;&#x442; <code>MyDerivedClass1</code> &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; <code>MyClass</code> &#x456; &#x43D;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.species</code>. &#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x435;&#x441;&#x44F; <code>clone()</code>, &#x442;&#x43E; &#x432;&#x456;&#x43D; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x43A;&#x43B;&#x430;&#x441;&#x443; <code>MyDerivedClass1</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; <code>this.constructor[Symbol.species]</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>MyDerivedClass1</code>. &#x41A;&#x43B;&#x430;&#x441; <code>MyDerivedClass2</code> &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; <code>MyClass</code> &#x442;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x443;&#x454; <code>Symbol.species</code>, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; <code>MyClass</code>. &#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>clone()</code> &#x434;&#x43B;&#x44F; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x443; &#x43A;&#x43B;&#x430;&#x441;&#x443; <code>MyDerivedClass2</code>, &#x442;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x435; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x43C; <code>MyClass</code>. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>Symbol.species</code>, &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x43A;&#x43B;&#x430;&#x441; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438; &#x44F;&#x43A;&#x438;&#x439; &#x442;&#x438;&#x43F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43E;, &#x43A;&#x43E;&#x43B;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x43A;&#x43B;&#x430;&#x441;&#x443;.</p>
<p>&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, <code>Array</code> &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x443;&#x454; <code>Symbol.species</code> &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43A;&#x43B;&#x430;&#x441;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x412; &#x43A;&#x43B;&#x430;&#x441;&#x456;, &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x432;&#x456;&#x434; <code>Array</code>, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x442;&#x438;&#x43F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438;, &#x44F;&#x43A; &#x442;&#x443;&#x442;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyArray</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Array</span> </span>{
    <span class="hljs-keyword">static</span> get [<span class="hljs-built_in">Symbol</span>.species]() {
        <span class="hljs-keyword">return</span> <span class="hljs-built_in">Array</span>;
    }
}

<span class="hljs-keyword">let</span> items = <span class="hljs-keyword">new</span> MyArray(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>),
    subitems = items.slice(<span class="hljs-number">1</span>, <span class="hljs-number">3</span>);

<span class="hljs-built_in">console</span>.log(items <span class="hljs-keyword">instanceof</span> MyArray);      <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(subitems <span class="hljs-keyword">instanceof</span> <span class="hljs-built_in">Array</span>);     <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(subitems <span class="hljs-keyword">instanceof</span> MyArray);   <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x443;&#x454; <code>Symbol.species</code> &#x432; <code>MyArray</code>, &#x44F;&#x43A;&#x438;&#x439; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; <code>Array</code>. &#x423;&#x441;&#x456; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x44F;&#x43A;&#x456; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; <code>Array</code> &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; <code>MyArray</code>.</p>
<p>&#x412;&#x437;&#x430;&#x433;&#x430;&#x43B;&#x456;, &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.species</code> &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x437;&#x430;&#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; <code>this.constructor</code> &#x432; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x426;&#x435; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x43C; &#x43A;&#x43B;&#x430;&#x441;&#x430;&#x43C; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x443;&#x432;&#x430;&#x442;&#x438; &#x442;&#x438;&#x43F;, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;. &#x411;&#x456;&#x43B;&#x44C;&#x448; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x435; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x43A;&#x43B;&#x430;&#x441; &#x432;&#x456;&#x434; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x430;&#x454; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; <code>Symbol.species</code>, &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43E;&#x43D;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44F;, &#x449;&#x43E; &#x432;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x435; &#x446;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430;.</p>
<h2 id="&#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;-newtarget-&#x432;-&#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430;&#x445;-&#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;">&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; new.target &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430;&#x445; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;</h2>
<p>&#x423; &#x413;&#x43B;&#x430;&#x432;&#x456; 3 &#x432;&#x438; &#x434;&#x456;&#x437;&#x43D;&#x430;&#x43B;&#x438;&#x441;&#x44F; &#x43F;&#x440;&#x43E; <code>new.target</code> &#x456; &#x442;&#x435;, &#x44F;&#x43A; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x439;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;. &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; <code>new.target</code> &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x44F;&#x43A; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x43E; &#x43A;&#x43B;&#x430;&#x441;. &#x412; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, <code>new.target</code> &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;-&#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; &#x434;&#x43B;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x44F;&#x43A; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Rectangle</span> </span>{
    <span class="hljs-keyword">constructor</span>(length, width) {
        <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">new</span>.target === Rectangle);
        <span class="hljs-keyword">this</span>.length = length;
        <span class="hljs-keyword">this</span>.width = width;
    }
}

<span class="hljs-comment">// new.target &#x454; Rectangle</span>
<span class="hljs-keyword">var</span> obj = <span class="hljs-keyword">new</span> Rectangle(<span class="hljs-number">3</span>, <span class="hljs-number">4</span>);      <span class="hljs-comment">// &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; true</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x449;&#x43E; <code>new.target</code> &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; <code>Rectangle</code>, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>new Rectangle(3, 4)</code>. &#x41A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x43D;&#x456; &#x431;&#x435;&#x437; <code>new</code>, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>new.target</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x410;&#x43B;&#x435; &#x457;&#x457; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x434;&#x438; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438;&#x43C;. &#x41F;&#x43E;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x43D;&#x430; &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Rectangle</span> </span>{
    <span class="hljs-keyword">constructor</span>(length, width) {
        <span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">new</span>.target === Rectangle);
        <span class="hljs-keyword">this</span>.length = length;
        <span class="hljs-keyword">this</span>.width = width;
    }
}

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Square</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Rectangle</span> </span>{
    <span class="hljs-keyword">constructor</span>(length) {
        <span class="hljs-keyword">super</span>(length, length)
    }
}

<span class="hljs-comment">// new.target &#x454; Square</span>
<span class="hljs-keyword">var</span> obj = <span class="hljs-keyword">new</span> Square(<span class="hljs-number">3</span>);      <span class="hljs-comment">// &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; false</span>
</code></pre>
<p><code>Square</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x43A;&#x43B;&#x430;&#x441;&#x443; <code>Rectangle</code>, &#x442;&#x43E;&#x43C;&#x443; <code>new.target</code> &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; <code>Square</code>, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Rectangle</code>. &#x426;&#x435; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x446;&#x435; &#x434;&#x430;&#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x441;&#x432;&#x43E;&#x44E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x432; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x439;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x43E;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x442;&#x43D;&#x438;&#x439; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x438;&#x439; &#x43A;&#x43B;&#x430;&#x441; (&#x44F;&#x43A;&#x456;&#x439; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;), &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <code>new.target</code> &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x442;&#x43D;&#x438;&#x439; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x438;&#x439; &#x43A;&#x43B;&#x430;&#x441;</span>
<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Shape</span> </span>{
    <span class="hljs-keyword">constructor</span>() {
        <span class="hljs-keyword">if</span> (<span class="hljs-keyword">new</span>.target === Shape) {
            <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;&#x426;&#x435;&#x439; &#x43A;&#x43B;&#x430;&#x441; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x439;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;.&quot;</span>)
        }
    }
}

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Rectangle</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Shape</span> </span>{
    <span class="hljs-keyword">constructor</span>(length, width) {
        <span class="hljs-keyword">super</span>();
        <span class="hljs-keyword">this</span>.length = length;
        <span class="hljs-keyword">this</span>.width = width;
    }
}

<span class="hljs-keyword">var</span> x = <span class="hljs-keyword">new</span> Shape();                <span class="hljs-comment">// &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;</span>

<span class="hljs-keyword">var</span> y = <span class="hljs-keyword">new</span> Rectangle(<span class="hljs-number">3</span>, <span class="hljs-number">4</span>);        <span class="hljs-comment">// &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;</span>
<span class="hljs-built_in">console</span>.log(y <span class="hljs-keyword">instanceof</span> Shape);    <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x43A;&#x43B;&#x430;&#x441;&#x443; <code>Shape</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; <code>new.target</code> &#x454; <code>Shape</code>, &#x43C;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;, &#x449;&#x43E; <code>new Shape()</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;. &#x410;&#x43B;&#x435;, &#x432;&#x438; &#x432;&#x441;&#x435; &#x449;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>Shape</code> &#x44F;&#x43A; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x438;&#x439; &#x43A;&#x43B;&#x430;&#x441;, &#x449;&#x43E; &#x439; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; <code>Rectangle</code>. &#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>super()</code> &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x454; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Shape</code> &#x442;&#x430; <code>new.target</code> &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; <code>Rectangle</code>, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x431;&#x435;&#x437; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;.</p>
<p>I&gt; &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x431;&#x435;&#x437; <code>new</code>, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>new.target</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; <code>undefined</code>.</p>
<h2 id="&#x43F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;">&#x41F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;</h2>
<p>&#x41A;&#x43B;&#x430;&#x441;&#x438; &#x432; ECMAScript 6 &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x442;&#x44C; &#x43B;&#x435;&#x433;&#x448;&#x438;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432; JavaScript, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x430;&#x43C; &#x441;&#x442;&#x430;&#x43D;&#x435; &#x443; &#x43D;&#x430;&#x433;&#x43E;&#x434;&#x456; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x438; &#x437;&#x43D;&#x430;&#x43B;&#x438; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432;. &#x41A;&#x43B;&#x430;&#x441;&#x438; ECMAScript 6 &#x43D;&#x435; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x443;&#x43A;&#x440;&#x443; &#x432; &#x43A;&#x43B;&#x430;&#x441;&#x438;&#x447;&#x43D;&#x443; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x44C; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; ECMAScript 5, &#x430;&#x43B;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x43F;&#x43E;&#x43B;&#x456;&#x43F;&#x448;&#x435;&#x43D;&#x44C;, &#x449;&#x43E;&#x431; &#x437;&#x43C;&#x435;&#x43D;&#x448;&#x438;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;.</p>
<p>&#x41A;&#x43B;&#x430;&#x441;&#x438; ECMAScript 6 &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x437; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x43D;&#x438;&#x43C; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x435;&#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x432; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x456; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441;, &#x44F;&#x43A; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x456;. &#x412;&#x441;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x454; &#x43D;&#x435;&#x437;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x438;&#x43C;&#x438;, &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;, &#x44F;&#x43A;&#x430; &#x43D;&#x430;&#x439;&#x43A;&#x440;&#x430;&#x449;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x446;&#x456; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x434;&#x43B;&#x44F; &#x44F;&#x43A;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x437;&#x430;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439;, &#x454; &#x43D;&#x435;&#x437;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x411;&#x456;&#x43B;&#x44C;&#x448; &#x442;&#x43E;&#x433;&#x43E;, &#x43A;&#x43B;&#x430;&#x441;&#x438;-&#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x456; &#x431;&#x435;&#x437; <code>new</code>, &#x446;&#x435; &#x434;&#x430;&#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44F;, &#x449;&#x43E;&#x431; &#x432;&#x438; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x43E; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43B;&#x438; &#x43A;&#x43B;&#x430;&#x441; &#x44F;&#x43A; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;.</p>
<p>&#x423;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x431;&#x430;&#x437;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43A;&#x43B;&#x430;&#x441;&#x430;&#x445;, &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x43A;&#x43B;&#x430;&#x441; &#x432;&#x456;&#x434; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x430;&#x431;&#x43E; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;. &#x426;&#x44F; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x44F;&#x43A; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x443; &#x434;&#x43B;&#x44F; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x434;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x43C;&#x456;&#x448;&#x43A;&#x438; &#x439; &#x456;&#x43D;&#x448;&#x456; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x438; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443;. &#x423;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x449;&#x43E; &#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x442;&#x430;&#x43A;&#x438;&#x445; &#x44F;&#x43A; <code>Array</code>, &#x442;&#x435;&#x43F;&#x435;&#x440; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x435; &#x456; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x44F;&#x43A; &#x442;&#x440;&#x435;&#x431;&#x430;.</p>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>new.target</code> &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430;&#x445; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;, &#x449;&#x43E;&#x431; &#x432;&#x43E;&#x43D;&#x438; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x43B;&#x438;&#x441;&#x44F; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x431;&#x443;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x456;. &#x41D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43F;&#x43E;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x43C; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x454; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x438;&#x439; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;, &#x430;&#x43B;&#x435; &#x432;&#x441;&#x435; &#x449;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43A;&#x43E;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x456;&#x43D;&#x448;&#x438;&#x43C;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x430;&#x43C;&#x438;.</p>
<p>&#x412; &#x446;&#x456;&#x43B;&#x43E;&#x43C;&#x443;, &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x454; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C; &#x434;&#x43E;&#x43F;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43E; JavaScript. &#x412;&#x43E;&#x43D;&#x438; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x443;&#x44E;&#x442;&#x44C; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43B;&#x430;&#x43A;&#x43E;&#x43D;&#x456;&#x447;&#x43D;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x456; &#x43A;&#x440;&#x430;&#x449;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x432; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x456;&#x439; &#x456; &#x432; &#x43C;&#x430;&#x43D;&#x435;&#x440;&#x456;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="08-Iterators-And-Generators.html" class="navigation navigation-prev " aria-label="Previous page: Глава 8: Ітератори та генератори">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="10-Arrays.html" class="navigation navigation-next " aria-label="Next page: Глава 10: Покращені можливості масивів">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Глава 9: Знайомство з класами у JavaScript","level":"1.11","depth":1,"next":{"title":"Глава 10: Покращені можливості масивів","level":"1.12","depth":1,"path":"manuscript/10-Arrays.md","ref":"manuscript/10-Arrays.md","articles":[]},"previous":{"title":"Глава 8: Ітератори та генератори","level":"1.10","depth":1,"path":"manuscript/08-Iterators-And-Generators.md","ref":"manuscript/08-Iterators-And-Generators.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","yametrika","ga","rss","github-buttons"],"pluginsConfig":{"yametrika":{"number":"41711034"},"github":{"url":"https://github.com/denysdovhan/understandinges6ua"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Рoзуміння ECMAScript 6","description":"Український переклад книги «Understanding ES6».","author":"Denys Dovhan and Terry Sahaidak","site_url":"http://understandinges6.denysdovhan.com/","feed_url":"http://understandinges6.denysdovhan.com/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"github-buttons":{"repo":"denysdovhan/understandinges6ua","types":["star"],"size":"small"},"ga":{"configuration":"auto","token":"UA-40496885-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/denysdovhan/understandinges6ua/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"manuscript/09-Classes.md","mtime":"2017-01-05T10:20:39.204Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-01-05T10:22:15.629Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-yametrika/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

