
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Глава 10: Покращені можливості масивів · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="11-Promises.html" />
    
    
    <link rel="prev" href="09-Classes.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"LambdaBooks/understandinges6ua","types":["star"],"size":"small"};
    </script>

    <link href="http://understandinges6.denysdovhan.com/rss.xml" title="Рoзуміння ECMAScript 6" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Рoзуміння ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-Block-Bindings.html">
            
                <a href="01-Block-Bindings.html">
            
                    
                    Глава 1: Блочне зв’язування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02-Strings-and-Regular-Expressions.html">
            
                <a href="02-Strings-and-Regular-Expressions.html">
            
                    
                    Глава 2: Рядки та регулярні вирази
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03-Functions.html">
            
                <a href="03-Functions.html">
            
                    
                    Глава 3: Функції
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="04-Objects.html">
            
                <a href="04-Objects.html">
            
                    
                    Глава 4: Розширена функціональність об’єктів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="05-Destructuring.html">
            
                <a href="05-Destructuring.html">
            
                    
                    Глава 5: Деструктурування для легшого доступу до даних
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="06-Symbols.html">
            
                <a href="06-Symbols.html">
            
                    
                    Глава 6: Символи та їх властивості
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="07-Sets-And-Maps.html">
            
                <a href="07-Sets-And-Maps.html">
            
                    
                    Глава 7: Множини та мапи
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="08-Iterators-And-Generators.html">
            
                <a href="08-Iterators-And-Generators.html">
            
                    
                    Глава 8: Ітератори та генератори
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="09-Classes.html">
            
                <a href="09-Classes.html">
            
                    
                    Глава 9: Знайомство з класами у JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.12" data-path="10-Arrays.html">
            
                <a href="10-Arrays.html">
            
                    
                    Глава 10: Покращені можливості масивів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11-Promises.html">
            
                <a href="11-Promises.html">
            
                    
                    Глава 11: Проміси та асинхронне програмування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12-Proxies-and-Reflection.html">
            
                <a href="12-Proxies-and-Reflection.html">
            
                    
                    Глава 12: Проксі та АРІ рефлексії
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13-Modules.html">
            
                <a href="13-Modules.html">
            
                    
                    Глава 13: Інкапсуляція коду через модулі
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="A-Other-Changes.html">
            
                <a href="A-Other-Changes.html">
            
                    
                    Додаток А: Дрібніші зміни у ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="B-ECMAScript-7.html">
            
                <a href="B-ECMAScript-7.html">
            
                    
                    Додаток Б: Розуміння ECMAScript 7 (2016)
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Глава 10: Покращені можливості масивів</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x432;&#x434;&#x43E;&#x441;&#x43A;&#x43E;&#x43D;&#x430;&#x43B;&#x435;&#x43D;&#x456;-&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;-&#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;">&#x412;&#x434;&#x43E;&#x441;&#x43A;&#x43E;&#x43D;&#x430;&#x43B;&#x435;&#x43D;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;</h1>
<p>&#x41C;&#x430;&#x441;&#x438;&#x432; &#x2014; &#x446;&#x435; &#x444;&#x443;&#x43D;&#x434;&#x430;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; JavaScript. &#x410;&#x43B;&#x435;, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441;, &#x43A;&#x43E;&#x43B;&#x438; &#x456;&#x43D;&#x448;&#x456; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x438; JavaScript &#x432;&#x434;&#x43E;&#x441;&#x43A;&#x43E;&#x43D;&#x430;&#x43B;&#x44E;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x447;&#x430;&#x441; &#x432;&#x456;&#x434; &#x447;&#x430;&#x441;&#x443;, &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x43B;&#x438;&#x441;&#x44F; &#x43D;&#x435;&#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E; &#x447;&#x430;&#x441;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; ECMAScript 5 &#x43F;&#x440;&#x435;&#x437;&#x435;&#x43D;&#x442;&#x443;&#x432;&#x430;&#x432; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x434;&#x43B;&#x44F; &#x457;&#x445; &#x43B;&#x435;&#x433;&#x448;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;. ECMAScript 6 &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454; &#x432;&#x434;&#x43E;&#x441;&#x43A;&#x43E;&#x43D;&#x430;&#x43B;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;, &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x447;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456;, &#x44F;&#x43A; &#x43D;&#x43E;&#x432;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;, &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x456; &#x442;&#x430; &#x437;&#x440;&#x443;&#x447;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x430; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;.</p>
<h2 id="&#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;-&#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;">&#x421;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;</h2>
<p>&#x414;&#x43E; &#x43F;&#x43E;&#x44F;&#x432;&#x438; ECMAScript 6 &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x43B;&#x43E; &#x434;&#x432;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x438;&#x445; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;: &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Array</code> &#x442;&#x430; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x41E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x438; &#x432;&#x438;&#x43C;&#x430;&#x433;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x43A;&#x443; &#x447;&#x43B;&#x435;&#x43D;&#x456;&#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x442;&#x430;, &#x43C;&#x456;&#x436; &#x442;&#x438;&#x43C;, &#x454; &#x434;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x438;&#x43C;&#x438;. &#x412;&#x430;&#x440;&#x456;&#x430;&#x43D;&#x442;&#x438; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x456;&#x457; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x438;&#x445; &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; (&#x43C;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;, &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x437; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x430;&#x43C;&#x438; &#x442;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; <code>length</code>) &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x431;&#x443;&#x43B;&#x438; &#x434;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x438;&#x43C;&#x438; &#x439; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443;. &#x414;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x43B;&#x435;&#x433;&#x448;&#x438;&#x442;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x432; JavaScript, ECMAScript 6 &#x434;&#x43E;&#x434;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>Array.of()</code> &#x442;&#x430; <code>Array.from()</code>.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-arrayof">&#x41C;&#x435;&#x442;&#x43E;&#x434; Array.of()</h3>
<p>&#x41E;&#x434;&#x43D;&#x456;&#x454;&#x44E; &#x437; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x43D;&#x43D;&#x44F; ECMAScript 6 &#x43D;&#x43E;&#x432;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; JavaScript &#x454; &#x431;&#x430;&#x436;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C; &#x443;&#x43D;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x43D;&#x435;&#x441;&#x43F;&#x43E;&#x434;&#x456;&#x432;&#x430;&#x43D;&#x43E;&#x43A; &#x43F;&#x440;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x437; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x43E;&#x43C; <code>Array</code>. &#x41A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>new Array</code> &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;-&#x440;&#x456;&#x437;&#x43D;&#x43E;&#x43C;&#x443;, &#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x442;&#x438;&#x43F;&#x443; &#x439; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x445; &#x439;&#x43E;&#x43C;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> items = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Array</span>(<span class="hljs-number">2</span>);
<span class="hljs-built_in">console</span>.log(items.length);          <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(items[<span class="hljs-number">0</span>]);              <span class="hljs-comment">// undefined</span>
<span class="hljs-built_in">console</span>.log(items[<span class="hljs-number">1</span>]);              <span class="hljs-comment">// undefined</span>

items = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Array</span>(<span class="hljs-string">&quot;2&quot;</span>);
<span class="hljs-built_in">console</span>.log(items.length);          <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(items[<span class="hljs-number">0</span>]);              <span class="hljs-comment">// &quot;2&quot;</span>

items = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Array</span>(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>);
<span class="hljs-built_in">console</span>.log(items.length);          <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(items[<span class="hljs-number">0</span>]);              <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(items[<span class="hljs-number">1</span>]);              <span class="hljs-comment">// 2</span>

items = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Array</span>(<span class="hljs-number">3</span>, <span class="hljs-string">&quot;2&quot;</span>);
<span class="hljs-built_in">console</span>.log(items.length);          <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(items[<span class="hljs-number">0</span>]);              <span class="hljs-comment">// 3</span>
<span class="hljs-built_in">console</span>.log(items[<span class="hljs-number">1</span>]);              <span class="hljs-comment">// &quot;2&quot;</span>
</code></pre>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x443; <code>Array</code> &#x43D;&#x430;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x434;&#x438;&#x43D; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;, &#x442;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43E; &#x43B;&#x438;&#x448;&#x435; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; <code>length</code>, &#x44F;&#x43A;&#x430; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44E; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;. &#x42F;&#x43A;&#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x43E; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x442;&#x43E; &#x439;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x442;&#x430;&#x43D;&#x435; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x43C; &#x447;&#x43B;&#x435;&#x43D;&#x43E;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x42F;&#x43A;&#x449;&#x43E; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x456; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; (&#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x456; &#x430;&#x431;&#x43E; &#x43D;&#x456;), &#x442;&#x43E; &#x446;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x442;&#x430;&#x43D;&#x443;&#x442;&#x44C; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x422;&#x430;&#x43A;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x431;&#x435;&#x43D;&#x442;&#x435;&#x436;&#x438;&#x442;&#x438; &#x456; &#x454; &#x440;&#x438;&#x437;&#x438;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x44E;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C;&#x438; &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x442;&#x438;&#x43F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x431;&#x443;&#x434;&#x435; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x443;.</p>
<p>&#x429;&#x43E;&#x431; &#x432;&#x438;&#x440;&#x456;&#x448;&#x438;&#x442;&#x438; &#x446;&#x44E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443; ECMAScript 6 &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Array.of()</code>. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Array.of()</code> &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E; &#x434;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; <code>Array</code>, &#x430;&#x43B;&#x435; &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x44C; &#x437; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Array.of()</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;, &#x43D;&#x435;&#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x442;&#x438;&#x43F; &#x430;&#x431;&#x43E; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x445; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;. &#x41E;&#x441;&#x44C; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>Array.of()</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> items = <span class="hljs-built_in">Array</span>.of(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>);
<span class="hljs-built_in">console</span>.log(items.length);          <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(items[<span class="hljs-number">0</span>]);              <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(items[<span class="hljs-number">1</span>]);              <span class="hljs-comment">// 2</span>

items = <span class="hljs-built_in">Array</span>.of(<span class="hljs-number">2</span>);
<span class="hljs-built_in">console</span>.log(items.length);          <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(items[<span class="hljs-number">0</span>]);              <span class="hljs-comment">// 2</span>

items = <span class="hljs-built_in">Array</span>.of(<span class="hljs-string">&quot;2&quot;</span>);
<span class="hljs-built_in">console</span>.log(items.length);          <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(items[<span class="hljs-number">0</span>]);              <span class="hljs-comment">// &quot;2&quot;</span>
</code></pre>
<p>&#x429;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>Array.of()</code>, &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43D;&#x44C;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x439;&#x43E;&#x43C;&#x443; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x456; &#x432;&#x438; &#x431;&#x430;&#x436;&#x430;&#x454;&#x442;&#x435; &#x43C;&#x430;&#x442;&#x438; &#x443; &#x432;&#x430;&#x448;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x442;&#x443;&#x442; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x434;&#x432;&#x430; &#x447;&#x438;&#x441;&#x43B;&#x430;, &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x2014; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;, &#x430; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x440;&#x44F;&#x434;&#x43E;&#x43A;. &#x426;&#x435; &#x441;&#x445;&#x43E;&#x436;&#x435; &#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x456; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; <code>Array.of()</code> &#x443; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x456;&#x432;. &#x410;&#x43B;&#x435;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Array</code> &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x442;&#x43E;, &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x432;&#x438; &#x437;&#x430;&#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; <code>Array.of()</code>, &#x449;&#x43E;&#x431; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x443; &#x439;&#x43E;&#x433;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x456;&#x439; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x446;&#x456;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">createArray</span>(<span class="hljs-params">arrayCreator, value</span>) </span>{
    <span class="hljs-keyword">return</span> arrayCreator(value);
}

<span class="hljs-keyword">let</span> items = createArray(<span class="hljs-built_in">Array</span>.of, value);
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>createArray()</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x44F;&#x43A;&#x430; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E;&#x431; &#x432;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; <code>Array.of()</code> &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x434;&#x43E; <code>createArray()</code>, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x411;&#x443;&#x434;&#x435; &#x43D;&#x435;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; <code>Array</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;, &#x449;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x43C;.</p>
<p>I&gt; &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Array.of()</code> &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.species</code> (&#x43F;&#x440;&#x43E; &#x44F;&#x43A;&#x443; &#x439;&#x448;&#x43B;&#x43E;&#x441;&#x44F; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 9), &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x442;&#x438;&#x43F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x44F;&#x43A;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x456;&#x43D; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; (<code>this</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>of()</code>), &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43A;&#x43E;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x438;&#x439; &#x442;&#x438;&#x43F; &#x434;&#x430;&#x43D;&#x438;&#x445;, &#x44F;&#x43A;&#x456; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43E;.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-arrayfrom">&#x41C;&#x435;&#x442;&#x43E;&#x434; Array.from()</h3>
<p>&#x41A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x456;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x43D;&#x435; &#x454; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438;, &#x434;&#x43E; &#x441;&#x43F;&#x440;&#x430;&#x432;&#x436;&#x43D;&#x456;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x431;&#x443;&#x43B;&#x430; &#x434;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;&#x44E; &#x432; JavaScript. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>arguments</code> (&#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x438;&#x439; &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;) &#x442;&#x430; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x44F;&#x43A; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x442;&#x43E; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x441;&#x43F;&#x435;&#x440;&#x448;&#x443; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;  &#x439;&#x43E;&#x433;&#x43E;. &#x429;&#x43E;&#x431; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x438;&#x439; &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x443; ECMAScript 5 &#x432;&#x438; &#x43C;&#x430;&#x43B;&#x438; &#x431; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x443; &#x434;&#x43E; &#x442;&#x456;&#x454;&#x457;, &#x449;&#x43E; &#x454; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">makeArray</span>(<span class="hljs-params">arrayLike</span>) </span>{
    <span class="hljs-keyword">var</span> result = [];

    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>, len = arrayLike.length; i &lt; len; i++) {
        result.push(arrayLike[i]);
    }

    <span class="hljs-keyword">return</span> result;
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">doSomething</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">var</span> args = makeArray(<span class="hljs-built_in">arguments</span>);

    <span class="hljs-comment">// &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x43C;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;</span>
}
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x448;&#x442;&#x443;&#x447;&#x43D;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43C;&#x430;&#x441;&#x438;&#x432; <code>result</code> &#x442;&#x430; &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x454; &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x447;&#x43B;&#x435;&#x43D; &#x437; <code>arguments</code> &#x432; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x426;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;, &#x430;&#x43B;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x454; &#x437;&#x430;&#x439;&#x432;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x432;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44E;. &#x41A;&#x456;&#x43D;&#x435;&#x446;&#x44C;-&#x43A;&#x456;&#x43D;&#x446;&#x435;&#x43C;, &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x43B;&#x438;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x437;&#x43C;&#x435;&#x43D;&#x448;&#x438;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x43A;&#x43E;&#x434;&#x443;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x43F;&#x440;&#x438;&#x440;&#x43E;&#x434;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x442;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x445; &#x43D;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>slice()</code>, &#x44F;&#x43A; &#x43E;&#x441;&#x44C;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">makeArray</span>(<span class="hljs-params">arrayLike</span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-built_in">Array</span>.prototype.slice.call(arrayLike);
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">doSomething</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">var</span> args = makeArray(<span class="hljs-built_in">arguments</span>);

    <span class="hljs-comment">// &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x43C;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;</span>
}
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x434;&#x43E; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x442;&#x430; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>this</code> &#x434;&#x43B;&#x44F; <code>slice()</code> &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x435; &#x434;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x441;&#x445;&#x43E;&#x436;&#x43E;&#x433;&#x43E; &#x43D;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>slice()</code> &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x454; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x456; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x438; &#x442;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>length</code>, &#x449;&#x43E;&#x431; &#x43A;&#x43E;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438;, &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x438;&#x439; &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438;.</p>
<p>&#x41D;&#x435;&#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x446;&#x44F; &#x442;&#x435;&#x445;&#x43D;&#x456;&#x43A;&#x430; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x454; &#x43C;&#x435;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x443;, &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>Array.prototype.slice.call(arrayLike)</code> &#x43D;&#x435; &#x454; &#x43F;&#x43E;&#x432;&#x43D;&#x43E;&#x44E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x434;&#x43E; &#xAB;&#x41A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x456;&#x457; <code>arrayLike</code> &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;&#xBB;. &#x41D;&#x430; &#x449;&#x430;&#x441;&#x442;&#x44F;, ECMAScript 6 &#x434;&#x43E;&#x434;&#x430;&#x432; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Array.from()</code> &#x44F;&#x43A; &#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x438;&#x439;, &#x434;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x447;&#x438;&#x441;&#x442;&#x438;&#x439;, &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x456;&#x457; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;.</p>
<p>&#x421;&#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x44E;&#x447;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x430;&#x431;&#x43E; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x43C; &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x44F;&#x43A; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Array.from()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">doSomething</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">var</span> args = <span class="hljs-built_in">Array</span>.from(<span class="hljs-built_in">arguments</span>);

    <span class="hljs-comment">// &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x43C;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;</span>
}
</code></pre>
<p><code>Array.from()</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x449;&#x43E; &#x431;&#x430;&#x437;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x445; <code>arguments</code>. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; <code>args</code> &#x454; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x43C; <code>Array</code>, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x442;&#x456; &#x441;&#x430;&#x43C;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x442;&#x438;&#x43C;&#x438; &#x436; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x430;&#x43C;&#x438;, &#x449;&#x43E; &#x439; <code>arguments</code>.</p>
<p>I&gt; &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Array.from()</code> &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; <code>this</code>, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x442;&#x438;&#x43F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;.</p>
<h4 id="&#x43C;&#x430;&#x43F;&#x43E;&#x432;&#x430;&#x43D;&#x456;-&#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;">&#x41C;&#x430;&#x43F;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;</h4>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x43F;&#x456;&#x442;&#x438; &#x449;&#x435; &#x434;&#x430;&#x43B;&#x456; &#x432; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>Array.from()</code> &#x437; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E; &#x43C;&#x430;&#x43F;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;. &#x426;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43E;&#x43F;&#x435;&#x440;&#x443;&#x454; &#x43A;&#x43E;&#x436;&#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443;, &#x442;&#x430; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x454; &#x457;&#x445; &#x434;&#x43E; &#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x457; &#x444;&#x43E;&#x440;&#x43C;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x442;&#x438;&#x43C; &#x44F;&#x43A; &#x437;&#x431;&#x435;&#x440;&#x435;&#x433;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x437; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x43C; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x43E;&#x43C; &#x443; &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">translate</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-built_in">Array</span>.from(<span class="hljs-built_in">arguments</span>, (value) =&gt; value + <span class="hljs-number">1</span>);
}

<span class="hljs-keyword">let</span> numbers = translate(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>);

<span class="hljs-built_in">console</span>.log(numbers);               <span class="hljs-comment">// 2,3,4</span>
</code></pre>
<p>&#x422;&#x443;&#x442; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x43C;&#x430;&#x43F;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; <code>Array.from()</code> &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>(value) =&gt; value + 1</code>, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x434;&#x43E; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x447;&#x43B;&#x435;&#x43D;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; 1 &#x43F;&#x435;&#x440;&#x435;&#x434; &#x439;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x43E;&#x43C;. &#x42F;&#x43A;&#x449;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43C;&#x430;&#x43F;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;, &#x432;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x434;&#x43E; <code>Array.from()</code> &#x442;&#x440;&#x435;&#x442;&#x456;&#x439; &#x43D;&#x435; &#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;, &#x44F;&#x43A;&#x438;&#x439; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>this</code> &#x434;&#x43B;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x43C;&#x430;&#x43F;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> helper = {
    diff: <span class="hljs-number">1</span>,

    add(value) {
        <span class="hljs-keyword">return</span> value + <span class="hljs-keyword">this</span>.diff;
    }
};

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">translate</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-built_in">Array</span>.from(<span class="hljs-built_in">arguments</span>, helper.add, helper);
}

<span class="hljs-keyword">let</span> numbers = translate(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>);

<span class="hljs-built_in">console</span>.log(numbers);               <span class="hljs-comment">// 2,3,4</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x456;&#x457; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x43C;&#x430;&#x43F;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>helper.add()</code>. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>helper.add()</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>this.diff</code>, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x432;&#x43F;&#x440;&#x43E;&#x432;&#x430;&#x434;&#x438;&#x442;&#x438; &#x442;&#x440;&#x435;&#x442;&#x456;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x434;&#x43B;&#x44F; <code>Array.from()</code>, &#x449;&#x43E;&#x431; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x43D;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>this</code>. &#x417;&#x430;&#x432;&#x434;&#x44F;&#x43A;&#x438; &#x442;&#x440;&#x435;&#x442;&#x44C;&#x43E;&#x43C;&#x443; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; <code>Array.from()</code> &#x43C;&#x43E;&#x436;&#x435; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x43D;&#x456; &#x431;&#x435;&#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>bind()</code> &#x430;&#x431;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>this</code> &#x44F;&#x43A;&#x438;&#x43C;&#x43E;&#x441;&#x44C; &#x456;&#x43D;&#x448;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;.</p>
<h4 id="&#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;-&#x432;-&#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x445;-&#x43E;&#x431;&#x454;&#x43A;&#x442;&#x430;&#x445;">&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x432; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x445;</h4>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Array.from()</code> &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x44F;&#x43A; &#x437;&#x456; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x43C;&#x438; &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x442;&#x430;&#x43A; &#x456; &#x437; &#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43C;&#x43E;&#x436;&#x435; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x43E;&#x431;&#x2BC;&#x454;&#x43A;&#x442; &#x437; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; <code>Symbol.iterator</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> numbers = {
    *[<span class="hljs-built_in">Symbol</span>.iterator]() {
        <span class="hljs-keyword">yield</span> <span class="hljs-number">1</span>;
        <span class="hljs-keyword">yield</span> <span class="hljs-number">2</span>;
        <span class="hljs-keyword">yield</span> <span class="hljs-number">3</span>;
    }
};

<span class="hljs-keyword">let</span> numbers2 = <span class="hljs-built_in">Array</span>.from(numbers, (value) =&gt; value + <span class="hljs-number">1</span>);

<span class="hljs-built_in">console</span>.log(numbers2);              <span class="hljs-comment">// 2,3,4</span>
</code></pre>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43E;&#x431;&#x2BC;&#x454;&#x43A;&#x442; <code>numbers</code> &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; <code>numbers</code> &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x434;&#x43E; <code>Array.from()</code>, &#x449;&#x43E;&#x431; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43C;&#x430;&#x43F;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x434;&#x430;&#x454; 1 &#x434;&#x43E; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443;, &#x442;&#x43E;&#x43C;&#x443; &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; 2, 3, &#x442;&#x430; 4 &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; 1, 2, &#x442;&#x430; 3.</p>
<p>I&gt; &#x42F;&#x43A;&#x449;&#x43E; &#x43E;&#x431;&#x2BC;&#x454;&#x43A;&#x442; &#x456; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x445; &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x439;, &#x442;&#x43E;&#x434;&#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>Array.from()</code> &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;, &#x44F;&#x43A;&#x456; &#x442;&#x440;&#x435;&#x431;&#x430; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;.</p>
<h2 id="&#x43D;&#x43E;&#x432;&#x456;-&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;-&#x434;&#x43B;&#x44F;-&#x432;&#x441;&#x456;&#x445;-&#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;">&#x41D;&#x43E;&#x432;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;</h2>
<p>&#x41F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x44E;&#x447;&#x438; &#x442;&#x440;&#x435;&#x43D;&#x434; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x432;&#x430;&#x434;&#x436;&#x435;&#x43D;&#x438;&#x439; ECMAScript 5, ECMAScript 6 &#x434;&#x43E;&#x434;&#x430;&#x454; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43D;&#x43E;&#x432;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>find()</code> &#x442;&#x430; <code>findIndex()</code> &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456;, &#x449;&#x43E;&#x431; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x437; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; <code>fill()</code> &#x442;&#x430; <code>copyWithin()</code> &#x43D;&#x430;&#x442;&#x445;&#x43D;&#x435;&#x43D;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; <em>&#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;</em>, &#x444;&#x43E;&#x440;&#x43C;&#x43E;&#x44E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43E;&#x44E; &#x432; ECMAScript 6, &#x443; &#x44F;&#x43A;&#x456;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x446;&#x438;&#x444;&#x440;&#x438;.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;-find-&#x442;&#x430;-findindex">&#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; find() &#x442;&#x430; findIndex()</h3>
<p>&#x414;&#x43E; ECMAScript 5 &#x43F;&#x43E;&#x448;&#x443;&#x43A; &#x43F;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x445; &#x431;&#x443;&#x432; &#x434;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x43D;&#x435;&#x437;&#x433;&#x440;&#x430;&#x431;&#x43D;&#x438;&#x43C;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x434;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43D;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;. ECMAScript 5 &#x434;&#x43E;&#x434;&#x430;&#x432; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>indexOf()</code> &#x442;&#x430; <code>lastIndexOf()</code>, &#x43D;&#x430;&#x440;&#x435;&#x448;&#x442;&#x456; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x432;&#x448;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C; &#x448;&#x443;&#x43A;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x432;&#x43D;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x426;&#x456; &#x434;&#x432;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x43D;&#x438;&#x43C; &#x43F;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;, &#x430;&#x43B;&#x435; &#x432;&#x43E;&#x43D;&#x438; &#x432;&#x441;&#x435; &#x449;&#x435; &#x431;&#x443;&#x43B;&#x438; &#x434;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x456;, &#x431;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x448;&#x443;&#x43A;&#x430;&#x442;&#x438; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43E;&#x434;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x440;&#x430;&#x437;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x442;&#x456;&#x43B;&#x438; &#x432;&#x456;&#x434;&#x448;&#x443;&#x43A;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x448;&#x435; &#x43F;&#x430;&#x440;&#x43D;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x432; &#x43D;&#x430;&#x431;&#x43E;&#x440;&#x456; &#x447;&#x438;&#x441;&#x435;&#x43B;, &#x432;&#x438; &#x43C;&#x430;&#x43B;&#x438; &#x431; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x434;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E;. ECMAScript 6 &#x432;&#x438;&#x440;&#x456;&#x448;&#x438;&#x432; &#x446;&#x44E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443;, &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x43F;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x432;&#x448;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>find()</code> &#x442;&#x430; <code>findIndex()</code>.</p>
<p>&#x41E;&#x431;&#x438;&#x434;&#x432;&#x430;, <code>find()</code> &#x442;&#x430; <code>findIndex()</code>, &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x434;&#x432;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;: &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x442;&#x430; &#x43D;&#x435;&#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; <code>this</code> &#x432; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;. &#x414;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x442;&#x430; &#x441;&#x430;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x2014; &#x442;&#x430;&#x43A;&#x456; &#x436; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;, &#x44F;&#x43A;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; <code>map()</code> &#x442;&#x430; <code>forEach()</code>. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>true</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43A;&#x440;&#x438;&#x442;&#x435;&#x440;&#x456;&#x44F;&#x43C;, &#x44F;&#x43A;&#x456; &#x432;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x43B;&#x438;. &#x41E;&#x431;&#x438;&#x434;&#x432;&#x430;, <code>find()</code> &#x442;&#x430; <code>findIndex()</code>, &#x43F;&#x440;&#x438;&#x43F;&#x438;&#x43D;&#x44F;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x448;&#x443;&#x43A; &#x43F;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x432;&#x43F;&#x435;&#x440;&#x448;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>true</code>.</p>
<p>&#x404;&#x434;&#x438;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x456;&#x436; &#x446;&#x438;&#x43C;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; <code>find()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441;, &#x43A;&#x43E;&#x43B;&#x438; <code>findIndex()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441; &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x431;&#x443;&#x43B;&#x43E; &#x437;&#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x434;&#x43B;&#x44F; &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x430;&#x446;&#x456;&#x457;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> numbers = [<span class="hljs-number">25</span>, <span class="hljs-number">30</span>, <span class="hljs-number">35</span>, <span class="hljs-number">40</span>, <span class="hljs-number">45</span>];

<span class="hljs-built_in">console</span>.log(numbers.find(n =&gt; n &gt; <span class="hljs-number">33</span>));         <span class="hljs-comment">// 35</span>
<span class="hljs-built_in">console</span>.log(numbers.findIndex(n =&gt; n &gt; <span class="hljs-number">33</span>));    <span class="hljs-comment">// 2</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; <code>find()</code> &#x442;&#x430; <code>findIndex()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x448;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; <code>numbers</code>, &#x44F;&#x43A;&#x435; &#x454; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x438;&#x43C; &#x437;&#x430; 33. &#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>find()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; 35, &#x430; <code>findIndex()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; 2, &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441; 35 &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; <code>numbers</code>.</p>
<p>&#x41E;&#x431;&#x438;&#x434;&#x432;&#x430;, <code>find()</code> &#x442;&#x430; <code>findIndex()</code>, &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x456;, &#x449;&#x43E;&#x431; &#x432;&#x456;&#x434;&#x448;&#x443;&#x43A;&#x430;&#x442;&#x438; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43F;&#x435;&#x432;&#x43D;&#x456;&#x439; &#x443;&#x43C;&#x43E;&#x432;&#x456;, &#x430; &#x43D;&#x435; &#x439;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44E;. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x432;&#x456;&#x434;&#x448;&#x443;&#x43A;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x442;&#x43E; &#x43A;&#x440;&#x430;&#x449;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x442;&#x438; <code>indexOf()</code> &#x442;&#x430; <code>lastIndexOf()</code>.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-fill">&#x41C;&#x435;&#x442;&#x43E;&#x434; fill()</h3>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>fill()</code> &#x437;&#x430;&#x43F;&#x43E;&#x432;&#x43D;&#x44E;&#x454; &#x43E;&#x434;&#x438;&#x43D; &#x447;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;. &#x41A;&#x43E;&#x43B;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>fill()</code> &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x443;&#x454; &#x432;&#x441;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> numbers = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>];

numbers.fill(<span class="hljs-number">1</span>);

<span class="hljs-built_in">console</span>.log(numbers.toString());    <span class="hljs-comment">// 1,1,1,1</span>
</code></pre>
<p>&#x422;&#x443;&#x442; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>numbers.fill(1)</code> &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454; &#x432;&#x441;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; <code>numbers</code> &#x43D;&#x430; <code>1</code>. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x43F;&#x435;&#x432;&#x43D;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438;, &#x440;&#x430;&#x434;&#x448;&#x435; &#x43D;&#x456;&#x436; &#x443;&#x441;&#x456;, &#x442;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x442;&#x430; &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x438;&#x439; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x438;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> numbers = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>];

numbers.fill(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>);

<span class="hljs-built_in">console</span>.log(numbers.toString());    <span class="hljs-comment">// 1,2,1,1</span>

numbers.fill(<span class="hljs-number">0</span>, <span class="hljs-number">1</span>, <span class="hljs-number">3</span>);

<span class="hljs-built_in">console</span>.log(numbers.toString());    <span class="hljs-comment">// 1,0,0,1</span>
</code></pre>
<p>&#x423; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>numbers.fill(1,2)</code>, <code>2</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x454; &#x43C;&#x456;&#x441;&#x446;&#x435;&#x43C; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x437;&#x430;&#x43F;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441; 2. &#x41A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x438;&#x439; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441; &#x43D;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x442;&#x440;&#x435;&#x442;&#x44C;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;, &#x442;&#x43E;&#x43C;&#x443; &#x434;&#x43B;&#x44F; &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x43E;&#x433;&#x43E; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43E; <code>numbers.length</code>, &#x446;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x434;&#x432;&#x430; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x443; <code>numbers</code> &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x437;&#x430;&#x43F;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; <code>1</code>. &#x41E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F; <code>numbers.fill(0, 1, 3)</code> &#x437;&#x430;&#x43F;&#x43E;&#x432;&#x43D;&#x44E;&#x454; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x430;&#x43C;&#x438; 1 &#x442;&#x430; 2 &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; <code>0</code>. &#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>fill()</code> &#x437; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43C; &#x442;&#x430; &#x442;&#x440;&#x435;&#x442;&#x456;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x437;&#x430;&#x43F;&#x43E;&#x432;&#x43D;&#x438;&#x442;&#x438; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x437;&#x430; &#x43E;&#x434;&#x438;&#x43D; &#x440;&#x430;&#x437; &#x431;&#x435;&#x437; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x441;&#x44C;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;.</p>
<p>I&gt; &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x430;&#x431;&#x43E; &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x438;&#x439; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x438; &#x454; &#x432;&#x456;&#x434;&#x2019;&#x454;&#x43C;&#x43D;&#x438;&#x43C;&#x438;, &#x442;&#x43E; &#x446;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x456; &#x434;&#x43E; &#x440;&#x43E;&#x437;&#x43C;&#x456;&#x440;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x435; &#x440;&#x43E;&#x437;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x436;&#x435;&#x43D;&#x43D;&#x44F; <code>-1</code> &#x434;&#x430;&#x454; <code>array.length &#x2014; 1</code> &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443;, &#x434;&#x435; <code>array</code> &#x454; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C;, &#x434;&#x43E; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x43E; <code>fill()</code>.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-copywithin">&#x41C;&#x435;&#x442;&#x43E;&#x434; copyWithin()</h3>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>copyWithin()</code> &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x434;&#x43E; <code>fill()</code> &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x447;&#x43B;&#x435;&#x43D;&#x456;&#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x437;&#x430; &#x440;&#x430;&#x437;. &#x410;&#x43B;&#x435;, &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438; &#x43E;&#x434;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x44F;&#x43A;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x435; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, <code>copyWithin()</code> &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x441;&#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x437; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; &#x441;&#x435;&#x431;&#x435;. &#x429;&#x43E;&#x431; &#x434;&#x43E;&#x441;&#x44F;&#x433;&#x442;&#x438; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x434;&#x432;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x434;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>copyWithin()</code>: &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;, &#x437; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x438; &#x437;&#x430;&#x43F;&#x43E;&#x432;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;, &#x437; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x447;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;.</p>
<p>&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x449;&#x43E;&#x431; &#x441;&#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x445; &#x434;&#x432;&#x43E;&#x445; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x434;&#x43E; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456;&#x445; &#x434;&#x432;&#x43E;&#x445;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> numbers = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>];

<span class="hljs-comment">// &#x432;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; 2</span>
<span class="hljs-comment">// &#x441;&#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; 0</span>
numbers.copyWithin(<span class="hljs-number">2</span>, <span class="hljs-number">0</span>);

<span class="hljs-built_in">console</span>.log(numbers.toString());    <span class="hljs-comment">// 1,2,1,2</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; <code>numbers</code>, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; 2, &#x442;&#x43E;&#x43C;&#x443; &#x43E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x438; (2 &#x456; 3) &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x456;. &#x41F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x447;&#x438; <code>0</code> &#x44F;&#x43A; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x434;&#x43E; <code>copyWithin()</code>, &#x43C;&#x438; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x43C;&#x43E; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43E;&#x43A;, &#x43E;&#x442;&#x436;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; 0 &#x456; &#x434;&#x43E;&#x442;&#x438;, &#x43F;&#x43E;&#x43A;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x417;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, <code>copyWithin()</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x430;&#x436; &#x434;&#x43E; &#x43A;&#x456;&#x43D;&#x446;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x430;&#x43B;&#x435; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43D;&#x430;&#x434;&#x430;&#x442;&#x438; &#x43D;&#x435; &#x43E;&#x431;&#x43E;&#x432;&apos;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x442;&#x440;&#x435;&#x442;&#x456;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;, &#x449;&#x43E;&#x431; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x438;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x456;. &#x426;&#x435;&#x439; &#x442;&#x440;&#x435;&#x442;&#x456;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x454; &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x438;&#x43C; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x43E;&#x43C; &#x43D;&#x430; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x431;&#x443;&#x434;&#x435; &#x437;&#x443;&#x43F;&#x438;&#x43D;&#x435;&#x43D;&#x43E;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> numbers = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>, <span class="hljs-number">4</span>];

<span class="hljs-comment">// &#x432;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; 2</span>
<span class="hljs-comment">// &#x441;&#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; 0</span>
<span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x435;&#x441;&#x442;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x432;&#x430;&#x442;&#x438;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x434;&#x43E;&#x441;&#x44F;&#x433;&#x43D;&#x435;&#x442;&#x435; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; 1</span>
numbers.copyWithin(<span class="hljs-number">2</span>, <span class="hljs-number">0</span>, <span class="hljs-number">1</span>);

<span class="hljs-built_in">console</span>.log(numbers.toString());    <span class="hljs-comment">// 1,2,1,4</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x43E;&#x43C; 0 &#x441;&#x43A;&#x43E;&#x43F;&#x456;&#x439;&#x43E;&#x432;&#x430;&#x43D;&#x435;, &#x431;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x43E;&#x432;&#x2BC;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43E; &#x434;&#x43E; <code>1</code>. &#x41E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x43C;.</p>
<p>I&gt; &#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x44F;&#x43A; &#x456; &#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43C; <code>fill()</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x441;&#x442;&#x435; &#x432;&#x456;&#x434;&#x2BC;&#x454;&#x43C;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>copyWithin()</code>, &#x442;&#x43E; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x431;&#x443;&#x434;&#x435; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x430; &#x434;&#x43E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;, &#x44F;&#x43A;&#x438;&#x439; &#x441;&#x43B;&#x456;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;.</p>
<p>&#x412; &#x434;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x432;&#x430;&#x43C; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43D;&#x435;&#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x43E;&#x44E; &#x434;&#x43E;&#x446;&#x456;&#x43B;&#x44C;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>fill()</code> &#x442;&#x430; <code>copyWithin()</code>. &#x426;&#x435; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x432; &#x43F;&#x435;&#x440;&#x448;&#x443; &#x447;&#x435;&#x440;&#x433;&#x443;, &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x43B;&#x438;&#x441;&#x44C; &#x434;&#x43B;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x442;&#x430; &#x431;&#x443;&#x43B;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x456; &#x434;&#x43E; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x434;&#x43B;&#x44F; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x457; &#x43E;&#x434;&#x43D;&#x43E;&#x43C;&#x430;&#x43D;&#x456;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x456;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x44F;&#x43A; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x438; &#x434;&#x456;&#x437;&#x43D;&#x430;&#x454;&#x442;&#x435;&#x441;&#x44C;, &#x437; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x443;, &#x43F;&#x440;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x43D;&#x456;&#x43F;&#x443;&#x43B;&#x44F;&#x446;&#x456;&#x439; &#x431;&#x456;&#x442;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x447;&#x438;&#x441;&#x43B;&#x430;&#x43C;&#x438;, &#x446;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x441;&#x442;&#x430;&#x43D;&#x443;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x443; &#x43D;&#x430;&#x433;&#x43E;&#x434;&#x456;.</p>
<h2 id="&#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456;-&#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;">&#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;</h2>
<p>&#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x454; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438; (&#x43C;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x443; &#x432;&#x430;&#x437;&#x456; &#x43D;&#x435; &#x432;&#x441;&#x456; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x456; &#x442;&#x438;&#x43F;&#x438;). &#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x431;&#x435;&#x440;&#x443;&#x442;&#x44C; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43E;&#x43A; &#x437; WebGL, &#x43F;&#x43E;&#x440;&#x442;&#x443; Open GL ES 2.0, &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x435;&#x431;-&#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43E;&#x43A; &#x437; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; <code>&lt;canvas&gt;</code>. &#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x456; &#x44F;&#x43A; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x43F;&#x43E;&#x440;&#x442;&#x443;, &#x449;&#x43E;&#x431; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x438;&#x442;&#x438; &#x448;&#x432;&#x438;&#x434;&#x43A;&#x43E;&#x457; &#x43F;&#x43E;&#x431;&#x456;&#x442;&#x43E;&#x432;&#x43E;&#x457; &#x430;&#x440;&#x438;&#x444;&#x43C;&#x435;&#x442;&#x438;&#x43A;&#x438; &#x432; JavaScript.</p>
<p>&#x41E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x445; &#x447;&#x438;&#x441;&#x435;&#x43B; &#x432; JavaScript &#x431;&#x443;&#x43B;&#x43E; &#x437;&#x430;&#x43D;&#x430;&#x434;&#x442;&#x43E; &#x43F;&#x43E;&#x432;&#x456;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x434;&#x43B;&#x44F; WebGL, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x431;&#x443;&#x43B;&#x438; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x456; &#x443; 64-&#x431;&#x456;&#x442;&#x43D;&#x43E;&#x43C;&#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; &#x437; &#x440;&#x443;&#x445;&#x43E;&#x43C;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x43E;&#x44E; &#x442;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44F; &#x443; 32-&#x440;&#x43E;&#x437;&#x440;&#x44F;&#x434;&#x43D;&#x456; &#x446;&#x456;&#x43B;&#x456; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x437;&#x430; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x43E;&#x44E;. &#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x456;, &#x449;&#x43E;&#x431; &#x43E;&#x431;&#x456;&#x439;&#x442;&#x438; &#x446;&#x435; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x456; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x438;&#x442;&#x438; &#x432;&#x438;&#x449;&#x443; &#x448;&#x432;&#x438;&#x434;&#x43A;&#x43E;&#x434;&#x456;&#x44E; &#x434;&#x43B;&#x44F; &#x430;&#x440;&#x438;&#x444;&#x43C;&#x435;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x445; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439;. &#x41A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x446;&#x456;&#x44F; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x435; &#x43E;&#x434;&#x438;&#x43D;&#x438;&#x447;&#x43D;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x43C;&#x43E;&#x436;&#x435; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x44F;&#x43A; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x431;&#x456;&#x442;&#x456;&#x432; &#x456;, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x432;&#x438;&#x447;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x445; JavaScript.</p>
<p>&#x423; ECMAScript 6 &#x431;&#x443;&#x43B;&#x43E; &#x43F;&#x440;&#x438;&#x439;&#x43D;&#x44F;&#x442;&#x43E; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x444;&#x456;&#x446;&#x456;&#x439;&#x43D;&#x43E;&#x457; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x43C;&#x43E;&#x432;&#x438; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x440;&#x430;&#x449;&#x43E;&#x457; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x456;&#x436; &#x440;&#x443;&#x448;&#x456;&#x44F;&#x43C;&#x438; JavaScript &#x442;&#x430; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x434;&#x456;&#x454;&#x44E; &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438; JavaScript. &#x41D;&#x435; &#x434;&#x438;&#x432;&#x43B;&#x44F;&#x447;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x443; ECMAScript 6 &#x43D;&#x435; &#x437;&#x43E;&#x432;&#x441;&#x456;&#x43C; &#x442;&#x430;&#x43A;&#x456; &#x436;, &#x44F;&#x43A; &#x443; WebGL, &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43D;&#x44C;&#x43E; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x441;&#x43F;&#x456;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x432;&#x435;&#x440;&#x441;&#x456;&#x44E; ECMAScript 6 &#x435;&#x432;&#x43E;&#x43B;&#x44E;&#x446;&#x456;&#x439;&#x43D;&#x43E;&#x44E; &#x43D;&#x430; &#x448;&#x43B;&#x44F;&#x445;&#x443; &#x434;&#x43E; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; WebGL, &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x456;&#x43D;&#x448;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434;.</p>
<h3 id="&#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x456;-&#x442;&#x438;&#x43F;&#x438;-&#x434;&#x430;&#x43D;&#x438;&#x445;">&#x427;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x456; &#x442;&#x438;&#x43F;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445;</h3>
<p>&#x427;&#x438;&#x441;&#x43B;&#x430; &#x432; JavaScript &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; IEEE 754, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; 64 &#x431;&#x456;&#x442;&#x430; &#x434;&#x43B;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x437; &#x440;&#x443;&#x445;&#x43E;&#x43C;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x43E;&#x44E;. &#x426;&#x435;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x454; &#x44F;&#x43A; &#x446;&#x456;&#x43B;&#x456; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x442;&#x430;&#x43A; &#x456; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x437; &#x440;&#x443;&#x445;&#x43E;&#x43C;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x43E;&#x44E; &#x432; JavaScript, &#x437; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43C;&#x456;&#x436; &#x434;&#x432;&#x43E;&#x43C;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x430;&#x43C;&#x438; &#x437; &#x447;&#x430;&#x441;&#x442;&#x43E;&#x442;&#x43E;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x447;&#x438;&#x441;&#x435;&#x43B;. &#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x442;&#x438; &#x456; &#x43C;&#x430;&#x43D;&#x456;&#x43F;&#x443;&#x43B;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x432;&#x456;&#x441;&#x44C;&#x43C;&#x43E;&#x43C;&#x430; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x43C;&#x438; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438;:</p>
<ol>
<li>&#x446;&#x456;&#x43B;&#x435; 8-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C; (int8);</li>
<li>&#x446;&#x456;&#x43B;&#x435; 8-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x431;&#x435;&#x437; &#x437;&#x43D;&#x430;&#x43A;&#x443; (uint8);</li>
<li>&#x446;&#x456;&#x43B;&#x435; 16-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C; (int16);</li>
<li>&#x446;&#x456;&#x43B;&#x435; 16-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x431;&#x435;&#x437; &#x437;&#x43D;&#x430;&#x43A;&#x443; (uint16);</li>
<li>&#x446;&#x456;&#x43B;&#x435; 32-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C; (int32);</li>
<li>&#x446;&#x456;&#x43B;&#x435; 32-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x431;&#x435;&#x437; &#x437;&#x43D;&#x430;&#x43A;&#x443; (uint32);</li>
<li>32-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x437; &#x440;&#x443;&#x445;&#x43E;&#x43C;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x43E;&#x44E; (float32);</li>
<li>64-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x437; &#x440;&#x443;&#x445;&#x43E;&#x43C;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x43E;&#x44E; (float64).</li>
</ol>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x454;&#x442;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;, &#x44F;&#x43A;&#x435; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; int8 &#x44F;&#x43A; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x432; JavaScript, &#x432;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x432;&#x438;&#x442;&#x440;&#x430;&#x447;&#x430;&#x442;&#x438; 56 &#x431;&#x456;&#x442;. &#x426;&#x456; &#x431;&#x456;&#x442;&#x438; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x431; &#x43A;&#x440;&#x430;&#x449;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; int8 &#x430;&#x431;&#x43E; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x430;, &#x44F;&#x43A;&#x435; &#x432;&#x438;&#x43C;&#x430;&#x433;&#x430;&#x454; &#x43C;&#x435;&#x43D;&#x448;&#x435;, &#x43D;&#x456;&#x436; 56 &#x431;&#x456;&#x442;. &#x415;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x456;&#x448;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x431;&#x456;&#x442;&#x456;&#x432; - &#x446;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x437; &#x432;&#x430;&#x440;&#x456;&#x430;&#x43D;&#x442;&#x456;&#x432; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;.</p>
<p>&#x412;&#x441;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x442;&#x430; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x438;, &#x43F;&#x43E;&#x432;&apos;&#x44F;&#x437;&#x430;&#x43D;&#x456; &#x437; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438;? &#x437;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x436;&#x435;&#x43D;&#x456; &#x43D;&#x430;&#x432;&#x43A;&#x43E;&#x43B;&#x43E; &#x446;&#x438;&#x445; &#x432;&#x43E;&#x441;&#x44C;&#x43C;&#x438; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x434;&#x430;&#x43D;&#x438;&#x445;. &#x410;&#x43B;&#x435;, &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x457;&#x445;, &#x432;&#x430;&#x43C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x434;&#x43B;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445;.</p>
<p>I&gt; &#x423; &#x446;&#x456;&#x439; &#x43A;&#x43D;&#x438;&#x437;&#x456; &#x44F; &#x431;&#x443;&#x434;&#x443; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x43D;&#x430; &#x446;&#x456; &#x442;&#x438;&#x43F;&#x438; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E; &#x434;&#x43E; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x44C;, &#x44F;&#x43A;&#x456; &#x44F; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x432; &#x432; &#x434;&#x443;&#x436;&#x43A;&#x430;&#x445;. &#x426;&#x456; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x43D;&#x435; &#x437;&apos;&#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43A;&#x43E;&#x434;&#x456; JavaScript; &#x446;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x434;&#x43E;&#x432;&#x433;&#x438;&#x445; &#x43E;&#x43F;&#x438;&#x441;&#x456;&#x432;.</p>
<h3 id="&#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x456;-&#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;">&#x411;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;</h3>
<p>&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x43E;&#x44E; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x454; <em>&#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;</em>, &#x44F;&#x43A;&#x438;&#x439; &#x44F;&#x432;&#x43B;&#x44F;&#x454; &#x441;&#x43E;&#x431;&#x43E;&#x44E; &#x434;&#x456;&#x43B;&#x44F;&#x43D;&#x43A;&#x443; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x456;, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43F;&#x435;&#x432;&#x43D;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;. &#x421;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x454; &#x447;&#x438;&#x43C;&#x43E;&#x441;&#x44C; &#x43D;&#x430; &#x43A;&#x448;&#x442;&#x430;&#x43B;&#x442; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>malloc()</code> &#x432; C, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x434;&#x456;&#x43B;&#x438;&#x442;&#x438; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x44C; &#x431;&#x435;&#x437; &#x432;&#x43A;&#x430;&#x437;&#x456;&#x432;&#x43A;&#x438; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x431;&#x43B;&#x43E;&#x43A; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x456; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x443; <code>ArrayBuffer</code> &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> buffer = <span class="hljs-keyword">new</span> <span class="hljs-built_in">ArrayBuffer</span>(<span class="hljs-number">10</span>);   <span class="hljs-comment">// &#x432;&#x438;&#x434;&#x456;&#x43B;&#x438;&#x442;&#x438; 10 &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;</span>
</code></pre>
<p>&#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x439;&#x442;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x435;&#x43D; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430;. &#x426;&#x435;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>let</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x43E;&#x44E; 10 &#x431;&#x430;&#x439;&#x442;. &#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x439;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; &#x432; &#x43D;&#x44C;&#x43E;&#x43C;&#x443;, &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x44E;&#x447;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>byteLength</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> buffer = <span class="hljs-keyword">new</span> <span class="hljs-built_in">ArrayBuffer</span>(<span class="hljs-number">10</span>);   <span class="hljs-comment">// &#x432;&#x438;&#x434;&#x456;&#x43B;&#x438;&#x442;&#x438; 10 &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;</span>
<span class="hljs-built_in">console</span>.log(buffer.byteLength);     <span class="hljs-comment">// 10</span>
</code></pre>
<p>&#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>slice()</code>, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>slice()</code> &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x44F;&#x43A; &#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>slice()</code> &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x445;: &#x432;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x435; &#x439;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x456; &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x438;&#x439; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x438; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;, &#x456; &#x432;&#x456;&#x43D; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; <code>ArrayBuffer</code>, &#x449;&#x43E; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x442;&#x438;&#x445; &#x441;&#x430;&#x43C;&#x438;&#x445; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x43E;&#x440;&#x438;&#x433;&#x456;&#x43D;&#x430;&#x43B;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> buffer = <span class="hljs-keyword">new</span> <span class="hljs-built_in">ArrayBuffer</span>(<span class="hljs-number">10</span>);   <span class="hljs-comment">// &#x432;&#x438;&#x434;&#x456;&#x43B;&#x438;&#x442;&#x438; 10 &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;</span>


<span class="hljs-keyword">let</span> buffer2 = buffer.slice(<span class="hljs-number">4</span>, <span class="hljs-number">6</span>);
<span class="hljs-built_in">console</span>.log(buffer2.byteLength);    <span class="hljs-comment">// 2</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; <code>buffer2</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C; &#x432;&#x438;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; &#x437;&#x430; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x430;&#x43C;&#x438; 4 &#x442;&#x430; 5. &#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; <code>slice()</code> &#x454; &#x432;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x447;&#x438;&#x43C;.</p>
<p>&#x417;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E;, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x456;&#x441;&#x446;&#x44F; &#x434;&#x43B;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x434;&#x443;&#x436;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x435;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x432; &#x446;&#x435; &#x43C;&#x456;&#x441;&#x446;&#x435;. &#x414;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>I&gt; &#x411;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x454; &#x442;&#x43E;&#x447;&#x43D;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;, &#x437;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x456;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;, &#x430;&#x43B;&#x435; &#x43D;&#x435; &#x440;&#x43E;&#x437;&#x43C;&#x456;&#x440; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;.</p>
<h3 id="&#x43C;&#x430;&#x43D;&#x456;&#x43F;&#x443;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x43C;&#x438;-&#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438;-&#x437;&#x430;-&#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E;-&#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x44C;">&#x41C;&#x430;&#x43D;&#x456;&#x43F;&#x443;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x43C;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x44C;</h3>
<p>&#x411;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x434;&#x456;&#x43B;&#x44F;&#x43D;&#x43A;&#x438; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x456;, &#x430; <em>&#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;</em> &#x2014; &#x446;&#x435; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x43D;&#x456;&#x43F;&#x443;&#x43B;&#x44F;&#x446;&#x456;&#x439; &#x437; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x442;&#x44E;. &#x41F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x43F;&#x435;&#x440;&#x443;&#x454; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C; &#x430;&#x431;&#x43E; &#x43F;&#x456;&#x434;&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x43E;&#x44E; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x437;&#x447;&#x438;&#x442;&#x443;&#x44E;&#x447;&#x438; &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x44E;&#x447;&#x438; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x43C;&#x443; &#x437; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x434;&#x430;&#x43D;&#x438;&#x445;. &#x422;&#x438;&#x43F; <code>DataView</code> &#x44F;&#x432;&#x43B;&#x44F;&#x454; &#x441;&#x43E;&#x431;&#x43E;&#x44E; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x443;&#x441;&#x456;&#x43C;&#x430; &#x432;&#x456;&#x441;&#x44C;&#x43C;&#x43E;&#x43C;&#x430; &#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x445; &#x434;&#x430;&#x43D;&#x438;&#x445;.</p>
<p>&#x414;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>DataView</code>, &#x441;&#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; <code>ArrayBuffer</code> &#x442;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x438;&#x439; <code>DataView</code>. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> buffer = <span class="hljs-keyword">new</span> <span class="hljs-built_in">ArrayBuffer</span>(<span class="hljs-number">10</span>),
    view = <span class="hljs-keyword">new</span> <span class="hljs-built_in">DataView</span>(buffer);
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442; <code>view</code> &#x43C;&#x430;&#x454; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x432;&#x441;&#x456;&#x445; 10 &#x431;&#x430;&#x439;&#x442; &#x432; <code>buffer</code>. &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x431;&#x443;&#x444;&#x435;&#x440;&#x430;. &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432;&#x43A;&#x430;&#x436;&#x456;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x430;&#x439;&#x442;&#x443; &#x434;&#x43B;&#x44F; &#x437;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x456;, &#x43F;&#x440;&#x438; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456;, &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x442;&#x440;&#x435;&#x431;&#x430; &#x432;&#x437;&#x44F;&#x442;&#x438; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x437;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F;. &#x41A;&#x43E;&#x43B;&#x438; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; &#x43D;&#x435; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x435;, <code>DataView</code> &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x438; &#x432;&#x456;&#x434; &#x437;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; &#x43A;&#x456;&#x43D;&#x446;&#x44F; &#x431;&#x443;&#x444;&#x435;&#x440;&#x430;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> buffer = <span class="hljs-keyword">new</span> <span class="hljs-built_in">ArrayBuffer</span>(<span class="hljs-number">10</span>),
    view = <span class="hljs-keyword">new</span> <span class="hljs-built_in">DataView</span>(buffer, <span class="hljs-number">5</span>, <span class="hljs-number">2</span>);      <span class="hljs-comment">// &#x43F;&#x43E;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x454; &#x431;&#x430;&#x439;&#x442;&#x438; 5 &#x442;&#x430; 6</span>
</code></pre>
<p>&#x422;&#x443;&#x442;, <code>view</code> &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437; &#x431;&#x430;&#x439;&#x442;&#x430;&#x43C;&#x438; &#x437;&#x430; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x430;&#x43C;&#x438; 5 &#x456; 6. &#x426;&#x435;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x44C; &#x437; &#x442;&#x438;&#x43C; &#x436;&#x435; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C;, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43C;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x434;&#x43D;&#x443; &#x43A;&#x43E;&#x43C;&#x456;&#x440;&#x43A;&#x443; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x456; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x454;&#x457; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438;, &#x430; &#x43D;&#x435; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x456;&#x447;&#x43D;&#x43E; &#x432;&#x438;&#x434;&#x456;&#x43B;&#x44F;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x440; &#x43F;&#x440;&#x438; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456;.</p>
<h4 id="&#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454;&#x43C;&#x43E;-&#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E;-&#x437;-&#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;">&#x41E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454;&#x43C;&#x43E; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x437; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;</h4>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x43F;&#x440;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;, &#x437;&#x430;&#x43F;&#x438;&#x442;&#x443;&#x44E;&#x447;&#x438; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;, &#x44F;&#x43A;&#x456; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F;:</p>
<ul>
<li><code>buffer</code> - &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x437; &#x44F;&#x43A;&#x438;&#x43C; &#x43F;&#x43E;&#x432;&apos;&#x44F;&#x437;&#x430;&#x43D;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;</li>
<li><code>byteOffset</code> - &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x443; <code>DataView</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x439; (0 &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;)</li>
<li><code>byteLength</code> - &#x442;&#x440;&#x435;&#x442;&#x456;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x443; <code>DataView</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x439; (&#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>byteLength</code> &#x432;&#x456;&#x434; <code>buffer</code> &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;)</li>
</ul>
<p>&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x446;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x442;&#x438;, &#x434;&#x435; &#x441;&#x430;&#x43C;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;, &#x43E;&#x441;&#x44C; &#x44F;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> buffer = <span class="hljs-keyword">new</span> <span class="hljs-built_in">ArrayBuffer</span>(<span class="hljs-number">10</span>),
    view1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">DataView</span>(buffer),           <span class="hljs-comment">// &#x43F;&#x43E;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x454; &#x432;&#x441;&#x456; &#x431;&#x430;&#x439;&#x442;&#x438;</span>
    view2 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">DataView</span>(buffer, <span class="hljs-number">5</span>, <span class="hljs-number">2</span>);     <span class="hljs-comment">// &#x43F;&#x43E;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x454; &#x431;&#x430;&#x439;&#x442;&#x438; 5 &#x442;&#x430; 6</span>

<span class="hljs-built_in">console</span>.log(view1.buffer === buffer);       <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(view2.buffer === buffer);       <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(view1.byteOffset);              <span class="hljs-comment">// 0</span>
<span class="hljs-built_in">console</span>.log(view2.byteOffset);              <span class="hljs-comment">// 5</span>
<span class="hljs-built_in">console</span>.log(view1.byteLength);              <span class="hljs-comment">// 10</span>
<span class="hljs-built_in">console</span>.log(view2.byteLength);              <span class="hljs-comment">// 2</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; <code>view1</code>, &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x44C;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x456; <code>view2</code>, &#x44F;&#x43A;&#x438;&#x439; &#x434;&#x456;&#x454; &#x43D;&#x430; &#x43D;&#x435;&#x432;&#x435;&#x43B;&#x438;&#x43A;&#x456;&#x439; &#x434;&#x456;&#x43B;&#x44F;&#x43D;&#x446;&#x456; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x426;&#x456; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>buffer</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x43E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x443; &#x442;&#x43E;&#x43C;&#x443; &#x436; &#x441;&#x430;&#x43C;&#x43E;&#x43C;&#x443; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, <code>byteOffset</code> &#x442;&#x430; <code>byteLength</code> &#x440;&#x456;&#x437;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;. &#x412;&#x43E;&#x43D;&#x438; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x44E;&#x442;&#x44C; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x44F;&#x43A;&#x438;&#x43C;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x443;&#x454; &#x43A;&#x43E;&#x436;&#x43D;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x417;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E;, &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x457; &#x43F;&#x440;&#x43E; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x44C; &#x441;&#x430;&#x43C;&#x43E; &#x441;&#x43E;&#x431;&#x43E;&#x44E; &#x43D;&#x435; &#x434;&#x443;&#x436;&#x435; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x435;. &#x429;&#x43E;&#x431; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x445;&#x43E;&#x447; &#x44F;&#x43A;&#x443;&#x441;&#x44C; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x44C; &#x437; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x456; &#x437;&#x447;&#x438;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x457;&#x445; &#x437; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x456;.</p>
<h4 id="&#x437;&#x447;&#x438;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x456;-&#x437;&#x430;&#x43F;&#x438;&#x441;-&#x434;&#x430;&#x43D;&#x438;&#x445;">&#x417;&#x447;&#x438;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441; &#x434;&#x430;&#x43D;&#x438;&#x445;</h4>
<p>&#x414;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x437; &#x432;&#x43E;&#x441;&#x44C;&#x43C;&#x438; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x432; JavaScript, &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F; <code>DataView</code> &#x43C;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x456; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x437;&#x447;&#x438;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x437; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x41D;&#x430;&#x437;&#x432;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437; &quot;set&quot; &#x430;&#x431;&#x43E; &quot;get&quot; &#x456; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x430;&#x431;&#x440;&#x435;&#x432;&#x456;&#x430;&#x442;&#x443;&#x440;&#x430;&#x43C; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x434;&#x430;&#x43D;&#x438;&#x445;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43E;&#x441;&#x44C; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;, &#x44F;&#x43A;&#x456; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; int8 &#x442;&#x430; uint8:</p>
<ul>
<li><code>getInt8(byteOffset, littleEndian)</code> - &#x437;&#x447;&#x438;&#x442;&#x443;&#x454; &#x434;&#x430;&#x43D;&#x456; int8, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; <code>byteOffset</code></li>
<li><code>setInt8(byteOffset, value, littleEndian)</code> - &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x454; &#x434;&#x430;&#x43D;&#x456; int8, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; <code>byteOffset</code></li>
<li><code>getUint8(byteOffset, littleEndian)</code> - &#x437;&#x447;&#x438;&#x442;&#x443;&#x454; &#x434;&#x430;&#x43D;&#x456; uint8, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; <code>byteOffset</code></li>
<li><code>setUint8(byteOffset, value, littleEndian)</code> - &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x454; &#x434;&#x430;&#x43D;&#x456; uint8, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; <code>byteOffset</code></li>
</ul>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; &quot;get&quot; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x434;&#x432;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;: &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x430;&#x439;&#x442;&#x443; &#x437;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x456; &#x43D;&#x435;&#x43E;&#x431;&#x43E;&#x432;&apos;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x435; &#x43B;&#x43E;&#x433;&#x456;&#x447;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x447;&#x438; &#x441;&#x43B;&#x456;&#x434; &#x437;&#x447;&#x438;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x44F;&#x43A; &#x43F;&#x440;&#x44F;&#x43C;&#x438;&#x439; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; (<em>&#x43F;&#x440;&#x44F;&#x43C;&#x438;&#x439; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;</em> &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x43C;&#x43E;&#x43B;&#x43E;&#x434;&#x448;&#x438;&#x439; &#x431;&#x430;&#x439;&#x442; &#x454; &#x432; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x457; &#x43D;&#x443;&#x43B;&#x44C;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x431;&#x430;&#x439;&#x442;&#x443;, &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x433;&#x43E;.) &#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; &quot;set&quot; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x442;&#x440;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;: &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x430;&#x439;&#x442;&#x443; &#x437;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x441;&#x43B;&#x456;&#x434; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x438;, &#x456; &#x43D;&#x435;&#x43E;&#x431;&#x43E;&#x432;&apos;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x435; &#x43B;&#x43E;&#x433;&#x456;&#x447;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x447;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x442;&#x438; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x435; &#x434;&#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x44E;&#x447;&#x438;&#x441;&#x44C; &#x43F;&#x440;&#x44F;&#x43C;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;.</p>
<p>&#x425;&#x43E;&#x447;&#x430; &#x44F; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x432; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x44F;&#x43A;&#x456; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437; 8-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;, &#x43E;&#x434;&#x43D;&#x456; &#x456; &#x442;&#x456; &#x436; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; 16-&#x442;&#x438; &#x456; 32-&#x431;&#x456;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;. &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x456;&#x442;&#x44C; <code>8</code> &#x432; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x43C;&#x443; &#x456;&#x43C;&#x435;&#x43D;&#x456; &#x43D;&#x430; <code>16</code> &#x430;&#x431;&#x43E; <code>32</code>. &#x41F;&#x43E;&#x440;&#x44F;&#x434; &#x437; &#x443;&#x441;&#x456;&#x43C;&#x430; &#x446;&#x438;&#x43C;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x446;&#x456;&#x43B;&#x438;&#x445; &#x447;&#x438;&#x441;&#x435;&#x43B;, <code>DataView</code> &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x454; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443; &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x441;&#x435;&#x43B; &#x437; &#x440;&#x443;&#x445;&#x43E;&#x43C;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x43E;&#x44E;:</p>
<ul>
<li><code>getFloat32(byteOffset, littleEndian)</code> - &#x437;&#x447;&#x438;&#x442;&#x443;&#x454; &#x434;&#x430;&#x43D;&#x456; float32, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; <code>byteOffset</code></li>
<li><code>setFloat32(byteOffset, value, littleEndian)</code> - &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x454; &#x434;&#x430;&#x43D;&#x456; float32, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; <code>byteOffset</code></li>
<li><code>getFloat64(byteOffset, littleEndian)</code> - &#x437;&#x447;&#x438;&#x442;&#x443;&#x44E; &#x434;&#x430;&#x43D;&#x456; float64, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; <code>byteOffset</code></li>
<li><code>setFloat64(byteOffset, value, littleEndian)</code> - &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x454; &#x434;&#x430;&#x43D;&#x456; float64, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; <code>byteOffset</code></li>
</ul>
<p>&#x429;&#x43E;&#x431; &#x43F;&#x43E;&#x431;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &quot;set&quot; &#x442;&#x430; &quot;get&quot; &#x432; &#x434;&#x456;&#x457;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435;&#x43C;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> buffer = <span class="hljs-keyword">new</span> <span class="hljs-built_in">ArrayBuffer</span>(<span class="hljs-number">2</span>),
    view = <span class="hljs-keyword">new</span> <span class="hljs-built_in">DataView</span>(buffer);

view.setInt8(<span class="hljs-number">0</span>, <span class="hljs-number">5</span>);
view.setInt8(<span class="hljs-number">1</span>, <span class="hljs-number">-1</span>);

<span class="hljs-built_in">console</span>.log(view.getInt8(<span class="hljs-number">0</span>));       <span class="hljs-comment">// 5</span>
<span class="hljs-built_in">console</span>.log(view.getInt8(<span class="hljs-number">1</span>));       <span class="hljs-comment">// -1</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437; &#x434;&#x432;&#x43E;&#x445; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; &#x434;&#x43B;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x432;&#x43E;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456; int8. &#x41F;&#x435;&#x440;&#x448;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x456; &#x437;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; 0, &#x430; &#x434;&#x440;&#x443;&#x433;&#x435; &#x437;&#x456; &#x437;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; 1, &#x432;&#x43A;&#x430;&#x437;&#x443;&#x44E;&#x447;&#x438;, &#x449;&#x43E; &#x43A;&#x43E;&#x436;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x445;&#x43E;&#x43F;&#x43B;&#x44E;&#x454; &#x43F;&#x43E;&#x432;&#x43D;&#x438;&#x439; &#x431;&#x430;&#x439;&#x442; (8 &#x431;&#x456;&#x442;). &#x426;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x456;&#x437;&#x43D;&#x456;&#x448;&#x435; &#x432;&#x438;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x456; &#x437;&#x456; &#x441;&#x432;&#x43E;&#x457;&#x445; &#x43F;&#x43E;&#x437;&#x438;&#x446;&#x456;&#x439; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>getInt8()</code>. &#x412; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441;, &#x43A;&#x43E;&#x43B;&#x438; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; int8, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x439; &#x437; &#x432;&#x43E;&#x441;&#x44C;&#x43C;&#x438; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x437; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x43C;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438;.</p>
<p>&#x41F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x456;&#x43A;&#x430;&#x432;&#x456; &#x442;&#x438;&#x43C;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x447;&#x438;&#x442;&#x430;&#x442;&#x438; &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456;, &#x432; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x447;&#x430;&#x441;&#x443;, &#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x434;&#x430;&#x43D;&#x456; &#x431;&#x443;&#x43B;&#x438; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x456;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x437;&#x430;&#x43F;&#x438;&#x441; &#x434;&#x432;&#x43E;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; int8 &#x456; &#x437;&#x447;&#x438;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x444;&#x435;&#x440;&#x443; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; int16 &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;, &#x44F;&#x43A; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> buffer = <span class="hljs-keyword">new</span> <span class="hljs-built_in">ArrayBuffer</span>(<span class="hljs-number">2</span>),
    view = <span class="hljs-keyword">new</span> <span class="hljs-built_in">DataView</span>(buffer);

view.setInt8(<span class="hljs-number">0</span>, <span class="hljs-number">5</span>);
view.setInt8(<span class="hljs-number">1</span>, <span class="hljs-number">-1</span>);

<span class="hljs-built_in">console</span>.log(view.getInt16(<span class="hljs-number">0</span>));      <span class="hljs-comment">// 1535</span>
<span class="hljs-built_in">console</span>.log(view.getInt8(<span class="hljs-number">0</span>));       <span class="hljs-comment">// 5</span>
<span class="hljs-built_in">console</span>.log(view.getInt8(<span class="hljs-number">1</span>));       <span class="hljs-comment">// -1</span>
</code></pre>
<p>&#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>view.getInt16(0)</code> &#x437;&#x447;&#x438;&#x442;&#x443;&#x454; &#x432;&#x441;&#x456; &#x431;&#x430;&#x439;&#x442;&#x438; &#x437; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x443;&#x454; &#x446;&#x456; &#x431;&#x430;&#x439;&#x442;&#x438; &#x44F;&#x43A; &#x447;&#x438;&#x441;&#x43B;&#x43E; 1535. &#x414;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438;, &#x447;&#x43E;&#x43C;&#x443; &#x446;&#x435; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43F;&#x43E;&#x434;&#x438;&#x432;&#x456;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x41C;&#x430;&#x43B;&#x44E;&#x43D;&#x43E;&#x43A; 10-1, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x449;&#x43E; &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x440;&#x44F;&#x434;&#x43E;&#x43A; <code>setInt8()</code> &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x432; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;.</p>
<!--![Малюнок 10-1: Буферний масив після виклику двох методів](images/Ch 10 Graphic.jpg)-->
<pre><code>new ArrayBuffer(2)      0000000000000000
view.setInt8(0, 5);     0000010100000000
view.setInt8(1, -1);    0000010111111111
</code></pre><p>&#x411;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; 16 &#x431;&#x456;&#x442;&#x430;&#x43C;&#x438;, &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x437; &#x44F;&#x43A;&#x438;&#x445; &#x440;&#x456;&#x432;&#x43D;&#x438;&#x439; &#x43D;&#x443;&#x43B;&#x44E;. &#x417;&#x430;&#x43F;&#x438;&#x441; <code>5</code> &#x443; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x431;&#x430;&#x439;&#x442; &#x437; <code>setInt8()</code> &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43E;&#x434;&#x438;&#x43D;&#x438;&#x446;&#x44C; (&#x443; 8-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x456;&#x439; &#x440;&#x435;&#x43F;&#x440;&#x435;&#x437;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x457;, 5 &#x2014; &#x446;&#x435; 00000101). &#x417;&#x430;&#x43F;&#x438;&#x441; -1 &#x434;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x431;&#x430;&#x439;&#x442;&#x443; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454; &#x432;&#x441;&#x456; &#x431;&#x456;&#x442;&#x438; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x431;&#x430;&#x439;&#x442;&#x456; &#x443; 1, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x440;&#x435;&#x43F;&#x440;&#x435;&#x437;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x457; -1 &#x432; &#x431;&#x430;&#x439;&#x442;-&#x43A;&#x43E;&#x434;&#x456;. &#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>setInt8()</code> &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; 16 &#x431;&#x456;&#x442;, &#x456; <code>getInt16()</code> &#x437;&#x447;&#x438;&#x442;&#x443;&#x454; &#x446;&#x456; &#x431;&#x456;&#x442;&#x438; &#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x456; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; 16-&#x440;&#x43E;&#x437;&#x440;&#x44F;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x456;&#x43B;&#x43E;&#x433;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x430;, &#x44F;&#x43A;&#x435; &#x43C;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; 1535 &#x432; &#x434;&#x435;&#x441;&#x44F;&#x442;&#x43A;&#x43E;&#x432;&#x456;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x456; &#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x41E;&#x431;&apos;&#x454;&#x43A;&#x442; <code>DataView</code> &#x456;&#x434;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x456;&#x434;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x456;&#x432; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x437;&#x43C;&#x456;&#x448;&#x443;&#x44E;&#x442;&#x44C; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x442;&#x438;&#x43F;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x435; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43E;&#x434;&#x438;&#x43D; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x438;&#x439; &#x442;&#x438;&#x43F; &#x434;&#x430;&#x43D;&#x438;&#x445;, &#x442;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443; &#x454; &#x43A;&#x440;&#x430;&#x449;&#x438;&#x43C; &#x432;&#x438;&#x431;&#x43E;&#x440;&#x43E;&#x43C;.</p>
<h4 id="&#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456;-&#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;-&#x2014;-&#x446;&#x435;-&#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;">&#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x2014; &#x446;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;</h4>
<p>&#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; ECMAScript 6 &#x444;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x454; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x447;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43E; &#x442;&#x438;&#x43F;&#x443; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x443;&#x43D;&#x456;&#x432;&#x435;&#x440;&#x441;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442; <code>DataView</code> &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x438;, &#x44F;&#x43A;&#x456; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x456; &#x442;&#x438;&#x43F;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445;. &#x404; &#x432;&#x456;&#x441;&#x456;&#x43C; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x447;&#x43D;&#x438;&#x445; &#x434;&#x43E; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;, &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E; &#x434;&#x43E; &#x432;&#x43E;&#x441;&#x44C;&#x43C;&#x438; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x434;&#x430;&#x43D;&#x438;&#x445;, &#x43F;&#x43B;&#x44E;&#x441; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x430; &#x43E;&#x43F;&#x446;&#x456;&#x44F; &#x434;&#x43B;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; <code>uint8</code>.</p>
<p>&#x422;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x44F; 10-1 &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x432;&#x430;&#x440;&#x456;&#x430;&#x43D;&#x442; &#x43F;&#x43E;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x443; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x44C; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x447;&#x43D;&#x438;&#x445; &#x434;&#x43E; &#x442;&#x438;&#x43F;&#x443; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x437; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x443; 22.2 &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; ECMAScript 6.</p>
<p><strong>&#x422;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x44F; 10-1: &#x414;&#x435;&#x44F;&#x43A;&#x456; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x447;&#x43D;&#x456; &#x434;&#x43E; &#x442;&#x438;&#x43F;&#x443; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x432; ECMAScript 6</strong></p>
<table>
<thead>
<tr>
<th>&#x406;&#x43C;&#x2019;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430;</th>
<th>&#x420;&#x43E;&#x437;&#x43C;&#x456;&#x440; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; (&#x432; &#x431;&#x430;&#x439;&#x442;&#x430;&#x445;)</th>
<th>&#x41E;&#x43F;&#x438;&#x441;</th>
<th>&#x415;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x439; &#x442;&#x438;&#x43F; &#x432; C</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>Int8Array</code></td>
<td>1</td>
<td>8-&#x431;&#x456;&#x442;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x446;&#x456;&#x43B;&#x43E;&#x433;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;</td>
<td><code>signed char</code></td>
</tr>
<tr>
<td><code>Uint8Array</code></td>
<td>1</td>
<td>8-&#x431;&#x456;&#x442;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x446;&#x456;&#x43B;&#x43E;&#x433;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x431;&#x435;&#x437; &#x437;&#x43D;&#x430;&#x43A;&#x443;</td>
<td><code>unsigned char</code></td>
</tr>
<tr>
<td><code>Uint8ClampedArray</code></td>
<td>1</td>
<td>8-&#x431;&#x456;&#x442;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x446;&#x456;&#x43B;&#x43E;&#x433;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x431;&#x435;&#x437; &#x437;&#x43D;&#x430;&#x43A;&#x443; (&#x441;&#x442;&#x438;&#x441;&#x43B;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;)</td>
<td><code>unsigned char</code></td>
</tr>
<tr>
<td><code>Int16Array</code></td>
<td>2</td>
<td>16-&#x431;&#x456;&#x442;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x446;&#x456;&#x43B;&#x43E;&#x433;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;</td>
<td><code>short</code></td>
</tr>
<tr>
<td><code>Uint16Array</code></td>
<td>2</td>
<td>16-&#x431;&#x456;&#x442;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x446;&#x456;&#x43B;&#x43E;&#x433;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x431;&#x435;&#x437; &#x437;&#x43D;&#x430;&#x43A;&#x443;</td>
<td><code>unsigned short</code></td>
</tr>
<tr>
<td><code>Int32Array</code></td>
<td>4</td>
<td>32-&#x431;&#x456;&#x442;&#x43D;&#x438;&#x439; &#x434;&#x43E;&#x43F;&#x43E;&#x432;&#x43D;&#x44F;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;</td>
<td><code>int</code></td>
</tr>
<tr>
<td><code>Uint32Array</code></td>
<td>4</td>
<td>32-&#x431;&#x456;&#x442;&#x43D;&#x438;&#x439; &#x434;&#x43E;&#x43F;&#x43E;&#x432;&#x43D;&#x44F;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x431;&#x435;&#x437; &#x437;&#x43D;&#x430;&#x43A;&#x443;</td>
<td><code>int</code></td>
</tr>
<tr>
<td><code>Float32Array</code></td>
<td>4</td>
<td>32-&#x431;&#x456;&#x442;&#x43D;&#x435; IEEE &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x437; &#x440;&#x443;&#x445;&#x43E;&#x43C;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x43E;&#x44E;</td>
<td><code>float</code></td>
</tr>
<tr>
<td><code>Float64Array</code></td>
<td>8</td>
<td>64-&#x431;&#x456;&#x442;&#x43D;&#x435; IEEE &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x437; &#x440;&#x443;&#x445;&#x43E;&#x43C;&#x43E;&#x44E; &#x43A;&#x43E;&#x43C;&#x43E;&#x44E;</td>
<td><code>double</code></td>
</tr>
</tbody>
</table>
<p>&#x423; &#x43B;&#x456;&#x432;&#x456;&#x439; &#x43A;&#x43E;&#x43B;&#x43E;&#x43D;&#x446;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x440;&#x430;&#x445;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x438; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x430; &#x440;&#x435;&#x448;&#x442;&#x430; &#x441;&#x442;&#x43E;&#x432;&#x43F;&#x446;&#x456;&#x432; &#x43E;&#x43F;&#x438;&#x441;&#x443;&#x44E;&#x442;&#x44C; &#x434;&#x430;&#x43D;&#x456; &#x44F;&#x43A;&#x456; &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43A;&#x43E;&#x436;&#x43D;&#x438;&#x439; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;.  <code>Uint8ClampedArray</code> &#x442;&#x435; &#x436; &#x441;&#x430;&#x43C;&#x435;, &#x449;&#x43E; &#x439; <code>Uint8Array</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x43C;&#x435;&#x43D;&#x448;&#x435; 0 &#x430;&#x431;&#x43E; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x456;&#x436; 255. <code>Uint8ClampedArray</code> &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x435;&#x43D;&#x448;&#x435; &#x432;&#x456;&#x434; 0 &#x434;&#x43E; 0 (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, -1 &#x441;&#x442;&#x430;&#x454; &#x440;&#x456;&#x432;&#x43D;&#x438;&#x43C; 0) &#x456; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x449;&#x435; &#x43D;&#x456;&#x436; 255 &#x434;&#x43E; 255 (&#x442;&#x430;&#x43A; 300 &#x441;&#x442;&#x430;&#x454; &#x440;&#x456;&#x432;&#x43D;&#x438;&#x43C; 255).</p>
<p>&#x41E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x437; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C; &#x442;&#x438;&#x43F;&#x43E;&#x43C; &#x434;&#x430;&#x43D;&#x438;&#x445;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x432;&#x441;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x437; <code>Int8Array</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>int8</code>. &#x420;&#x43E;&#x437;&#x43C;&#x456;&#x440; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x432; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x438;&#x442;&#x44C; &#x432;&#x456;&#x434; &#x442;&#x438;&#x43F;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x412; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441;, &#x43A;&#x43E;&#x43B;&#x438; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x432; <code>Int8Array</code> &#x43C;&#x430;&#x454; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x443; &#x432; &#x43E;&#x434;&#x438;&#x43D; &#x431;&#x430;&#x439;&#x442;, <code>Float64Array</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x432;&#x456;&#x441;&#x456;&#x43C; &#x431;&#x430;&#x439;&#x442; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;. &#x41D;&#x430; &#x449;&#x430;&#x441;&#x442;&#x44F;, &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x437;&#x434;&#x456;&#x439;&#x441;&#x43D;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x445; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x456;&#x432;, &#x44F;&#x43A; &#x456; &#x432; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x445;, &#x449;&#x43E; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x443;&#x43D;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x43D;&#x435;&#x437;&#x440;&#x443;&#x447;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &quot;set&quot; &#x456; &quot;get&quot; &#x432; <code>DataView</code>.</p>
<h3 id="a-&#x440;&#x43E;&#x437;&#x43C;&#x456;&#x440;-&#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;">A&gt; &#x420;&#x43E;&#x437;&#x43C;&#x456;&#x440; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;</h3>
<p>A&gt; &#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x440;&#x44F;&#x434;&#x443; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;, &#x430; &#x440;&#x43E;&#x437;&#x43C;&#x456;&#x440;&#x43E;&#x43C; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x454; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;, &#x44F;&#x43A;&#x443; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x454; &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;. &#x426;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>BYTES_PER_ELEMENT</code> &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; &#x456; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x440;&#x43D;&#x438;&#x43A;&#x430;, &#x442;&#x430;&#x43A; &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x438;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x43C;&#x456;&#x440; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;:</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(UInt8Array.BYTES_PER_ELEMENT);      <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(UInt16Array.BYTES_PER_ELEMENT);     <span class="hljs-comment">// 2</span>

<span class="hljs-keyword">let</span> ints = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int8Array</span>(<span class="hljs-number">5</span>);
<span class="hljs-built_in">console</span>.log(ints.BYTES_PER_ELEMENT);            <span class="hljs-comment">// 1</span>
</code></pre>
<h4 id="&#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;-&#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x44C;-&#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x447;&#x43D;&#x438;&#x445;-&#x434;&#x43E;-&#x442;&#x438;&#x43F;&#x443;-&#x434;&#x430;&#x43D;&#x438;&#x445;">&#x421;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x44C; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x447;&#x43D;&#x438;&#x445; &#x434;&#x43E; &#x442;&#x438;&#x43F;&#x443; &#x434;&#x430;&#x43D;&#x438;&#x445;</h4>
<p>&#x41A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x438; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;, &#x442;&#x43E;&#x43C;&#x443; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x456;&#x432; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x41F;&#x43E;-&#x43F;&#x435;&#x440;&#x448;&#x435;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x447;&#x438; &#x442;&#x456; &#x436; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;, &#x449;&#x43E; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; <code>DataView</code> (&#x431;&#x443;&#x444;&#x435;&#x440;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x43D;&#x435; &#x43E;&#x431;&#x43E;&#x432;&#x2BC;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x431;&#x430;&#x439;&#x442; &#x437;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F;, &#x442;&#x430; &#x43D;&#x435;&#x43E;&#x431;&#x43E;&#x432;&apos;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x432;&#x436;&#x438;&#x43D;&#x438; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;). &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> buffer = <span class="hljs-keyword">new</span> <span class="hljs-built_in">ArrayBuffer</span>(<span class="hljs-number">10</span>),
    view1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int8Array</span>(buffer),
    view2 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int8Array</span>(buffer, <span class="hljs-number">5</span>, <span class="hljs-number">2</span>);

<span class="hljs-built_in">console</span>.log(view1.buffer === buffer);       <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(view2.buffer === buffer);       <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(view1.byteOffset);              <span class="hljs-comment">// 0</span>
<span class="hljs-built_in">console</span>.log(view2.byteOffset);              <span class="hljs-comment">// 5</span>
<span class="hljs-built_in">console</span>.log(view1.byteLength);              <span class="hljs-comment">// 10</span>
<span class="hljs-built_in">console</span>.log(view2.byteLength);              <span class="hljs-comment">// 2</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; &#x43E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x454; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;&#x43C;&#x438; <code>Int8Array</code>, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; <code>buffer</code>. &#x41E;&#x431;&#x438;&#x434;&#x432;&#x430; <code>view1</code> &#x442;&#x430; <code>view2</code> &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>buffer</code>, <code>byteOffset</code> &#x442;&#x430; <code>byteLength</code>, &#x44F;&#x43A;&#x456; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x442;&#x44C; &#x432; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x430;&#x445; <code>DataView</code>. &#x414;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x442;&#x438; &#x434;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x432;&#x441;&#x44E;&#x434;&#x438;, &#x434;&#x435; &#x432;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x435; <code>DataView</code> &#x434;&#x43E; &#x442;&#x438;&#x445; &#x43F;&#x456;&#x440;, &#x43F;&#x43E;&#x43A;&#x438; &#x432;&#x438; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;&#x442;&#x435; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437; &#x434;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443;.</p>
<p>&#x41F;&#x43E;&#x2013;&#x434;&#x440;&#x443;&#x433;&#x435;, &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x454; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x454;&#x434;&#x438;&#x43D;&#x43E;&#x433;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x443;. &#x426;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x454; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; (&#x43D;&#x435; &#x431;&#x430;&#x439;&#x442;), &#x44F;&#x43A;&#x456; &#x441;&#x43B;&#x456;&#x434; &#x437;&#x430;&#x440;&#x435;&#x437;&#x435;&#x440;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;. &#x41A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x431;&#x443;&#x444;&#x435;&#x440; &#x437; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x44E; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44E; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;, &#x449;&#x43E;&#x431; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x456; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>length</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> ints = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int16Array</span>(<span class="hljs-number">2</span>),
    floats = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Float32Array</span>(<span class="hljs-number">5</span>);

<span class="hljs-built_in">console</span>.log(ints.byteLength);       <span class="hljs-comment">// 4</span>
<span class="hljs-built_in">console</span>.log(ints.length);           <span class="hljs-comment">// 2</span>

<span class="hljs-built_in">console</span>.log(floats.byteLength);     <span class="hljs-comment">// 20</span>
<span class="hljs-built_in">console</span>.log(floats.length);         <span class="hljs-comment">// 5</span>
</code></pre>
<p>&#x41C;&#x430;&#x441;&#x438;&#x432; <code>ints</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x43C;&#x456;&#x441;&#x446;&#x435;&#x43C; &#x434;&#x43B;&#x44F; &#x434;&#x432;&#x43E;&#x445; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;. &#x41A;&#x43E;&#x436;&#x43D;&#x43E;&#x43C;&#x443; 16-&#x431;&#x456;&#x442;&#x43D;&#x43E;&#x43C;&#x443; &#x446;&#x456;&#x43B;&#x43E;&#x43C;&#x443; &#x447;&#x438;&#x441;&#x43B;&#x443; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x434;&#x432;&#x430; &#x431;&#x430;&#x439;&#x442;&#x438; &#x43D;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x442;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x432;&#x438;&#x434;&#x456;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x447;&#x43E;&#x442;&#x438;&#x440;&#x438; &#x431;&#x430;&#x439;&#x442;&#x438;. &#x41C;&#x430;&#x441;&#x438;&#x432; <code>floats</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x439;, &#x449;&#x43E;&#x431; &#x432;&#x43C;&#x456;&#x449;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&apos;&#x44F;&#x442;&#x44C; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x445; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432; 20 (&#x447;&#x43E;&#x442;&#x438;&#x440;&#x438; &#x431;&#x430;&#x439;&#x442;&#x438; &#x43D;&#x430; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;). &#x412; &#x43E;&#x431;&#x43E;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x430;&#x445; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x431;&#x443;&#x444;&#x435;&#x440;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>buffer</code> &#x443; &#x440;&#x430;&#x437;&#x456; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456;.</p>
<p>W&gt; &#x42F;&#x43A;&#x449;&#x43E; &#x434;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x443; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x436;&#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;, &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x434;&#x456;&#x454;, &#x43D;&#x456;&#x431;&#x438; &#x431;&#x443;&#x43B;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43E; <code>0</code>. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x44F;&#x43A;&#x438;&#x439; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x443; &#x431;&#x443;&#x444;&#x435;&#x440;&#x456; &#x431;&#x443;&#x43B;&#x43E; &#x440;&#x43E;&#x437;&#x43C;&#x456;&#x447;&#x435;&#x43D;&#x43E; &#x43D;&#x443;&#x43B;&#x44C; &#x431;&#x430;&#x439;&#x442;&#x456;&#x432;.</p>
<p>&#x41F;&#x43E;&#x2013;&#x442;&#x440;&#x435;&#x442;&#x454;, &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x454; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x43E;&#x431;&#x2BC;&#x454;&#x43A;&#x442;&#x443;, &#x44F;&#x43A; &#x454;&#x434;&#x438;&#x43D;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430;. &#x41E;&#x431;&#x2BC;&#x454;&#x43A;&#x442; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x437; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43D;&#x438;&#x436;&#x447;&#x435;:</p>
<ul>
<li><strong>&#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;</strong> - &#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x432; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x441;&#x442;&#x435; int8 &#x434;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x443; <code>Int16Array</code>, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; int8 &#x431;&#x443;&#x434;&#x435; &#x441;&#x43A;&#x43E;&#x43F;&#x456;&#x439;&#x43E;&#x432;&#x430;&#x43D;&#x435; &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; int16. &#x41D;&#x43E;&#x432;&#x438;&#x439; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x435; &#x456;&#x43D;&#x448;&#x438;&#x439; &#x431;&#x443;&#x444;&#x435;&#x440;, &#x43D;&#x456;&#x436; &#x442;&#x43E;&#x439;, &#x449;&#x43E; &#x431;&#x443;&#x432; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x438;&#x439;.</li>
<li><strong>&#x406;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x435;</strong> - &#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;, &#x449;&#x43E;&#x431; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x447;&#x43B;&#x435;&#x43D;&#x438;, &#x44F;&#x43A;&#x456; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x456; &#x443; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x41A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x442;&#x438; &#x442;&#x438;&#x43F;&#x443; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;.</li>
<li><strong>&#x41C;&#x430;&#x441;&#x438;&#x432;</strong> - &#x415;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x441;&#x43A;&#x43E;&#x43F;&#x456;&#x439;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x434;&#x43E; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x41A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x43C;&#x443; &#x442;&#x438;&#x43F;&#x443;.</li>
<li><strong>&#x41E;&#x431;&#x2BC;&#x454;&#x43A;&#x442;, &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x438;&#x439; &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;</strong> - &#x41F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x44F;&#x43A; &#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;.</li>
</ul>
<p>&#x423; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x43C;&#x443; &#x437; &#x446;&#x438;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x456;&#x432;, &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x434;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x437; &#x432;&#x438;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x443;. &#x426;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x43E; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x43E;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437; &#x434;&#x435;&#x44F;&#x43A;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> ints1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int16Array</span>([<span class="hljs-number">25</span>, <span class="hljs-number">50</span>]),
    ints2 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int32Array</span>(ints1);

<span class="hljs-built_in">console</span>.log(ints1.buffer === ints2.buffer);     <span class="hljs-comment">// false</span>

<span class="hljs-built_in">console</span>.log(ints1.byteLength);      <span class="hljs-comment">// 4</span>
<span class="hljs-built_in">console</span>.log(ints1.length);          <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(ints1[<span class="hljs-number">0</span>]);              <span class="hljs-comment">// 25</span>
<span class="hljs-built_in">console</span>.log(ints1[<span class="hljs-number">1</span>]);              <span class="hljs-comment">// 50</span>

<span class="hljs-built_in">console</span>.log(ints2.byteLength);      <span class="hljs-comment">// 8</span>
<span class="hljs-built_in">console</span>.log(ints2.length);          <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(ints2[<span class="hljs-number">0</span>]);              <span class="hljs-comment">// 25</span>
<span class="hljs-built_in">console</span>.log(ints2[<span class="hljs-number">1</span>]);              <span class="hljs-comment">// 50</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x43C;&#x43E; <code>Int16Array</code> &#x442;&#x430; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x454;&#x43C;&#x43E; &#x439;&#x43E;&#x433;&#x43E; &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C; &#x437; &#x434;&#x432;&#x43E;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;. &#x41F;&#x43E;&#x442;&#x456;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>Int32Array</code>, &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>Int16Array</code>. &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; 25 &#x456; 50 &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437; <code>ints1</code> &#x434;&#x43E; <code>ints2</code>, &#x442;&#x43E;&#x43C;&#x443; &#x434;&#x432;&#x430; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x430;&#x431;&#x441;&#x43E;&#x43B;&#x44E;&#x442;&#x43D;&#x43E; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x456; &#x431;&#x443;&#x444;&#x435;&#x440;&#x438;. &#x41E;&#x434;&#x43D;&#x456; &#x456; &#x442;&#x456; &#x436; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x456; &#x432; &#x43E;&#x431;&#x43E;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x445;, &#x430;&#x43B;&#x435; <code>ints2</code> &#x43C;&#x430;&#x454; &#x432;&#x456;&#x441;&#x456;&#x43C; &#x431;&#x430;&#x439;&#x442; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441;, &#x43A;&#x43E;&#x43B;&#x438; <code>ints1</code> &#x43C;&#x430;&#x454; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x447;&#x43E;&#x442;&#x438;&#x440;&#x438;.</p>
<h2 id="&#x441;&#x43F;&#x456;&#x43B;&#x44C;&#x43D;&#x456;-&#x440;&#x438;&#x441;&#x438;-&#x443;-&#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445;-&#x442;&#x430;-&#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x445;-&#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;">&#x421;&#x43F;&#x456;&#x43B;&#x44C;&#x43D;&#x456; &#x440;&#x438;&#x441;&#x438; &#x443; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x442;&#x430; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;</h2>
<p>&#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x442;&#x430; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x441;&#x43F;&#x456;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x440;&#x438;&#x441;, &#x456;, &#x44F;&#x43A; &#x432;&#x438; &#x432;&#x436;&#x435; &#x431;&#x430;&#x447;&#x438;&#x43B;&#x438; &#x432; &#x446;&#x456;&#x439; &#x433;&#x43B;&#x430;&#x432;&#x456;, &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x456; &#x44F;&#x43A; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x443; &#x431;&#x430;&#x433;&#x430;&#x442;&#x44C;&#x43E;&#x445; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x456;&#x44F;&#x445;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x442;&#x438;, &#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>length</code>, &#x456; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x456;&#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x446;&#x438;&#x444;&#x440;&#x43E;&#x432;&#x438;&#x445; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x456;&#x432;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> ints = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int16Array</span>([<span class="hljs-number">25</span>, <span class="hljs-number">50</span>]);

<span class="hljs-built_in">console</span>.log(ints.length);          <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(ints[<span class="hljs-number">0</span>]);              <span class="hljs-comment">// 25</span>
<span class="hljs-built_in">console</span>.log(ints[<span class="hljs-number">1</span>]);              <span class="hljs-comment">// 50</span>

ints[<span class="hljs-number">0</span>] = <span class="hljs-number">1</span>;
ints[<span class="hljs-number">1</span>] = <span class="hljs-number">2</span>;

<span class="hljs-built_in">console</span>.log(ints[<span class="hljs-number">0</span>]);              <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(ints[<span class="hljs-number">1</span>]);              <span class="hljs-comment">// 2</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x43E;&#x432;&#x438;&#x439; <code>Int16Array</code> &#x437; &#x434;&#x432;&#x43E;&#x43C;&#x430; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;. &#x415;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x437;&#x447;&#x438;&#x442;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x456; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x457;&#x445; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x445; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x456;&#x432;, &#x456; &#x446;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x456; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x432; int16 &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x43D;&#x430; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x441;&#x445;&#x43E;&#x436;&#x456;&#x441;&#x442;&#x44C; &#x43D;&#x435; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F;.</p>
<p>I&gt; &#x41D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;, &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x43C;&#x456;&#x440; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>length</code>. &#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>length</code> &#x43D;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x443;, &#x442;&#x430;&#x43A; &#x449;&#x43E; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x430; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x457;&#x457; &#x456;&#x433;&#x43D;&#x43E;&#x440;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43D;&#x435;&#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x456; &#x432;&#x438;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x432; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443;.</p>
<h3 id="&#x431;&#x430;&#x437;&#x43E;&#x432;&#x456;-&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;">&#x411;&#x430;&#x437;&#x43E;&#x432;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;</h3>
<p>&#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x442;&#x44C; &#x432; &#x441;&#x435;&#x431;&#x435; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x456; &#x434;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x443; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;:</p>
<ul>
<li><code>copyWithin()</code></li>
<li><code>entries()</code></li>
<li><code>fill()</code></li>
<li><code>filter()</code></li>
<li><code>find()</code></li>
<li><code>findIndex()</code></li>
<li><code>forEach()</code></li>
<li><code>indexOf()</code></li>
<li><code>join()</code></li>
<li><code>keys()</code></li>
<li><code>lastIndexOf()</code></li>
<li><code>map()</code></li>
<li><code>reduce()</code></li>
<li><code>reduceRight()</code></li>
<li><code>reverse()</code></li>
<li><code>slice()</code></li>
<li><code>some()</code></li>
<li><code>sort()</code></li>
<li><code>values()</code></li>
</ul>
<p>&#x41C;&#x430;&#x439;&#x442;&#x435; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;, &#x449;&#x43E; &#x445;&#x43E;&#x447;&#x430; &#x446;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x439; &#x434;&#x456;&#x44E;&#x442;&#x44C; &#x44F;&#x43A; &#x456; &#x457;&#x445; &#x430;&#x43D;&#x430;&#x43B;&#x43E;&#x433;&#x438; &#x43D;&#x430; <code>Array.prototype</code>, &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x456;. &#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x43A;&#x438; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x443; &#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43E; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; (&#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E; &#x434;&#x43E; <code>Symbol.species</code>). &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x449;&#x43E;&#x431; &#x43F;&#x440;&#x43E;&#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x432;&#x430;&#x442;&#x438; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x446;&#x44E;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> ints = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int16Array</span>([<span class="hljs-number">25</span>, <span class="hljs-number">50</span>]),
    mapped = ints.map(v =&gt; v * <span class="hljs-number">2</span>);

<span class="hljs-built_in">console</span>.log(mapped.length);        <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(mapped[<span class="hljs-number">0</span>]);            <span class="hljs-comment">// 50</span>
<span class="hljs-built_in">console</span>.log(mapped[<span class="hljs-number">1</span>]);            <span class="hljs-comment">// 100</span>

<span class="hljs-built_in">console</span>.log(mapped <span class="hljs-keyword">instanceof</span> <span class="hljs-built_in">Int16Array</span>);  <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>map()</code>, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x432; <code>ints</code>. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43C;&#x430;&#x43F;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x434;&#x432;&#x43E;&#x44E;&#x454; &#x43A;&#x43E;&#x436;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x456; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43D;&#x43E;&#x432;&#x438;&#x439; <code>Int16Array</code>.</p>
<h3 id="&#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x456;-&#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;">&#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x456; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;</h3>
<p>&#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x442;&#x456; &#x436; &#x442;&#x440;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;, &#x449;&#x43E; &#x439; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;. &#x426;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>entries()</code>, &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>keys()</code> &#x442;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>values()</code>. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; <code>for-of</code> &#x446;&#x438;&#x43A;&#x43B;&#x438; &#x437; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x43F;&#x440;&#x438; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x456; &#x437;&#x456; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x43C;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> ints = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int16Array</span>([<span class="hljs-number">25</span>, <span class="hljs-number">50</span>]),
    intsArray = [...ints];

<span class="hljs-built_in">console</span>.log(intsArray <span class="hljs-keyword">instanceof</span> <span class="hljs-built_in">Array</span>);    <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(intsArray[<span class="hljs-number">0</span>]);                  <span class="hljs-comment">// 25</span>
<span class="hljs-built_in">console</span>.log(intsArray[<span class="hljs-number">1</span>]);                  <span class="hljs-comment">// 50</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437; &#x456;&#x43C;&apos;&#x44F;&#x43C; <code>intsArray</code>, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x442;&#x456; &#x441;&#x430;&#x43C;&#x456; &#x434;&#x430;&#x43D;&#x456;, &#x449;&#x43E; &#x456; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; <code>ints</code>. &#x42F;&#x43A; &#x456; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x43C;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x43C;&#x438;, &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x43B;&#x435;&#x433;&#x43A;&#x43E;&#x44E; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x456;&#x44E; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x443; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456;.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;-of-&#x442;&#x430;-from">&#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; of() &#x442;&#x430; from()</h3>
<p>&#x406; &#x43D;&#x430;&#x440;&#x435;&#x448;&#x442;&#x456;, &#x432;&#x441;&#x456; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>of()</code> &#x442;&#x430; <code>from()</code>, &#x44F;&#x43A;&#x456; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x44F;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>Array.of()</code> &#x442;&#x430; <code>Array.from()</code>. &#x420;&#x456;&#x437;&#x43D;&#x438;&#x446;&#x44F; &#x43F;&#x43E;&#x43B;&#x44F;&#x433;&#x430;&#x454; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x44E;&#x442;&#x44C; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x41E;&#x441;&#x44C; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438;, &#x44F;&#x43A;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x446;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> ints = <span class="hljs-built_in">Int16Array</span>.of(<span class="hljs-number">25</span>, <span class="hljs-number">50</span>),
    floats = <span class="hljs-built_in">Float32Array</span>.from([<span class="hljs-number">1.5</span>, <span class="hljs-number">2.5</span>]);

<span class="hljs-built_in">console</span>.log(ints <span class="hljs-keyword">instanceof</span> <span class="hljs-built_in">Int16Array</span>);        <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(floats <span class="hljs-keyword">instanceof</span> <span class="hljs-built_in">Float32Array</span>);    <span class="hljs-comment">// true</span>

<span class="hljs-built_in">console</span>.log(ints.length);       <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(ints[<span class="hljs-number">0</span>]);           <span class="hljs-comment">// 25</span>
<span class="hljs-built_in">console</span>.log(ints[<span class="hljs-number">1</span>]);           <span class="hljs-comment">// 50</span>

<span class="hljs-built_in">console</span>.log(floats.length);     <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(floats[<span class="hljs-number">0</span>]);         <span class="hljs-comment">// 1.5</span>
<span class="hljs-built_in">console</span>.log(floats[<span class="hljs-number">1</span>]);         <span class="hljs-comment">// 2.5</span>
</code></pre>
<p>&#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>of()</code> &#x442;&#x430; <code>from()</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F;, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; <code>Int16Array</code> &#x442;&#x430; <code>Float32Array</code>, &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;. &#x426;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;, &#x449;&#x43E; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x456; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x43B;&#x435;&#x433;&#x43A;&#x43E;, &#x44F;&#x43A; &#x456; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;.</p>
<h2 id="&#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x456;-&#x43C;&#x456;&#x436;-&#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438;-&#x442;&#x430;-&#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x43C;&#x438;-&#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438;">&#x412;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x456;&#x436; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x442;&#x430; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x43C;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438;</h2>
<p>&#x41D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x430; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x446;&#x44F; &#x43C;&#x456;&#x436; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x442;&#x430; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x43C;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438; &#x43F;&#x43E;&#x43B;&#x44F;&#x433;&#x430;&#x454; &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43D;&#x435; &#x454; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x43C;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438;. &#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43D;&#x435; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; <code>Array</code>, &#x442;&#x43E;&#x43C;&#x443; <code>Array.isArray()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>false</code> &#x43F;&#x440;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x456; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> ints = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int16Array</span>([<span class="hljs-number">25</span>, <span class="hljs-number">50</span>]);

<span class="hljs-built_in">console</span>.log(ints <span class="hljs-keyword">instanceof</span> <span class="hljs-built_in">Array</span>);     <span class="hljs-comment">// false</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Array</span>.isArray(ints));       <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>ints</code> &#x454; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C;, &#x432;&#x43E;&#x43D;&#x430; &#x43D;&#x435; &#x454; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x43C; <code>Array</code> &#x456; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x44F;&#x43A; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x426;&#x44F; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x430;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x456; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x454; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x43C;&#x438;, &#x456;&#x441;&#x43D;&#x443;&#x454; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x456;&#x432;, &#x432; &#x44F;&#x43A;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;-&#x440;&#x456;&#x437;&#x43D;&#x43E;&#x43C;&#x443;.</p>
<h3 id="&#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x456;-&#x443;-&#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x446;&#x456;">&#x412;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x446;&#x456;</h3>
<p>&#x422;&#x43E;&#x434;&#x456;, &#x44F;&#x43A; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x437;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x456; &#x437;&#x43C;&#x435;&#x43D;&#x448;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x434;&#x456;&#x454;&#x442;&#x435; &#x437; &#x43D;&#x438;&#x43C;&#x438;, &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x43E;&#x433;&#x43E; &#x436; &#x440;&#x43E;&#x437;&#x43C;&#x456;&#x440;&#x443;. &#x412;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x43B;&#x430;&#x441;&#x43D;&#x438;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435;&#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x43E;&#x43C;&#x443; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; &#x443; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;, &#x44F;&#x43A; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x443; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E;&#x43C;&#x443;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x456;&#x433;&#x43D;&#x43E;&#x440;&#x443;&#x44E;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44E;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> ints = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int16Array</span>([<span class="hljs-number">25</span>, <span class="hljs-number">50</span>]);

<span class="hljs-built_in">console</span>.log(ints.length);          <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(ints[<span class="hljs-number">0</span>]);              <span class="hljs-comment">// 25</span>
<span class="hljs-built_in">console</span>.log(ints[<span class="hljs-number">1</span>]);              <span class="hljs-comment">// 50</span>

ints[<span class="hljs-number">2</span>] = <span class="hljs-number">5</span>;

<span class="hljs-built_in">console</span>.log(ints.length);          <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(ints[<span class="hljs-number">2</span>]);              <span class="hljs-comment">// undefined</span>
</code></pre>
<p>&#x41D;&#x435; &#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x43D;&#x44F; <code>5</code> &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x43E;&#x43C;&#x443; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; <code>2</code> &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x43C;&#x430;&#x441;&#x438;&#x432; <code>ints</code> &#x43D;&#x435; &#x437;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;. &#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>length</code> &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x44E;, &#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x43A;&#x438;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;.</p>
<p>&#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x443;, &#x449;&#x43E;&#x431; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44F;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x456; &#x442;&#x438;&#x43F;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445;. &#x41D;&#x443;&#x43B;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x445; &#x43D;&#x435;&#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x434;&#x430;&#x43D;&#x438;&#x445;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> ints = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int16Array</span>([<span class="hljs-string">&quot;hi&quot;</span>]);

<span class="hljs-built_in">console</span>.log(ints.length);       <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(ints[<span class="hljs-number">0</span>]);           <span class="hljs-comment">// 0</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43D;&#x430;&#x43C;&#x430;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;hi&quot;</code> &#x432; <code>Int16Array</code>. &#x417;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E;, &#x440;&#x44F;&#x434;&#x43A;&#x438; &#x454; &#x43D;&#x435;&#x43F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x438;&#x43C;&#x438; &#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x432; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x445;, &#x442;&#x43E;&#x43C;&#x443;  &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>0</code>. &#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>length</code> &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x440;&#x456;&#x432;&#x43D;&#x430; &#x43E;&#x434;&#x438;&#x43D;&#x438;&#x446;&#x456;, &#x456; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x43D;&#x435; &#x434;&#x438;&#x432;&#x43B;&#x44F;&#x447;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x441;&#x43B;&#x43E;&#x442; <code>ints[0]</code> &#x456;&#x441;&#x43D;&#x443;&#x454;, &#x432;&#x456;&#x43D; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>0</code>.</p>
<p>&#x412;&#x441;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x44F;&#x43A;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x44E;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x456; &#x439; &#x442;&#x456; &#x436; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x44F;&#x43A;&#x449;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43D;&#x430;&#x434;&#x430;&#x43D;&#x430; &#x434;&#x43E; <code>map()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43D;&#x435;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x435; &#x434;&#x43B;&#x44F; &#x442;&#x438;&#x43F;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x442;&#x43E; &#x43D;&#x430;&#x442;&#x43E;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>0</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> ints = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int16Array</span>([<span class="hljs-number">25</span>, <span class="hljs-number">50</span>]),
    mapped = ints.map(v =&gt; <span class="hljs-string">&quot;hi&quot;</span>);

<span class="hljs-built_in">console</span>.log(mapped.length);        <span class="hljs-comment">// 2</span>
<span class="hljs-built_in">console</span>.log(mapped[<span class="hljs-number">0</span>]);            <span class="hljs-comment">// 0</span>
<span class="hljs-built_in">console</span>.log(mapped[<span class="hljs-number">1</span>]);            <span class="hljs-comment">// 0</span>

<span class="hljs-built_in">console</span>.log(mapped <span class="hljs-keyword">instanceof</span> <span class="hljs-built_in">Int16Array</span>);  <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(mapped <span class="hljs-keyword">instanceof</span> <span class="hljs-built_in">Array</span>);       <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x440;&#x44F;&#x434;&#x43A;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;hi&quot;</code> &#x43D;&#x435; 16-&#x431;&#x456;&#x442;&#x43E;&#x432;&#x435; &#x446;&#x456;&#x43B;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;, &#x432;&#x43E;&#x43D;&#x43E; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; <code>0</code> &#x432; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;. &#x417;&#x430;&#x432;&#x434;&#x44F;&#x43A;&#x438; &#x446;&#x456;&#x439; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x446;&#x456; &#x437; &#x432;&#x438;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;, &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x43D;&#x435; &#x434;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x443;&#x440;&#x431;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x43F;&#x440;&#x43E; &#x43A;&#x438;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A; &#x43F;&#x440;&#x438; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x456; &#x43D;&#x435;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x434;&#x430;&#x43D;&#x438;&#x445;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43D;&#x435;&#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x445; &#x434;&#x430;&#x43D;&#x438;&#x445;.</p>
<h3 id="&#x432;&#x456;&#x434;&#x441;&#x443;&#x442;&#x43D;&#x456;-&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;">&#x412;&#x456;&#x434;&#x441;&#x443;&#x442;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;</h3>
<p>&#x423; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x43E; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x442;&#x438;&#x445; &#x436;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;, &#x449;&#x43E; &#x456; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;, &#x432;&#x441;&#x435; &#x436; &#x442;&#x430;&#x43A;&#x438; &#x457;&#x43C; &#x43D;&#x435; &#x432;&#x438;&#x441;&#x442;&#x430;&#x447;&#x430;&#x454; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x41D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43D;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;:</p>
<ul>
<li><code>concat()</code></li>
<li><code>pop()</code></li>
<li><code>push()</code></li>
<li><code>shift()</code></li>
<li><code>splice()</code></li>
<li><code>unshift()</code></li>
</ul>
<p>&#x417;&#x430; &#x432;&#x438;&#x43D;&#x44F;&#x442;&#x43A;&#x43E;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>concat()</code>, &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x443; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x43C;&#x456;&#x440; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x43C;&#x456;&#x440;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>concat()</code> &#x43D;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43A;&#x43E;&#x43D;&#x43A;&#x430;&#x442;&#x435;&#x43D;&#x430;&#x446;&#x456;&#x457; &#x434;&#x432;&#x43E;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; (&#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x43E;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x441;&#x43F;&#x440;&#x430;&#x432;&#x443; &#x437; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x43C;&#x438; &#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438; &#x434;&#x430;&#x43D;&#x438;&#x445;) &#x431;&#x443;&#x434;&#x435; &#x43D;&#x435;&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x43C;, &#x456; &#x446;&#x435;, &#x432; &#x43F;&#x435;&#x440;&#x448;&#x443; &#x447;&#x435;&#x440;&#x433;&#x443;, &#x431;&#x443;&#x434;&#x435; &#x441;&#x443;&#x43F;&#x435;&#x440;&#x435;&#x447;&#x438;&#x442;&#x438; &#x441;&#x435;&#x43D;&#x441;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;.</p>
<h3 id="&#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456;-&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;">&#x414;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;</h3>
<p>&#x41D;&#x430;&#x440;&#x435;&#x448;&#x442;&#x456;, &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x434;&#x432;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;, &#x44F;&#x43A;&#x438;&#x445; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x443; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x445;: <code>set()</code> &#x442;&#x430; <code>subarray()</code>. &#x426;&#x456; &#x434;&#x432;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x454; &#x43F;&#x440;&#x43E;&#x442;&#x438;&#x43B;&#x435;&#x436;&#x43D;&#x438;&#x43C;&#x438; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; <code>set()</code> &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x454; &#x456;&#x43D;&#x448;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432; &#x432; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x438;&#x439; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; <code>subarray()</code> &#x432;&#x438;&#x442;&#x44F;&#x433;&#x443;&#x454; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x432; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;.</p>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>set()</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x43C;&#x430;&#x441;&#x438;&#x432; (&#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x447;&#x438; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x439;) &#x456; &#x43D;&#x435;&#x43E;&#x431;&#x43E;&#x432;&#x2BC;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x2014; &#x437;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x438; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; (&#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x435; &#x43D;&#x456;&#x447;&#x43E;&#x433;&#x43E;, &#x437;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454; 0). &#x414;&#x430;&#x43D;&#x456; &#x437; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x446;&#x456;&#x43B;&#x44C;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x443;&#x44E;&#x447;&#x438; &#x43F;&#x440;&#x438; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x434;&#x430;&#x43D;&#x438;&#x445;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> ints = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int16Array</span>(<span class="hljs-number">4</span>);

ints.set([<span class="hljs-number">25</span>, <span class="hljs-number">50</span>]);
ints.set([<span class="hljs-number">75</span>, <span class="hljs-number">100</span>], <span class="hljs-number">2</span>);

<span class="hljs-built_in">console</span>.log(ints.toString());   <span class="hljs-comment">// 25,50,75,100</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; <code>Int16Array</code> &#x437; &#x447;&#x43E;&#x442;&#x438;&#x440;&#x43C;&#x430; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>set()</code> &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x454; &#x434;&#x432;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x43C;&#x443; &#x456; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x43C;&#x443; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x414;&#x440;&#x443;&#x433;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>set()</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x437;&#x441;&#x443;&#x432; <code>2</code>, &#x449;&#x43E;&#x431; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x456;&#x449;&#x435;&#x43D;&#x456; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; &#x442;&#x440;&#x435;&#x442;&#x44C;&#x43E;&#x433;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;.</p>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>subarray()</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x43D;&#x435;&#x43E;&#x431;&#x43E;&#x432;&apos;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x456; &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x438;&#x439; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441; (&#x43A;&#x456;&#x43D;&#x435;&#x446;&#x44C; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; &#x454; &#x432;&#x438;&#x43D;&#x44F;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x43C;, &#x44F;&#x43A; &#x432; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456; <code>slice()</code>) &#x456; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x430;&#x441;&#x438;&#x432;. &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x438; &#x43E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43A;&#x43B;&#x43E;&#x43D; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> ints = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Int16Array</span>([<span class="hljs-number">25</span>, <span class="hljs-number">50</span>, <span class="hljs-number">75</span>, <span class="hljs-number">100</span>]),
    subints1 = ints.subarray(),
    subints2 = ints.subarray(<span class="hljs-number">2</span>),
    subints3 = ints.subarray(<span class="hljs-number">1</span>, <span class="hljs-number">3</span>);

<span class="hljs-built_in">console</span>.log(subints1.toString());   <span class="hljs-comment">// 25,50,75,100</span>
<span class="hljs-built_in">console</span>.log(subints2.toString());   <span class="hljs-comment">// 75,100</span>
<span class="hljs-built_in">console</span>.log(subints3.toString());   <span class="hljs-comment">// 50,75</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x437; &#x43E;&#x440;&#x438;&#x433;&#x456;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; <code>ints</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x440;&#x438; &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;. &#x41C;&#x430;&#x441;&#x438;&#x432; <code>subints1</code> &#x44F;&#x432;&#x43B;&#x44F;&#x454; &#x441;&#x43E;&#x431;&#x43E;&#x44E; &#x43A;&#x43B;&#x43E;&#x43D; <code>ints</code>, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x442;&#x443; &#x436; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432; <code>subints2</code> &#x43A;&#x43E;&#x43F;&#x456;&#x44E;&#x454; &#x434;&#x430;&#x43D;&#x456;, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; 2, &#x432;&#x456;&#x43D; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x434;&#x432;&#x430; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; <code>ints</code> (75 &#x442;&#x430; 100). &#x41C;&#x430;&#x441;&#x438;&#x432; <code>subints3</code> &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x432;&#x430; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; <code>ints</code>, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>subarray()</code> &#x431;&#x443;&#x432; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x438;&#x439; &#x44F;&#x43A; &#x437; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x43C; &#x442;&#x430;&#x43A; &#x456;  &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x438;&#x43C; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x430;&#x43C;&#x438;.</p>
<h2 id="&#x43F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;">&#x41F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;</h2>
<p>ECMAScript 6 &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443; ECMAScript 5, &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x447;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43C;. &#x404; &#x449;&#x435; &#x434;&#x432;&#x430; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;: &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>Array.of()</code> &#x442;&#x430; <code>Array.from()</code>. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Array.from()</code> &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x456; &#x456; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x456; &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x438; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;. &#x41E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x43C;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x430;&#x43C;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.species</code>, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438;, &#x44F;&#x43A;&#x438;&#x439; &#x442;&#x438;&#x43F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43E; (&#x456;&#x43D;&#x448;&#x456; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; <code>Symbol.species</code> &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;).</p>
<p>&#x404; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43D;&#x43E;&#x432;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>fill()</code> &#x442;&#x430; <code>copyWithin()</code> &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443; &#x43D;&#x430; &#x43C;&#x456;&#x441;&#x446;&#x456;. &#x41C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>find()</code> &#x442;&#x430; <code>findIndex()</code> &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x432; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C; &#x43A;&#x440;&#x438;&#x442;&#x435;&#x440;&#x456;&#x44F;&#x43C;. &#x41E;&#x434;&#x438;&#x43D; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x43A;&#x440;&#x438;&#x442;&#x435;&#x440;&#x456;&#x44F;&#x43C;, &#x430; &#x456;&#x43D;&#x448;&#x438;&#x439; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;.</p>
<p>&#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x442;&#x435;&#x445;&#x43D;&#x456;&#x447;&#x43D;&#x43E; &#x43D;&#x435; &#x454; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x43C;&#x438;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; <code>Array</code>, &#x430;&#x43B;&#x435; &#x437;&#x430; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x43E;&#x43C; &#x456; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x43E;&#x44E; &#x432;&#x43E;&#x43D;&#x438; &#x434;&#x443;&#x436;&#x435; &#x441;&#x445;&#x43E;&#x436;&#x456; &#x434;&#x43E; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432;. &#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C; &#x43E;&#x434;&#x438;&#x43D; &#x437; &#x432;&#x43E;&#x441;&#x44C;&#x43C;&#x438; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x445; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x456; &#x43F;&#x43E;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43D;&#x430; &#x43E;&#x431;&#x2BC;&#x454;&#x43A;&#x442;&#x430;&#x445; <code>ArrayBuffer</code>, &#x44F;&#x43A;&#x456; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x431;&#x456;&#x442;&#x43E;&#x432;&#x456; &#x434;&#x430;&#x43D;&#x456; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x430;&#x431;&#x43E; &#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x447;&#x438;&#x441;&#x435;&#x43B;. &#x422;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438; &#x454; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x435;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x431;&#x456;&#x442;&#x43E;&#x432;&#x443; &#x430;&#x440;&#x438;&#x444;&#x43C;&#x435;&#x442;&#x438;&#x43A;&#x443;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x456;&#x436; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x430;&#x43C;&#x438;, &#x44F;&#x43A; &#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x43C; &#x442;&#x438;&#x43F;&#x43E;&#x43C; &#x443; JavaScript.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="09-Classes.html" class="navigation navigation-prev " aria-label="Previous page: Глава 9: Знайомство з класами у JavaScript">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="11-Promises.html" class="navigation navigation-next " aria-label="Next page: Глава 11: Проміси та асинхронне програмування">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Глава 10: Покращені можливості масивів","level":"1.12","depth":1,"next":{"title":"Глава 11: Проміси та асинхронне програмування","level":"1.13","depth":1,"path":"manuscript/11-Promises.md","ref":"manuscript/11-Promises.md","articles":[]},"previous":{"title":"Глава 9: Знайомство з класами у JavaScript","level":"1.11","depth":1,"path":"manuscript/09-Classes.md","ref":"manuscript/09-Classes.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","yametrika","ga","rss","github-buttons"],"pluginsConfig":{"yametrika":{},"github":{"url":"https://github.com/LambdaBooks/understandinges6ua"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Рoзуміння ECMAScript 6","description":"Український переклад книги «Understanding ES6».","author":"Denys Dovhan","site_url":"http://understandinges6.denysdovhan.com/","feed_url":"http://understandinges6.denysdovhan.com/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"github-buttons":{"repo":"LambdaBooks/understandinges6ua","types":["star"],"size":"small"},"ga":{"configuration":"auto","token":"UA-40496885-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/LambdaBooks/understandinges6ua/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"manuscript/10-Arrays.md","mtime":"2017-02-02T14:55:03.230Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-02-02T14:56:44.297Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-yametrika/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

