
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Глава 11: Проміси та асинхронне програмування · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="12-Proxies-and-Reflection.html" />
    
    
    <link rel="prev" href="10-Arrays.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"denysdovhan/understandinges6ua","types":["star"],"size":"small"};
    </script>

    <link href="http://understandinges6.denysdovhan.com/rss.xml" title="Рoзуміння ECMAScript 6" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Рoзуміння ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-Block-Bindings.html">
            
                <a href="01-Block-Bindings.html">
            
                    
                    Глава 1: Блочне зв’язування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02-Strings-and-Regular-Expressions.html">
            
                <a href="02-Strings-and-Regular-Expressions.html">
            
                    
                    Глава 2: Рядки та регулярні вирази
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03-Functions.html">
            
                <a href="03-Functions.html">
            
                    
                    Глава 3: Функції
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="04-Objects.html">
            
                <a href="04-Objects.html">
            
                    
                    Глава 4: Розширена функціональність об’єктів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="05-Destructuring.html">
            
                <a href="05-Destructuring.html">
            
                    
                    Глава 5: Деструктурування для легшого доступу до даних
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="06-Symbols.html">
            
                <a href="06-Symbols.html">
            
                    
                    Глава 6: Символи та їх властивості
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="07-Sets-And-Maps.html">
            
                <a href="07-Sets-And-Maps.html">
            
                    
                    Глава 7: Множини та мапи
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="08-Iterators-And-Generators.html">
            
                <a href="08-Iterators-And-Generators.html">
            
                    
                    Глава 8: Ітератори та генератори
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="09-Classes.html">
            
                <a href="09-Classes.html">
            
                    
                    Глава 9: Знайомство з класами у JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10-Arrays.html">
            
                <a href="10-Arrays.html">
            
                    
                    Глава 10: Покращені можливості масивів
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.13" data-path="11-Promises.html">
            
                <a href="11-Promises.html">
            
                    
                    Глава 11: Проміси та асинхронне програмування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12-Proxies-and-Reflection.html">
            
                <a href="12-Proxies-and-Reflection.html">
            
                    
                    Глава 12: Проксі та АРІ рефлексії
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13-Modules.html">
            
                <a href="13-Modules.html">
            
                    
                    Глава 13: Інкапсуляція коду через модулі
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" >
            
                <span>
            
                    
                    Додаток А: Дрібніші зміни у ECMAScript 6
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" >
            
                <span>
            
                    
                    Додаток Б: Розуміння ECMAScript 7 (2016)
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Глава 11: Проміси та асинхронне програмування</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438;-&#x442;&#x430;-&#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x435;-&#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;">&#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x442;&#x430; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</h1>
<p>&#x41E;&#x434;&#x43D;&#x438;&#x43C; &#x437; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x438;&#x445; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x456;&#x432; JavaScript &#x454; &#x442;&#x435;, &#x44F;&#x43A; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x432;&#x456;&#x43D; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x437; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x43C; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x42F;&#x43A; &#x43C;&#x43E;&#x432;&#x430;, &#x44F;&#x43A;&#x430; &#x431;&#x443;&#x43B;&#x430; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x430; &#x434;&#x43B;&#x44F; Web, JavaScript &#x432;&#x456;&#x434; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x432;&#x430;&#x432; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x442;&#x438; &#x43D;&#x430; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x456; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x434;&#x456;&#x457; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x456;&#x432;, &#x44F;&#x43A; &#x43E;&#x442; &#x43A;&#x43B;&#x456;&#x43A;&#x438; &#x442;&#x430; &#x43D;&#x430;&#x442;&#x438;&#x441;&#x43A;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x432;&#x456;&#x448;. Node.js &#x449;&#x435; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x438;&#x437;&#x443;&#x432;&#x430;&#x432; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x443; JavaScript &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x438; &#x43F;&#x43E;&#x434;&#x456;&#x44F;&#x43C;. &#x417; &#x442;&#x438;&#x43C;, &#x44F;&#x43A; &#x432;&#x441;&#x435; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x456; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x43F;&#x43E;&#x434;&#x456;&#x457; &#x442;&#x430; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x454; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43D;&#x44C;&#x43E; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x438; &#x432;&#x441;&#x44C;&#x43E;&#x433;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x445;&#x43E;&#x447;&#x443;&#x442;&#x44C; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438;. <em>&#x41F;&#x440;&#x43E;&#x301;&#x43C;&#x456;&#x441;&#x438; (Promises)</em> &#x454; &#x432;&#x438;&#x440;&#x456;&#x448;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x446;&#x456;&#x454;&#x457; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438;.</p>
<p>&#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x454; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x43C; &#x437;&#x430;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x456; &#x432;&#x43E;&#x43D;&#x438; &#x441;&#x445;&#x43E;&#x436;&#x456; &#x443; &#x441;&#x432;&#x43E;&#x457;&#x439; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x456; &#x43D;&#x430; &#x444;&#x2019;&#x44E;&#x447;&#x435;&#x440;&#x441;&#x438; (futures) &#x442;&#x430; &#x434;&#x435;&#x301;&#x444;&#x435;&#x440;&#x435;&#x434;&#x438; (deferreds) &#x443; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x432;&#x430;&#x445;. &#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x434;&#x435;&#x44F;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x434;, &#x44F;&#x43A;&#x438;&#x439; &#x442;&#x440;&#x435;&#x431;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x43F;&#x456;&#x437;&#x43D;&#x456;&#x448;&#x435; (&#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x437; &#x43F;&#x43E;&#x434;&#x456;&#x44F;&#x43C;&#x438; &#x442;&#x430; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x43C;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43C;&#x438;), &#x456; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x43A;&#x43E;&#x43B;&#x438; &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x43E; &#x430;&#x431;&#x43E; &#x437; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x43E;&#x44E; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x443;&#x454; &#x441;&#x432;&#x43E;&#x44E; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x443; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43E;&#x43A;, &#x431;&#x430;&#x437;&#x443;&#x44E;&#x447;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x442;&#x43E;&#x43C;&#x443;, &#x447;&#x438; &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F;, &#x449;&#x43E; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x432;&#x430;&#x448; &#x43A;&#x43E;&#x434; &#x43B;&#x435;&#x433;&#x448;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x43D;&#x430;&#x43B;&#x430;&#x433;&#x43E;&#x434;&#x436;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x449;&#x43E;&#x431; &#x434;&#x43E;&#x431;&#x440;&#x435; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438;, &#x44F;&#x43A; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438;, &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x456; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x446;&#x456;&#x457;, &#x43D;&#x430; &#x44F;&#x43A;&#x438;&#x445; &#x432;&#x43E;&#x43D;&#x438; &#x43F;&#x43E;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456;.</p>
<h2 id="&#x43F;&#x456;&#x434;&#x491;&#x440;&#x443;&#x43D;&#x442;&#x44F;-&#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E;-&#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;">&#x41F;&#x456;&#x434;&#x491;&#x440;&#x443;&#x43D;&#x442;&#x44F; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</h2>
<p>&#x420;&#x443;&#x448;&#x456;&#x457; JavaScript &#x43F;&#x43E;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43D;&#x430; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x446;&#x456;&#x457; &#x43E;&#x434;&#x43D;&#x43E;&#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x43F;&#x43E;&#x434;&#x456;&#x439;. <em>&#x41E;&#x434;&#x43D;&#x43E;&#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x438;&#x439;</em> &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432; &#x43E;&#x434;&#x438;&#x43D; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x447;&#x430;&#x441;&#x443; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x448;&#x43C;&#x430;&#x442;&#x43E;&#x43A; &#x43A;&#x43E;&#x434;&#x443;. &#x426;&#x435; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x43C;&#x43E;&#x432;, &#x44F;&#x43A; &#x43E;&#x442; Java &#x447;&#x438; C++, &#x432; &#x44F;&#x43A;&#x438;&#x445; &#x43F;&#x43E;&#x442;&#x43E;&#x43A;&#x438; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x434;&#x43D;&#x43E;&#x447;&#x430;&#x441;&#x43D;&#x43E; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x43A;&#x43E;&#x434;&#x443;. &#x41F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x430; &#x456; &#x437;&#x430;&#x445;&#x438;&#x441;&#x442; &#x441;&#x442;&#x430;&#x43D;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x440;&#x456;&#x437;&#x43D;&#x456; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x43A;&#x43E;&#x434;&#x443; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43C;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x442;&#x430; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x446;&#x435;&#x439; &#x441;&#x442;&#x430;&#x43D;, &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;&#x44E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x43E;&#x44E; &#x442;&#x430; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x454; &#x434;&#x436;&#x435;&#x440;&#x435;&#x43B;&#x43E;&#x43C; &#x431;&#x430;&#x433;&#x456;&#x432; &#x443; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43D;&#x43E;&#x43C;&#x443; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x435;&#x43D;&#x43D;&#x456;, &#x449;&#x43E; &#x431;&#x430;&#x437;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43F;&#x43E;&#x442;&#x43E;&#x43A;&#x430;&#x445;.</p>
<p>&#x420;&#x443;&#x448;&#x456;&#x457; JavaScript &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x448;&#x43C;&#x430;&#x442;&#x43E;&#x43A; &#x43A;&#x43E;&#x434;&#x443; &#x437;&#x430; &#x440;&#x430;&#x437;, &#x442;&#x43E;&#x43C;&#x443; &#x434;&#x43B;&#x44F; &#x43D;&#x438;&#x445; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x434;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438;. &#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <em>&#x447;&#x435;&#x440;&#x437;&#x456; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; (job queue)</em>. &#x41A;&#x43E;&#x43B;&#x438; &#x448;&#x43C;&#x430;&#x442;&#x43E;&#x43A; &#x43A;&#x43E;&#x434;&#x443; &#x433;&#x43E;&#x442;&#x43E;&#x432;&#x438;&#x439; &#x434;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;, &#x432;&#x456;&#x43D; &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;. &#x41A;&#x43E;&#x43B;&#x438; &#x440;&#x443;&#x448;&#x456;&#x439; JavaScript &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x438;&#x432; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x443;, &#x446;&#x438;&#x43A;&#x43B; &#x43F;&#x43E;&#x434;&#x456;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x443; &#x446;&#x456;&#x439; &#x447;&#x435;&#x440;&#x437;&#x456;. <em>&#x426;&#x438;&#x43A;&#x43B; &#x43F;&#x43E;&#x434;&#x456;&#x439; (event loop)</em> &#x2014; &#x446;&#x435; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x440;&#x443;&#x448;&#x456;&#x44F; JavaScript, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x454; &#x442;&#x430; &#x43A;&#x435;&#x440;&#x443;&#x454; &#x447;&#x435;&#x440;&#x433;&#x43E;&#x44E; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;. &#x41F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x430;&#x439;&#x442;&#x435;, &#x449;&#x43E; &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x446;&#x435; &#x447;&#x435;&#x440;&#x433;&#x430;, &#x442;&#x43E; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43D;&#x456;&#x439; &#x432;&#x456;&#x434; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x434;&#x43E; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x433;&#x43E;.</p>
<h3 id="&#x43F;&#x43E;&#x434;&#x456;&#x454;&#x432;&#x430;-&#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x44C;">&#x41F;&#x43E;&#x434;&#x456;&#x454;&#x432;&#x430; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x44C;</h3>
<p>&#x41A;&#x43E;&#x43B;&#x438; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447; &#x43A;&#x43B;&#x456;&#x43A;&#x430;&#x454; &#x430;&#x431;&#x43E; &#x43D;&#x430;&#x442;&#x438;&#x441;&#x43A;&#x430;&#x454; &#x43A;&#x43B;&#x430;&#x432;&#x456;&#x448;&#x443; &#x43D;&#x430; &#x43A;&#x43B;&#x430;&#x432;&#x456;&#x430;&#x442;&#x443;&#x440;&#x456;, &#x441;&#x43F;&#x440;&#x430;&#x446;&#x44C;&#x43E;&#x432;&#x443;&#x454; <em>&#x43F;&#x43E;&#x434;&#x456;&#x44F; (event)</em>, &#x44F;&#x43A; &#x43E;&#x442; <code>onclick</code>. &#x426;&#x44F; &#x43F;&#x43E;&#x434;&#x456;&#x44F; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x441;&#x442;&#x438; &#x43D;&#x430; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x434;&#x456;&#x44E; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x432; &#x43A;&#x456;&#x43D;&#x435;&#x446;&#x44C; &#x447;&#x435;&#x440;&#x433;&#x438; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;. &#x426;&#x435; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x430; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x443; JavaScript. &#x41A;&#x43E;&#x434; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x43F;&#x43E;&#x434;&#x456;&#x457; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E;&#x442;&#x438;, &#x434;&#x43E;&#x43A;&#x438; &#x43D;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x434;&#x456;&#x44F;, &#x430; &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x432;&#x456;&#x43D; &#x43C;&#x430;&#x454; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43A;&#x441;&#x442;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> button = <span class="hljs-built_in">document</span>.getElementById(<span class="hljs-string">&quot;my-btn&quot;</span>);
button.onclick = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">event</span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Clicked&quot;</span>);
};
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, <code>console.log(&quot;Clicked&quot;)</code> &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E;&#x442;&#x438;, &#x434;&#x43E;&#x43A;&#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43A;&#x43B;&#x456;&#x43A;&#x443; &#x43F;&#x43E; <code>button</code>. &#x42F;&#x43A;&#x449;&#x43E; &#x43D;&#x430; <code>button</code> &#x43A;&#x43B;&#x456;&#x43A;&#x43D;&#x443;&#x442;&#x438;, &#x442;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x454;&#x43D;&#x430; &#x443; <code>onclick</code>, &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43A;&#x456;&#x43D;&#x435;&#x446;&#x44C; &#x447;&#x435;&#x440;&#x433;&#x438; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x441;&#x456; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43D;&#x435;&#x44E; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x456;.</p>
<p>&#x41F;&#x43E;&#x434;&#x456;&#x457; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x434;&#x43E;&#x431;&#x440;&#x435; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x445; &#x432;&#x437;&#x430;&#x454;&#x43C;&#x43E;&#x434;&#x456;&#x439;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43F;&#x43E;&#x454;&#x434;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x438;&#x445; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432; &#x454; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x438;&#x43C;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x438; &#x43C;&#x443;&#x441;&#x438;&#x442;&#x435; &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; (<code>button</code> &#x443; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;) &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x457; &#x43F;&#x43E;&#x434;&#x456;&#x457;. &#x41A;&#x440;&#x456;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x435;&#x432;&#x43D;&#x456; &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x441;&#x456; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x456; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x43F;&#x43E;&#x434;&#x456;&#x457; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x456; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x446;&#x44F; &#x43F;&#x43E;&#x434;&#x456;&#x44F; &#x432;&#x456;&#x434;&#x431;&#x443;&#x434;&#x435;&#x442;&#x44C;&#x441;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x44F;&#x43A;&#x449;&#x43E; &#x43A;&#x43B;&#x456;&#x43A;&#x43D;&#x443;&#x442;&#x438; <code>button</code> &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x457;&#x442;&#x438; &#x44F;&#x43A;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; <code>onclick</code>, &#x43D;&#x456;&#x447;&#x43E;&#x433;&#x43E; &#x43D;&#x435; &#x432;&#x456;&#x434;&#x431;&#x443;&#x434;&#x435;&#x442;&#x44C;&#x441;&#x44F;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x445;&#x43E;&#x447; &#x43F;&#x43E;&#x434;&#x456;&#x457; &#x456; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x440;&#x435;&#x430;&#x433;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x434;&#x456;&#x457; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x443;&#x432;&#x430;&#x447;&#x430; &#x442;&#x430; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456;, &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x434;&#x443;&#x436;&#x435; &#x43F;&#x456;&#x434;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x438;&#x445; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;.</p>
<h3 id="&#x43F;&#x430;&#x442;&#x435;&#x440;&#x43D;-&#x437;&#x456;-&#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x43C;&#x438;-&#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43C;&#x438;">&#x41F;&#x430;&#x442;&#x435;&#x440;&#x43D; &#x437;&#x456; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x43C;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43C;&#x438;</h3>
<p>&#x41A;&#x43E;&#x43B;&#x438; &#x431;&#x443;&#x43B;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43E; Node.js, &#x432;&#x456;&#x43D; &#x43F;&#x440;&#x43E;&#x441;&#x443;&#x43D;&#x443;&#x432; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x44C; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x438;&#x437;&#x430;&#x446;&#x456;&#x44E; &#x43F;&#x430;&#x442;&#x435;&#x440;&#x43D;&#x443; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x456; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x43C;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43C;&#x438;. &#x41F;&#x430;&#x442;&#x435;&#x440;&#x43D; &#x437;&#x456; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x43C;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43C;&#x438; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x43D;&#x430; &#x43F;&#x43E;&#x434;&#x456;&#x454;&#x432;&#x443; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x44C; &#x442;&#x438;&#x43C;, &#x449;&#x43E; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x43F;&#x435;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x443;. &#x410; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x43D; &#x442;&#x438;&#x43C;, &#x449;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x44F;&#x43A;&#x443; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;, &#x44F;&#x43A; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x442;&#x443;&#x442;:</p>
<pre><code class="lang-js">readFile(<span class="hljs-string">&quot;example.txt&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err, contents</span>) </span>{
    <span class="hljs-keyword">if</span> (err) {
        <span class="hljs-keyword">throw</span> err;
    }

    <span class="hljs-built_in">console</span>.log(contents);
});
<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Hi!&quot;</span>);
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x442;&#x440;&#x430;&#x434;&#x438;&#x446;&#x456;&#x439;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; Node.js &#x441;&#x442;&#x438;&#x43B;&#x44C; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432;: <em>&#xAB;&#x441;&#x43F;&#x435;&#x440;&#x448;&#x443; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;&#xBB;</em>. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>readFile()</code> &#x43C;&#x430;&#x454; &#x447;&#x438;&#x442;&#x430;&#x442;&#x438; &#x437; &#x434;&#x438;&#x441;&#x43A;&#x430; &#x444;&#x430;&#x439;&#x43B; (&#x437;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x439; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C;), &#x430; &#x442;&#x43E;&#x434;&#x456;, &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; (&#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;). &#x42F;&#x43A;&#x449;&#x43E; &#x441;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;, &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; <code>err</code>, &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x431;&#x443;&#x434;&#x435; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;; &#x432; &#x456;&#x43D;&#x448;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; <code>contents</code> &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x438;&#x43C;&#x435; &#x432;&#x43C;&#x456;&#x441;&#x442; &#x444;&#x430;&#x439;&#x43B;&#x443; &#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x456; &#x440;&#x44F;&#x434;&#x43A;&#x430;.</p>
<p>&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x43F;&#x430;&#x442;&#x435;&#x440;&#x43D; &#x437;&#x456; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x43C;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43C;&#x438;, <code>readFile()</code> &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x435;&#x433;&#x430;&#x439;&#x43D;&#x43E; &#x456; &#x437;&#x443;&#x43F;&#x438;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x437; &#x434;&#x438;&#x441;&#x43A;&#x443;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; <code>console.log(&quot;Hi!&quot;)</code> &#x441;&#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x43D;&#x435;&#x433;&#x430;&#x439;&#x43D;&#x43E; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>readFile()</code>, &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; <code>console.log(contents)</code> &#x449;&#x43E;&#x2013;&#x43D;&#x435;&#x431;&#x443;&#x434;&#x44C; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435;. &#x41A;&#x43E;&#x43B;&#x438; <code>readFile()</code> &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x438;&#x442;&#x44C; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F;, &#x432;&#x43E;&#x43D;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x441;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x435; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x437; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x442;&#x430; &#x457;&#x457; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x432; &#x43A;&#x456;&#x43D;&#x435;&#x446;&#x44C; &#x447;&#x435;&#x440;&#x433;&#x438; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;. &#x426;&#x435; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43D;&#x438;&#x43C;.</p>
<p>&#x41F;&#x430;&#x442;&#x435;&#x440; &#x437;&#x456; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x43C;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43C;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x433;&#x43D;&#x443;&#x447;&#x43A;&#x438;&#x439;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43F;&#x43E;&#x454;&#x434;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432; &#x43B;&#x435;&#x433;&#x448;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js">readFile(<span class="hljs-string">&quot;example.txt&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err, contents</span>) </span>{
    <span class="hljs-keyword">if</span> (err) {
        <span class="hljs-keyword">throw</span> err;
    }

    writeFile(<span class="hljs-string">&quot;example.txt&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err</span>) </span>{
        <span class="hljs-keyword">if</span> (err) {
            <span class="hljs-keyword">throw</span> err;
        }

        <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;File was written!&quot;</span>);
    });
});
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>readFile()</code> &#x43F;&#x440;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x434;&#x43E; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x2014; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; <code>writeFile()</code>. &#x417;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;, &#x449;&#x43E; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x438;&#x439; &#x43F;&#x430;&#x442;&#x435;&#x440;&#x43D; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438; &#x43D;&#x430;&#x44F;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; <code>err</code> &#x43F;&#x440;&#x438;&#x441;&#x443;&#x442;&#x43D;&#x456;&#x439; &#x443; &#x43E;&#x431;&#x43E;&#x445; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;&#x445;. &#x41A;&#x43E;&#x43B;&#x438; <code>readFile()</code> &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>writeFile()</code> (&#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;). &#x422;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>writeFile()</code>, &#x432;&#x43E;&#x43D;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x454; &#x442;&#x435;&#x436; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;.</p>
<p>&#x426;&#x435;&#x439; &#x43F;&#x430;&#x442;&#x435;&#x440;&#x43D; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x434;&#x443;&#x436;&#x435; &#x434;&#x43E;&#x431;&#x440;&#x435;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x438; &#x448;&#x432;&#x438;&#x434;&#x43A;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438;, &#x449;&#x43E; &#x432;&#x438; &#x43F;&#x43E;&#x442;&#x440;&#x430;&#x43F;&#x438;&#x43B;&#x438; &#x443; <em>&#x43F;&#x435;&#x43A;&#x43B;&#x43E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432; (callback hell)</em>. &#x41F;&#x435;&#x43A;&#x43B;&#x43E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x435; &#x43D;&#x430;&#x434;&#x442;&#x43E; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x432;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x438;&#x445; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432;, &#x44F;&#x43A; &#x43E;&#x441;&#x44C; &#x442;&#x443;&#x442;:</p>
<pre><code class="lang-js">method1(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err, result</span>) </span>{

    <span class="hljs-keyword">if</span> (err) {
        <span class="hljs-keyword">throw</span> err;
    }

    method2(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err, result</span>) </span>{

        <span class="hljs-keyword">if</span> (err) {
            <span class="hljs-keyword">throw</span> err;
        }

        method3(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err, result</span>) </span>{

            <span class="hljs-keyword">if</span> (err) {
                <span class="hljs-keyword">throw</span> err;
            }

            method4(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err, result</span>) </span>{

                <span class="hljs-keyword">if</span> (err) {
                    <span class="hljs-keyword">throw</span> err;
                }

                method5(result);
            });

        });

    });

});
</code></pre>
<p>&#x412;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;, &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x437;&#x430;&#x43F;&#x43B;&#x443;&#x442;&#x430;&#x43D;&#x443; &#x43F;&#x430;&#x432;&#x443;&#x442;&#x438;&#x43D;&#x430; &#x43A;&#x43E;&#x434;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x430;&#x436;&#x43A;&#x43E; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438; &#x442;&#x430; &#x43D;&#x430;&#x43B;&#x430;&#x433;&#x43E;&#x434;&#x438;&#x442;&#x438;. &#x417;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443; &#x437; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x454;&#x44E; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456;. &#x429;&#x43E;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x438; &#x434;&#x432;&#x456; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x43F;&#x430;&#x440;&#x430;&#x43B;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x456; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x441;&#x43F;&#x43E;&#x432;&#x456;&#x449;&#x435;&#x43D;&#x43D;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x43E;&#x43D;&#x438; &#x43E;&#x431;&#x43E;&#x454; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x456;? &#x429;&#x43E;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x43C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x438; &#x434;&#x432;&#x456; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x43E;&#x434;&#x43D;&#x43E;&#x447;&#x430;&#x441;&#x43D;&#x43E;, &#x430;&#x43B;&#x435; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x434;&#x43D;&#x43E;&#x457; &#x437; &#x43D;&#x438;&#x445;?</p>
<p>&#x412; &#x442;&#x430;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x432;&#x430;&#x43C; &#x431;&#x438; &#x437;&#x43D;&#x430;&#x434;&#x43E;&#x431;&#x438;&#x43B;&#x43E;&#x441;&#x44C; &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432; &#x442;&#x430; &#x43E;&#x447;&#x438;&#x449;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;, &#x430; &#x43E;&#x442; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x43D;&#x43E; &#x43F;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x443;&#x44E;&#x442;&#x44C; &#x441;&#x445;&#x43E;&#x436;&#x456; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x456;&#x457;.</p>
<h2 id="&#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x438;-&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;">&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;</h2>
<p>&#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x2014; &#x446;&#x435; &#x437;&#x430;&#x433;&#x43B;&#x443;&#x448;&#x43A;&#x430; &#x434;&#x43B;&#x44F; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x457; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x456;&#x434;&#x43F;&#x438;&#x441;&#x43A;&#x438; &#x43D;&#x430; &#x43F;&#x43E;&#x434;&#x456;&#x44E; &#x430;&#x431;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x443; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// readFile &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43C;&#x430;&#x439;&#x431;&#x443;&#x442;&#x43D;&#x44C;&#x43E;&#x43C;&#x443;</span>
<span class="hljs-keyword">let</span> promise = readFile(<span class="hljs-string">&quot;example.txt&quot;</span>);
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, <code>readFile()</code> &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x43D;&#x435; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x443; &#x43D;&#x435;&#x433;&#x430;&#x439;&#x43D;&#x43E; &#x2014; &#x446;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x433;&#x43E;&#x434;&#x43E;&#x43C;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x2013;&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x456;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F;, &#x456;, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x43D;&#x438;&#x43C; &#x443; &#x43C;&#x430;&#x439;&#x431;&#x443;&#x442;&#x43D;&#x44C;&#x43E;&#x43C;&#x443;. &#x41A;&#x43E;&#x43B;&#x438; &#x441;&#x430;&#x43C;&#x435; &#x432;&#x438; &#x437;&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C;, &#x437;&#x430;&#x43B;&#x435;&#x436;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x436;&#x438;&#x442;&#x442;&#x454;&#x432;&#x438;&#x439; &#x446;&#x438;&#x43A;&#x43B; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;.</p>
<h3 id="&#x436;&#x438;&#x442;&#x442;&#x454;&#x432;&#x438;&#x439;-&#x446;&#x438;&#x43A;&#x43B;-&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;">&#x416;&#x438;&#x442;&#x442;&#x454;&#x432;&#x438;&#x439; &#x446;&#x438;&#x43A;&#x43B; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;</h3>
<p>&#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43A;&#x43E;&#x440;&#x43E;&#x442;&#x43A;&#x438;&#x439; &#x436;&#x438;&#x442;&#x442;&#x454;&#x432;&#x438;&#x439; &#x446;&#x438;&#x43A;&#x43B;, &#x449;&#x43E; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x456; &#x441;&#x442;&#x430;&#x43D;&#x443; <em>&#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; (pending)</em>, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x430; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F; &#x449;&#x435; &#x43D;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x430;. &#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x431;&#x443;&#x432;&#x430;&#x454; &#x443; &#x441;&#x442;&#x430;&#x43D;&#x456; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x432;&#x432;&#x430;&#x436;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <em>&#x43D;&#x435;&#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x43C; (unsettled)</em>. &#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x437; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x431;&#x443;&#x432;&#x430;&#x454; &#x443; &#x441;&#x442;&#x430;&#x43D;&#x456; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>readFile()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x439;&#x43E;&#x433;&#x43E;. &#x42F;&#x43A; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x430; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x432;&#x432;&#x430;&#x436;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <em>&#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x43C; (settled)</em> &#x456; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43E;&#x434;&#x438;&#x43D; &#x437; &#x434;&#x432;&#x43E;&#x445; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x445; &#x441;&#x442;&#x430;&#x43D;&#x456;&#x432;:</p>
<ol>
<li><em>fulfilled (&#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x439;)</em> &#x2014; &#x43A;&#x43E;&#x43B;&#x438; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x430; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F; &#x443; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x430; &#x443;&#x441;&#x43F;&#x456;&#x449;&#x43D;&#x43E;;</li>
<li><em>rejected (&#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x439;)</em> &#x2014; &#x43A;&#x43E;&#x43B;&#x438; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x430; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F; &#x43D;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x430; &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x43E; &#x447;&#x435;&#x440;&#x435;&#x437; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x430;&#x431;&#x43E; &#x437; &#x456;&#x43D;&#x448;&#x43E;&#x457; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x438;.</li>
</ol>
<p>&#x412;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>[[PromiseState]]</code> &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>&quot;pending&quot;</code>, <code>&quot;fulfilled&quot;</code> &#x430;&#x431;&#x43E; <code>&quot;rejected&quot;</code>, &#x449;&#x43E;&#x431; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x442;&#x438; &#x441;&#x442;&#x430;&#x43D; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;. &#x426;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43D;&#x435; &#x432;&#x456;&#x434;&#x43A;&#x440;&#x438;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;&#x445;&#x2013;&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;&#x445;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43D;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x443; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x441;&#x442;&#x430;&#x43D;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x431;&#x443;&#x432;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;. &#x41F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x432;&#x43D;&#x443; &#x434;&#x456;&#x44E;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x44C; &#x441;&#x442;&#x430;&#x43D;, &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>then()</code>.</p>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>then()</code> &#x43F;&#x440;&#x438;&#x441;&#x443;&#x442;&#x43D;&#x456;&#x439; &#x443; &#x432;&#x441;&#x456;&#x445; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x442;&#x430; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x434;&#x432;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E;, &#x44F;&#x43A;&#x430; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x438;&#x439; (fulfilled). &#x411;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x430; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44F;, &#x449;&#x43E; &#x441;&#x442;&#x43E;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x457; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x446;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;. &#x414;&#x440;&#x443;&#x433;&#x438;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43E; (rejected). &#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x434;&#x43B;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;, &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x430; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44F;, &#x449;&#x43E; &#x441;&#x442;&#x43E;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x446;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;.</p>
<p>I&gt; &#x411;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;, &#x449;&#x43E; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>then()</code>, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <em>&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x438;&#x43C; (thenable)</em> (&#x442;&#x43E;&#x431;&#x442;&#x43E; &#x442;&#x43E;&#x439;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>then()</code>). &#x412;&#x441;&#x456; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>then()</code>, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43D;&#x435; &#x432;&#x441;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;, &#x449;&#x43E; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>then()</code>, &#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;&#x43C;&#x438;.</p>
<p>&#x41E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; <code>then()</code> &#x454; &#x43E;&#x43F;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43B;&#x443;&#x445;&#x430;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x443; &#x43A;&#x43E;&#x43C;&#x431;&#x456;&#x43D;&#x430;&#x446;&#x456;&#x44E; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; <code>then()</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> promise = readFile(<span class="hljs-string">&quot;example.txt&quot;</span>);

promise.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">contents</span>) </span>{
    <span class="hljs-comment">// &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.log(contents);
}, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err</span>) </span>{
    <span class="hljs-comment">// &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.error(err.message);
});

promise.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">contents</span>) </span>{
    <span class="hljs-comment">// &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.log(contents);
});

promise.then(<span class="hljs-literal">null</span>, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err</span>) </span>{
    <span class="hljs-comment">// &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.error(err.message);
});
</code></pre>
<p>&#x412;&#x441;&#x456; &#x442;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; <code>then()</code> &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430;&#x434; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x456; &#x442;&#x438;&#x43C; &#x436;&#x435; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43C;. &#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x441;&#x43B;&#x443;&#x445;&#x430;&#x454; &#x456; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;, &#x456; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;. &#x414;&#x440;&#x443;&#x433;&#x438;&#x439; &#x441;&#x43B;&#x443;&#x445;&#x430;&#x454; &#x43B;&#x438;&#x448;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; (&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x44C; &#x43F;&#x440;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;). &#x422;&#x440;&#x435;&#x442;&#x456;&#x439; &#x441;&#x43B;&#x456;&#x434;&#x43A;&#x443;&#x454; &#x43B;&#x438;&#x448;&#x435; &#x437;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x456; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x44F;&#x454; &#x43F;&#x440;&#x43E; &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>catch()</code>, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; <code>then()</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x439;&#x43E;&#x43C;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x44C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x442;&#x430;&#x43A;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; <code>catch()</code> &#x442;&#x430; <code>then()</code> &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x456;:</p>
<pre><code class="lang-js">promise.catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err</span>) </span>{
    <span class="hljs-comment">// &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.error(err.message);
});

<span class="hljs-comment">// &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435; &#x449;&#x43E; &#x439;:</span>

promise.then(<span class="hljs-literal">null</span>, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err</span>) </span>{
    <span class="hljs-comment">// &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.error(err.message);
});
</code></pre>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43A;&#x43E;&#x43C;&#x431;&#x456;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; <code>then()</code> &#x442;&#x430; <code>catch()</code> &#x434;&#x43B;&#x44F; &#x43A;&#x440;&#x430;&#x449;&#x43E;&#x457; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x457; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;. &#x422;&#x430;&#x43A;&#x430; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430; &#x454; &#x43A;&#x440;&#x430;&#x449;&#x43E;&#x44E; &#x437;&#x430; &#x43F;&#x43E;&#x434;&#x456;&#x457; &#x442;&#x430; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x430; &#x434;&#x430;&#x454; &#x447;&#x456;&#x442;&#x43A;&#x435; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x438;&#x43B;&#x430;&#x441;&#x44C; &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x43E;, &#x447;&#x438; &#x437; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x43E;&#x44E;. (&#x41F;&#x43E;&#x434;&#x456;&#x457; &#x43D;&#x435; &#x432;&#x456;&#x434;&#x431;&#x443;&#x434;&#x443;&#x442;&#x44C;&#x441;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; &#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;, &#x430; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x441;&#x442;&#x456;&#x439;&#x43D;&#x43E;&#x457; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443;&#x2013;&#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;.) &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x439;&#x442;&#x435;, &#x449;&#x43E; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x437;&#x430;&#x434;&#x430;&#x441;&#x442;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x44C;, &#x443;&#x441;&#x456; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x431;&#x435;&#x437; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;. &#x417;&#x430;&#x432;&#x436;&#x434;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x44C;, &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x44F;&#x43A;&#x449;&#x43E; &#x446;&#x435;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;.</p>
<p>&#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C;, &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x441;&#x442;&#x430;&#x432; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x43C; (settled). &#x426;&#x435; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x43A;&#x43E;&#x43B;&#x438; &#x437; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x456;&#x454;&#x44E;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43D;&#x456;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> promise = readFile(<span class="hljs-string">&quot;example.txt&quot;</span>);

<span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x432;&#x438;&#x43D;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</span>
promise.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">contents</span>) </span>{
    <span class="hljs-built_in">console</span>.log(contents);

    <span class="hljs-comment">// &#x442;&#x435;&#x43F;&#x435;&#x440; &#x434;&#x43E;&#x434;&#x430;&#x454;&#x43C;&#x43E; &#x449;&#x435; &#x43E;&#x434;&#x438;&#x43D;</span>
    promise.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">contents</span>) </span>{
        <span class="hljs-built_in">console</span>.log(contents);
    });
});
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x434;&#x430;&#x454; &#x449;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E; &#x436; &#x441;&#x430;&#x43C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;. &#x423; &#x446;&#x435;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x443;&#x436;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x439;, &#x442;&#x43E;&#x43C;&#x443; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x431;&#x443;&#x434;&#x435; &#x433;&#x43E;&#x442;&#x43E;&#x432;&#x438;&#x439;. &#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x436;&#x435; &#x447;&#x438;&#x43D;&#x43E;&#x43C;.</p>
<p>I&gt; &#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>then()</code> &#x430;&#x431;&#x43E; <code>catch()</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43D;&#x43E;&#x432;&#x435; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x43C;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44C;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43E;. &#x41F;&#x440;&#x43E;&#x442;&#x435; &#x446;&#x456; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x440;&#x435;&#x448;&#x442;&#x43E;&#x44E; &#x43A;&#x43B;&#x430;&#x434;&#x443;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x430; &#x441;&#x43F;&#x435;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;. &#x414;&#x435;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x430; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44F; &#x43F;&#x440;&#x43E; &#x446;&#x44E; &#x434;&#x440;&#x443;&#x433;&#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x43D;&#x435; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x430; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x43E;&#x43C; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x454;&#x442;&#x435; &#x44F;&#x43A; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x447;&#x435;&#x440;&#x433;&#x430; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;.</p>
<h3 id="&#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;-&#x43D;&#x435;&#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x445;-&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;">&#x421;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435;&#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;</h3>
<p>&#x41D;&#x43E;&#x432;&#x456; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x430; <code>Promise</code>. &#x426;&#x435;&#x439; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x43E;&#x434;&#x438;&#x43D; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;: &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x43F;&#x456;&#x434; &#x43D;&#x430;&#x437;&#x432;&#x43E;&#x44E; <em>&#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x446;&#x44C; (executor)</em>, &#x44F;&#x43A;&#x430; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43A;&#x43E;&#x434;, &#x449;&#x43E; &#x456;&#x43D;&#x456;&#x446;&#x456;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;. &#x412;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x446;&#x44C; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x434;&#x432;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;: <code>resolve()</code> &#x442;&#x430; <code>reject()</code>. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>resolve()</code> &#x441;&#x438;&#x433;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x454; &#x43F;&#x440;&#x43E; &#x442;&#x435;, &#x449;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x433;&#x43E;&#x442;&#x43E;&#x432;&#x438;&#x439; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x440;&#x456;&#x448;&#x435;&#x43D;&#x438;&#x43C;, &#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x446;&#x44C; &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x43E; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x438;&#x432;&#x441;&#x44F;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>reject()</code> &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x446;&#x44C; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x438;&#x441;&#x44F; &#x437; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x43E;&#x44E;.</p>
<p>&#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x432; Node.js &#x434;&#x43B;&#x44F; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; <code>readFile()</code>, &#x44F;&#x43A;&#x430; &#x437;&#x433;&#x430;&#x434;&#x443;&#x432;&#x430;&#x43B;&#x430;&#x441;&#x44C; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435; &#x443; &#x446;&#x456;&#x439; &#x433;&#x43B;&#x430;&#x432;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x41F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; Node.js</span>

<span class="hljs-keyword">let</span> fs = <span class="hljs-built_in">require</span>(<span class="hljs-string">&quot;fs&quot;</span>);

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">readFile</span>(<span class="hljs-params">filename</span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{

        <span class="hljs-comment">// &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x43C;&#x43E; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44E;</span>
        fs.readFile(filename, { encoding: <span class="hljs-string">&quot;utf8&quot;</span> }, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err, contents</span>) </span>{

            <span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x454;&#x43C;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;</span>
            <span class="hljs-keyword">if</span> (err) {
                reject(err);
                <span class="hljs-keyword">return</span>;
            }

            <span class="hljs-comment">// &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x438;&#x43B;&#x43E;&#x441;&#x44C; &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x43E;</span>
            resolve(contents);

        });
    });
}

<span class="hljs-keyword">let</span> promise = readFile(<span class="hljs-string">&quot;example.txt&quot;</span>);

<span class="hljs-comment">// &#x447;&#x435;&#x43A;&#x430;&#x454;&#x43C;&#x43E; &#x43D;&#x430; &#x443;&#x441;&#x43F;&#x456;&#x448;&#x43D;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x43E;&#x44E;</span>
promise.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">contents</span>) </span>{
    <span class="hljs-comment">// &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.log(contents);
}, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err</span>) </span>{
    <span class="hljs-comment">// &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.error(err.message);
});
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x439; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>fs.readFile()</code> &#x437; Node.js &#x43E;&#x433;&#x43E;&#x440;&#x43D;&#x443;&#x442;&#x438;&#x439; &#x443; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;. &#x412;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x446;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454; &#x430;&#x431;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; <code>reject()</code>, &#x430;&#x431;&#x43E; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442; &#x444;&#x430;&#x439;&#x43B;&#x443; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; <code>resolve()</code>.</p>
<p>&#x41F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x430;&#x439;&#x442;&#x435;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x446;&#x44C; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x433;&#x430;&#x439;&#x43D;&#x43E;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>readFile()</code>. &#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x446;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>resolve()</code> &#x430;&#x431;&#x43E; <code>reject()</code>, &#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x440;&#x456;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;. &#x426;&#x435; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <em>&#x43F;&#x43B;&#x430;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; (job scheduling)</em>, &#x456; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43A;&#x43E;&#x43B;&#x438;&#x441;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; <code>setTimeout()</code> &#x430;&#x431;&#x43E; <code>setInterval()</code>, &#x442;&#x43E; &#x432;&#x438; &#x432;&#x436;&#x435; &#x437;&#x43D;&#x430;&#x439;&#x43E;&#x43C;&#x456; &#x437; &#x446;&#x438;&#x43C;. &#x41F;&#x440;&#x438; &#x43F;&#x43B;&#x430;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;, &#x432;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x435; &#x43D;&#x43E;&#x432;&#x435; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;, &#x43C;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;: &#xAB;&#x41D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x439; &#x446;&#x435; &#x437;&#x430;&#x440;&#x430;&#x437;, &#x430;&#x43B;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x439; &#x446;&#x435; &#x43F;&#x456;&#x437;&#x43D;&#x456;&#x448;&#x435;.&#xBB; &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>setTimeout()</code> &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x437;&#x430;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x432;&#x43D;&#x443; &#x437;&#x430;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x442;&#x438;&#x43C;, &#x44F;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x442;&#x440;&#x430;&#x43F;&#x438;&#x442;&#x44C; &#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x446;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x441;&#x43F;&#x43B;&#x438;&#x432;&#x435; 500 &#x43C;&#x441;. </span>
setTimeout(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Timeout&quot;</span>);
}, <span class="hljs-number">500</span>)

<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Hi!&quot;</span>);
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x440;&#x43E;&#x437;&#x43F;&#x43B;&#x430;&#x43D;&#x43E;&#x432;&#x443;&#x454; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x430;&#x43A;, &#x449;&#x43E;&#x431; &#x432;&#x43E;&#x43D;&#x43E; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x435; &#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x447;&#x435;&#x440;&#x435;&#x437; 500 &#x43C;&#x441;. &#x426;&#x456; &#x434;&#x432;&#x430; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438; <code>console.log()</code> &#x434;&#x430;&#x434;&#x443;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x432;&#x456;&#x434;:</p>
<pre><code>Hi!
Timeout
</code></pre><p>&#x417;&#x430;&#x432;&#x434;&#x44F;&#x43A;&#x438; &#x437;&#x430;&#x442;&#x440;&#x438;&#x43C;&#x446;&#x456; &#x443; 500 &#x43C;&#x441;., &#x432;&#x438;&#x432;&#x456;&#x434; &#x437; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x44F;&#x43A;&#x443; &#x43C;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43B;&#x438; &#x443; <code>setTimeout()</code> &#x437;&#x2019;&#x44F;&#x432;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x443; &#x432;&#x456;&#x434; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>console.log(&quot;Hi!&quot;)</code>.</p>
<p>&#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;. &#x412;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x446;&#x44C; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x433;&#x430;&#x439;&#x43D;&#x43E;, &#x434;&#x43E; &#x432;&#x441;&#x44C;&#x43E;&#x433;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43A;&#x43E;&#x434;&#x456; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43D;&#x44C;&#x43E;&#x433;&#x43E;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> promise = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Promise&quot;</span>);
    resolve();
});

<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Hi!&quot;</span>);
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435;:</p>
<pre><code>Promise
Hi!
</code></pre><p>&#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>resolve()</code> &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x443; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44E;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x456; &#x443; <code>then()</code> &#x442;&#x430; <code>catch()</code>, &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x43E;&#x43D;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> promise = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Promise&quot;</span>);
    resolve();
});

promise.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Resolved.&quot;</span>);
});

<span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Hi!&quot;</span>);
</code></pre>
<p>&#x414;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443; &#x432;&#x438;&#x432;&#x456;&#x434; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code>Promise
Hi!
Resolved
</code></pre><p>&#x417;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;, &#x449;&#x43E; &#x445;&#x43E;&#x447;&#x430; &#x439; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>then()</code> &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43A;&#x43E;&#x434;&#x456; &#x434;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430; &#x437; <code>console.log(&quot;Hi!&quot;)</code>, &#x432;&#x456;&#x43D; &#x432;&#x456;&#x434;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43F;&#x43E;&#x442;&#x456;&#x43C; (&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x446;&#x44F;). &#x426;&#x435; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43A;&#x456;&#x43D;&#x435;&#x446;&#x44C; &#x447;&#x435;&#x440;&#x433;&#x438; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x446;&#x44C; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x438;&#x442;&#x44C; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443;.</p>
<h3 id="&#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F;-&#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x445;-&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;">&#x421;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;</h3>
<p>&#x41A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; <code>Promise</code> &#x454; &#x43D;&#x430;&#x439;&#x43A;&#x440;&#x430;&#x449;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435;&#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x445; (unsettled) &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x447;&#x435;&#x440;&#x435;&#x437; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x456;&#x447;&#x43D;&#x443; &#x43F;&#x440;&#x438;&#x440;&#x43E;&#x434;&#x443; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x446;&#x44C; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;. &#x41F;&#x440;&#x43E;&#x442;&#x435;, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x454;&#x434;&#x438;&#x43D;&#x43E;&#x43C;&#x443; &#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43E;&#x43C;&#x443; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44E;, &#x442;&#x43E; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x437;&#x43C;&#x456;&#x441;&#x442;&#x443; &#x43F;&#x43B;&#x430;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; <code>resolve()</code>. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x454; &#x434;&#x432;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x437; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;.</p>
<h4 id="&#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;-promiseresolve">&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; Promise.resolve()</h4>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Promise.resolve()</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x442;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x437;&#x456; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x43C; &#xAB;&#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43E;&#xBB;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x43F;&#x43B;&#x430;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;, &#x430; &#x449;&#x43E;&#x431; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43B;&#x438;&#x448;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x434;&#x43E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x43E;&#x434;&#x438;&#x43D;, &#x430;&#x431;&#x43E; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> promise = <span class="hljs-built_in">Promise</span>.resolve(<span class="hljs-number">42</span>);

promise.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);         <span class="hljs-comment">// 42</span>
});
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x442;&#x43E;&#x43C;&#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; 42 &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>value</code>. &#x42F;&#x43A;&#x449;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x434;&#x43E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;, &#x442;&#x43E; &#x446;&#x435;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x441;&#x44F; &#x431; &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x446;&#x435;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x441;&#x442;&#x430;&#x43D; &#xAB;&#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43E;&#xBB;.</p>
<h4 id="&#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;-promisereject">&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; Promise.reject()</h4>
<p>&#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x456; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>Promise.reject()</code>. &#x412;&#x456;&#x43D; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; <code>Promise.resolve()</code>, &#x437; &#x454;&#x434;&#x438;&#x43D;&#x43E;&#x44E; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44E;: &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x441;&#x442;&#x430;&#x43D; &#xAB;&#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43E;&#xBB;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> promise = <span class="hljs-built_in">Promise</span>.reject(<span class="hljs-number">42</span>);

promise.catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);         <span class="hljs-comment">// 42</span>
});
</code></pre>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x434;&#x43E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;, &#x442;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x431; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x43B;&#x438;&#x441;&#x44C;, &#x430; &#x43E;&#x442; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x441;&#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438;.</p>
<p>I&gt; &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Promise.resolve()</code> &#x430;&#x431;&#x43E; <code>Promise.reject()</code>, &#x446;&#x435;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x435;&#x437; &#x437;&#x43C;&#x456;&#x43D;.</p>
<h4 id="&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x456;-thenables">&#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x456; (Thenables)</h4>
<p>&#x42F;&#x43A; <code>Promise.resolve()</code>, &#x442;&#x430;&#x43A; &#x456; <code>Promise.reject()</code> &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x431;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x456; (thenables) &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;. &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x431;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x456;, &#x446;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x44E;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; <code>then()</code>.</p>
<p>&#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x456; &#x2014; &#x446;&#x435; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x438;, &#x449;&#x43E; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>then()</code>, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438; <code>resolve</code> &#x442;&#x430; <code>reject</code>, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> thenable = {
    then: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
        resolve(<span class="hljs-number">42</span>);
    }
};
</code></pre>
<p>&#x41E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>thenable</code>, &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x436;&#x43E;&#x434;&#x43D;&#x438;&#x445; &#x441;&#x43F;&#x456;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x437; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;&#x43C;&#x438; &#x445;&#x430;&#x440;&#x430;&#x43A;&#x442;&#x435;&#x440;&#x438;&#x441;&#x442;&#x438;&#x43A;, &#x43E;&#x43A;&#x440;&#x456;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>then()</code>. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; <code>Promise.resolve()</code>, &#x449;&#x43E;&#x431; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; <code>thenable</code> &#x443; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> thenable = {
    then: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
        resolve(<span class="hljs-number">42</span>);
    }
};

<span class="hljs-keyword">let</span> p1 = <span class="hljs-built_in">Promise</span>.resolve(thenable);
p1.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// 42</span>
});
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, <code>Promise.resolve()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; <code>thenable.then()</code>, &#x456; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x441;&#x442;&#x430;&#x43D; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;. <code>thenable</code> &#x43C;&#x430;&#x454; &#x441;&#x442;&#x430;&#x43D; &#xAB;&#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43E;&#xBB;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>then()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>resolve(42)</code>. &#x41D;&#x43E;&#x432;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; <code>p1</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x456; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x43C; &#xAB;&#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43E;&#xBB; &#x442;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;, &#x44F;&#x43A;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x43E; &#x437; <code>thenable</code> (&#x442;&#x43E;&#x431;&#x442;&#x43E; 42), &#x430; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; <code>p1</code> &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; 42 &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x422;&#x430;&#x43A;&#x438;&#x43C; &#x436;&#x435; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x447;&#x435;&#x440;&#x435;&#x437; <code>Promise.resolve()</code> &#x437; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x438;&#x445; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> thenable = {
    then: <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
        reject(<span class="hljs-number">42</span>);
    }
};

<span class="hljs-keyword">let</span> p1 = <span class="hljs-built_in">Promise</span>.resolve(thenable);
p1.catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// 42</span>
});
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x43D;&#x430; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x439;, &#x43E;&#x43A;&#x440;&#x456;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; <code>thenable</code> &#x454; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x43C;. &#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>thenable.then()</code>, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x437;&#x456; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x43C; &#xAB;&#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43E;&#xBB; &#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; 42. &#x422;&#x43E;&#x434;&#x456; &#x446;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; <code>p1</code>.</p>
<p><code>Promise.resolve()</code> &#x442;&#x430; <code>Promise.reject()</code> &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x442;&#x430;&#x43A; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x438; &#x432;&#x430;&#x43C; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x437; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x438;&#x43C;&#x438;. &#x411;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x456; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; ECMAScript 6 &#x432;&#x432;&#x456;&#x432; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x456; &#x443; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x454; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x44E;, &#x449;&#x43E;&#x431; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x438;&#x442;&#x438; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x44E; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x43C;&#x438;, &#x449;&#x43E; &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x440;&#x430;&#x43D;&#x456;&#x448;&#x435;. &#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x43D;&#x435;&#x432;&#x43F;&#x435;&#x432;&#x43D;&#x435;&#x43D;&#x456; &#x443; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43C;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x432; <code>Promise.resolve()</code> &#x430;&#x431;&#x43E; <code>Promise.reject()</code> (&#x432; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x456;&#x434; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443;) &#x454; &#x43D;&#x430;&#x439;&#x43A;&#x440;&#x430;&#x449;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C;, &#x449;&#x43E;&#x431; &#x437;&#x2019;&#x44F;&#x441;&#x443;&#x432;&#x430;&#x442;&#x438; &#x446;&#x435;, &#x430;&#x434;&#x436;&#x435; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x44C; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43D;&#x438;&#x445; &#x43D;&#x435;&#x437;&#x43C;&#x456;&#x43D;&#x435;&#x43D;&#x438;&#x43C;&#x438;.</p>
<h3 id="&#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;-&#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x446;&#x44F;">&#x41F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x446;&#x44F;</h3>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x446;&#x44F; &#x43A;&#x438;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;, &#x442;&#x43E;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> promise = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Explosion!&quot;</span>);
});

promise.catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">error</span>) </span>{
    <span class="hljs-built_in">console</span>.log(error.message);     <span class="hljs-comment">// &quot;Explosion!&quot;</span>
});
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x446;&#x44F; &#x43A;&#x438;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;. &#x412;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x446;&#x44F; &#x454; &#x43D;&#x435;&#x44F;&#x432;&#x43D;&#x438;&#x439; <code>try-catch</code>, &#x442;&#x43E;&#x43C;&#x443; &#x446;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x431;&#x443;&#x43B;&#x430; &#x432;&#x43F;&#x456;&#x439;&#x43C;&#x430;&#x43D;&#x430; &#x456; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x430; &#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;. &#x41F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x439; &#x442;&#x430;&#x43A;&#x43E;&#x43C;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> promise = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    <span class="hljs-keyword">try</span> {
        <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Explosion!&quot;</span>);
    } <span class="hljs-keyword">catch</span> (ex) {
        reject(ex);
    }
});

promise.catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">error</span>) </span>{
    <span class="hljs-built_in">console</span>.log(error.message);     <span class="hljs-comment">// &quot;Explosion!&quot;</span>
});
</code></pre>
<p>&#x412;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x446;&#x44C; &#x43B;&#x43E;&#x432;&#x438;&#x442;&#x44C; &#x432;&#x441;&#x456; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x456; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;, &#x449;&#x43E;&#x431; &#x43D;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x449;&#x43E;&#x440;&#x430;&#x437;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x442;&#x430;&#x43A;&#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x456;&#x44E;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E; &#x43A;&#x438;&#x43D;&#x443;&#x442;&#x456; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x431;&#x443;&#x434;&#x435; &#x43B;&#x438;&#x448;&#x435; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x431;&#x443;&#x434;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x445; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;. &#x412; &#x456;&#x43D;&#x448;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x432;&#x430;&#x43D;&#x430;. &#x426;&#x435; &#x441;&#x442;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x43E;&#x44E; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432;, &#x449;&#x43E; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x43E;&#x442;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F; JavaScript &#x432;&#x438;&#x440;&#x456;&#x448;&#x443;&#x44E;&#x442;&#x44C; &#x446;&#x435;, &#x43D;&#x430;&#x434;&#x430;&#x44E;&#x447;&#x438; &#x445;&#x443;&#x43A;&#x438;, &#x449;&#x43E;&#x431; &#x43B;&#x43E;&#x432;&#x438;&#x442;&#x438; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x456; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438;.</p>
<h2 id="&#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x430;-&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x430;-&#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;-&#x443;-&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;&#x445;">&#x413;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x430; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;&#x445;</h2>
<p>&#x41E;&#x434;&#x43D;&#x438;&#x43C; &#x437; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x443;&#x43F;&#x435;&#x440;&#x435;&#x447;&#x43B;&#x438;&#x432;&#x438;&#x445; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x456;&#x432; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x454; &#x456;&#x433;&#x43D;&#x43E;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;, &#x449;&#x43E; &#x432;&#x438;&#x43D;&#x438;&#x43A;&#x430;&#x44E;&#x442;&#x44C;, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;. &#x414;&#x435;&#x445;&#x442;&#x43E; &#x432;&#x432;&#x430;&#x436;&#x430;&#x454; &#x446;&#x435; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x438;&#x43C; &#x43D;&#x435;&#x434;&#x43E;&#x43B;&#x456;&#x43A;&#x43E;&#x43C; &#x443; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457;, &#x431;&#x43E; &#x446;&#x435; &#x454;&#x434;&#x438;&#x43D;&#x430; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x43C;&#x43E;&#x432;&#x438; JavaScript, &#x449;&#x43E; &#x43D;&#x435; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x438;&#x43C;&#x438;.</p>
<p>&#x427;&#x435;&#x440;&#x435;&#x437; &#x43F;&#x440;&#x438;&#x440;&#x43E;&#x434;&#x443; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;, &#x43D;&#x435; &#x442;&#x430;&#x43A; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438;, &#x447;&#x438; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x431;&#x443;&#x43B;&#x43E; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x43E;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x446;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> rejected = <span class="hljs-built_in">Promise</span>.reject(<span class="hljs-number">42</span>);

<span class="hljs-comment">// &#x442;&#x443;&#x442; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x435;</span>

<span class="hljs-comment">// &#x442;&#x443;&#x442; &#x442;&#x435;&#x436;...</span>
rejected.catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-comment">// &#x442;&#x435;&#x43F;&#x435;&#x440; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x43E;</span>
    <span class="hljs-built_in">console</span>.log(value);
});
</code></pre>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; <code>then()</code> &#x430;&#x431;&#x43E; <code>catch()</code> &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x43A;&#x43E;&#x43B;&#x438;, &#x456; &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E; &#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x454; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x43C;, &#x447;&#x438; &#x43D;&#x456;. &#x427;&#x435;&#x440;&#x435;&#x437; &#x446;&#x435; &#x434;&#x443;&#x436;&#x435; &#x432;&#x430;&#x436;&#x43A;&#x43E; &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x431;&#x443;&#x434;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x438;&#x439;. &#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434;&#x440;&#x430;&#x437;&#x443;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x430; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x433;&#x43E;&#x434;&#x43E;&#x43C;.</p>
<p>&#x426;&#x456;&#x43B;&#x43A;&#x43E;&#x43C; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x449;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; ECMAScript &#x432;&#x438;&#x440;&#x456;&#x448;&#x430;&#x442;&#x44C; &#x446;&#x44E; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443;, &#x430; &#x43F;&#x43E;&#x43A;&#x438; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438; &#x442;&#x430; Node.js &#x432;&#x43D;&#x435;&#x441;&#x43B;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x438;, &#x449;&#x43E; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x430;&#x433;&#x430;&#x44E;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C; &#x443;&#x43D;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x438; &#x446;&#x456;&#x454;&#x457; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438;. &#x412;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x454; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; ECMAScript 6, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x454; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C;&#x438; &#x437;&#x430;&#x441;&#x43E;&#x431;&#x430;&#x43C;&#x438; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;.</p>
<h3 id="&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x430;-&#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;-&#x443;-nodejs">&#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x443; Node.js</h3>
<p>&#x423; Node.js &#x454; &#x434;&#x432;&#x456; &#x43F;&#x43E;&#x434;&#x456;&#x457; &#x43D;&#x430; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456; <code>process</code>, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x446;&#x456; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;:</p>
<ul>
<li><code>unhandledRejection</code> &#x2014; &#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43E;, &#x456; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x43E;&#x442;&#x44F;&#x433;&#x43E;&#x43C; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x443; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x43F;&#x43E;&#x434;&#x456;&#x439;;</li>
<li><code>rejectionHandled</code> &#x2014; &#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43E;, &#x456; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x443; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x43F;&#x43E;&#x434;&#x456;&#x439;.</li>
</ul>
<p>&#x426;&#x456; &#x43F;&#x43E;&#x434;&#x456;&#x457; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x456; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x449;&#x43E;&#x431; &#x457;&#x445; &#x43F;&#x43E;&#x454;&#x434;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x430;&#x433;&#x430;&#x43B;&#x43E; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438;, &#x44F;&#x43A;&#x456; &#x431;&#x443;&#x43B;&#x438; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x456; &#x456; &#x43D;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x456;.</p>
<p>&#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x43F;&#x43E;&#x434;&#x456;&#x457; <code>unhandledRejection</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x443; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; (rejection reason) (&#x437;&#x430;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;) &#x442;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x443; <code>unhandledRejection</code> &#x432; &#x434;&#x456;&#x457;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> rejected;

process.on(<span class="hljs-string">&quot;unhandledRejection&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">reason, promise</span>) </span>{
    <span class="hljs-built_in">console</span>.log(reason.message);            <span class="hljs-comment">// &quot;Explosion!&quot;</span>
    <span class="hljs-built_in">console</span>.log(rejected === promise);      <span class="hljs-comment">// true</span>
});

rejected = <span class="hljs-built_in">Promise</span>.reject(<span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Explosion!&quot;</span>));
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x441;&#x43B;&#x443;&#x445;&#x430;&#x454; &#x43F;&#x43E;&#x434;&#x456;&#x44E; <code>unhandledRejection</code> &#x442;&#x430; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x437; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;. &#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x442;&#x430; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E;.</p>
<p>&#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x43F;&#x43E;&#x434;&#x456;&#x457; <code>rejectionHandled</code> &#x43C;&#x430;&#x454; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;: &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> rejected;

process.on(<span class="hljs-string">&quot;rejectionHandled&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">promise</span>) </span>{
    <span class="hljs-built_in">console</span>.log(rejected === promise);              <span class="hljs-comment">// true</span>
});

rejected = <span class="hljs-built_in">Promise</span>.reject(<span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Explosion!&quot;</span>));

<span class="hljs-comment">// &#x447;&#x435;&#x43A;&#x430;&#x454;&#x43C;&#x43E;, &#x449;&#x43E;&#x431; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;</span>
setTimeout(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    rejected.catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
        <span class="hljs-built_in">console</span>.log(value.message);     <span class="hljs-comment">// &quot;Explosion!&quot;</span>
    });
}, <span class="hljs-number">1000</span>);
</code></pre>
<p>&#x422;&#x443;&#x442; &#x43F;&#x43E;&#x434;&#x456;&#x44F; <code>rejectionHandled</code> &#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;. &#x42F;&#x43A;&#x449;&#x43E; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x434;&#x43E; <code>rejected</code> &#x432;&#x456;&#x434;&#x440;&#x430;&#x437;&#x443; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; <code>rejected</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x442;&#x43E;&#x434;&#x456; &#x431; &#x43F;&#x43E;&#x434;&#x456;&#x44F; &#x43D;&#x435; &#x43E;&#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43B;&#x430;&#x441;&#x44C;. &#x422;&#x43E;&#x434;&#x456; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x432;&#x441;&#x44F; &#x431;&#x438; &#x43F;&#x440;&#x43E;&#x442;&#x44F;&#x433;&#x43E;&#x43C; &#x442;&#x43E;&#x433;&#x43E; &#x436; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x443; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x43F;&#x43E;&#x434;&#x456;&#x439;, &#x43A;&#x43E;&#x43B;&#x438; &#x431;&#x443;&#x432; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x438;&#x439; <code>rejected</code>.</p>
<p>&#x414;&#x43B;&#x44F; &#x43A;&#x440;&#x430;&#x449;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x43D;&#x456;&#x442;&#x43E;&#x440;&#x438;&#x43D;&#x433;&#x443; &#x437;&#x430; &#x43F;&#x43E;&#x442;&#x435;&#x43D;&#x446;&#x456;&#x439;&#x43D;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x438;&#x43C;&#x438; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x439;&#x442;&#x435; &#x43F;&#x43E;&#x434;&#x456;&#x457; <code>rejectionHandled</code> &#x442;&#x430; <code>unhandledRejection</code>, &#x449;&#x43E;&#x431; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x442;&#x438; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43F;&#x43E;&#x442;&#x435;&#x43D;&#x446;&#x456;&#x439;&#x43D;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x438;&#x445; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x44C;. &#x422;&#x43E;&#x434;&#x456; &#x437;&#x430;&#x447;&#x435;&#x43A;&#x430;&#x439;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x439;&#x442;&#x435; &#x446;&#x435;&#x439; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x437; &#x434;&#x435;&#x44F;&#x43A;&#x43E;&#x44E; &#x43F;&#x435;&#x440;&#x456;&#x43E;&#x434;&#x438;&#x447;&#x43D;&#x456;&#x441;&#x442;&#x44E;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> possiblyUnhandledRejections = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>();

<span class="hljs-comment">// &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435;&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x435;, &#x434;&#x43E;&#x434;&#x430;&#x454;&#x43C;&#x43E; &#x439;&#x43E;&#x433;&#x43E; &#x432; &#x43C;&#x430;&#x43F;&#x443;</span>
process.on(<span class="hljs-string">&quot;unhandledRejection&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">reason, promise</span>) </span>{
    possiblyUnhandledRejections.set(promise, reason);
});

process.on(<span class="hljs-string">&quot;rejectionHandled&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">promise</span>) </span>{
    possiblyUnhandledRejections.delete(promise);
});

setInterval(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{

    possiblyUnhandledRejections.forEach(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">reason, promise</span>) </span>{
        <span class="hljs-built_in">console</span>.log(reason.message ? reason.message : reason);

        <span class="hljs-comment">// &#x440;&#x43E;&#x431;&#x438;&#x43C;&#x43E; &#x449;&#x43E;&#x441;&#x44C;, &#x449;&#x43E;&#x431; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x446;&#x456; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;</span>
        handleRejection(promise, reason);
    });

    possiblyUnhandledRejections.clear();

}, <span class="hljs-number">60000</span>);
</code></pre>
<p>&#x426;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x439; &#x442;&#x440;&#x435;&#x43A;&#x435;&#x440; &#x434;&#x43B;&#x44F; &#x43D;&#x435;&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x438;&#x445; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x44C;. &#x412;&#x456;&#x43D; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43C;&#x430;&#x43F;&#x443; &#x434;&#x43B;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x442;&#x430; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D; &#x457;&#x445;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;. &#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x454; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43C;, &#x430; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x2014; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;. &#x429;&#x43E;&#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x434;&#x456;&#x44F; <code>unhandledRejection</code>, &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x442;&#x430; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x430; &#x439;&#x43E;&#x433;&#x43E; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x443; &#x43C;&#x430;&#x43F;&#x443;. &#x429;&#x43E;&#x440;&#x430;&#x437;&#x443;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>rejectionHandled</code>, &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x43C;&#x430;&#x43F;&#x438;. &#x412; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;, <code>possiblyUnhandledRejections</code> &#x43D;&#x430;&#x43F;&#x43E;&#x432;&#x43D;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430; &#x43E;&#x447;&#x438;&#x449;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x456;&#x434; &#x43F;&#x43E;&#x434;&#x456;&#x439;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F;. &#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>setInterval()</code> &#x43F;&#x435;&#x440;&#x456;&#x43E;&#x434;&#x438;&#x447;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x454; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x445; &#x43D;&#x435;&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x438;&#x445; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x44C; &#x442;&#x430; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x44C; (&#x432; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456;, &#x432;&#x438; &#x431;, &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x437;&#x430;&#x445;&#x43E;&#x442;&#x456;&#x43B;&#x438; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x446;&#x456; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;). &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x43E;&#x457; &#x43C;&#x430;&#x43F;&#x438; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x430;, &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x430; &#x43C;&#x430;&#x43F;&#x430;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x43F;&#x435;&#x440;&#x456;&#x43E;&#x434;&#x438;&#x447;&#x43D;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x442;&#x438; &#x44F;&#x43A;&#x456; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x443; &#x43D;&#x456;&#x439; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F;, &#x430; &#x446;&#x435; &#x43D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x437;&#x456; &#x441;&#x43B;&#x430;&#x431;&#x43A;&#x43E;&#x44E; &#x43C;&#x430;&#x43F;&#x43E;&#x44E;.</p>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x441;&#x442;&#x43E;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; Node.js, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x43C;&#x435;&#x445;&#x430;&#x43D;&#x456;&#x437;&#x43C; &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x43F;&#x440;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x456; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<h3 id="&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x430;-&#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;-&#x443;-&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x456;">&#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x456;</h3>
<p>&#x429;&#x43E;&#x431; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x442;&#x438; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43D;&#x435;&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x456; &#x43F;&#x43E;&#x434;&#x456;&#x457;, &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x443;&#x44E;&#x442;&#x44C; &#x434;&#x432;&#x456; &#x43F;&#x43E;&#x434;&#x456;&#x457;. &#x426;&#x456; &#x43F;&#x43E;&#x434;&#x456;&#x457; &#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C; <code>window</code> &#x442;&#x430; &#x454; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x430;&#x43D;&#x430;&#x43B;&#x43E;&#x433;&#x456;&#x447;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43E; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x436;&#x435; &#x443; Node.js:</p>
<ul>
<li><code>unhandledrejection</code> &#x2014; &#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43E;, &#x456; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x43E;&#x442;&#x44F;&#x433;&#x43E;&#x43C; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x443; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x43F;&#x43E;&#x434;&#x456;&#x439;;</li>
<li><code>rejectionhandled</code> &#x2014; &#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43E;, &#x456; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x443; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x43F;&#x43E;&#x434;&#x456;&#x439;.</li>
</ul>
<p>&#x406;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x44F; &#x443; Node.js &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x456; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x43F;&#x43E;&#x434;&#x456;&#x457;, &#x430; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x43F;&#x43E;&#x434;&#x456;&#x439; &#x443; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x43E;&#x434;&#x438;&#x43D; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;. &#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x43F;&#x43E;&#x434;&#x456;&#x439; &#x434;&#x43B;&#x44F; &#x446;&#x438;&#x445; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43D;&#x438;&#x445; &#x43F;&#x43E;&#x434;&#x456;&#x439; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x44E;&#x442;&#x44C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43F;&#x43E;&#x434;&#x456;&#x457; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438;:</p>
<ul>
<li><code>type</code> &#x2014; &#x456;&#x43C;&#x2019;&#x44F; &#x43F;&#x43E;&#x434;&#x456;&#x457; (<code>&quot;unhandledrejection&quot;</code> &#x430;&#x431;&#x43E; <code>&quot;rejectionhandled&quot;</code>);</li>
<li><code>promise</code> &#x2014; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;, &#x449;&#x43E; &#x431;&#x443;&#x432; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x439;;</li>
<li><code>reason</code> &#x2014; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;.</li>
</ul>
<p>&#x406;&#x43D;&#x448;&#x43E;&#x44E; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x443; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43D;&#x456;&#x439; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x457; &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; (<code>reason</code>) &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x43E;&#x445; &#x43F;&#x43E;&#x434;&#x456;&#x439;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> rejected;

<span class="hljs-built_in">window</span>.onunhandledrejection = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">event</span>) </span>{
    <span class="hljs-built_in">console</span>.log(event.type);                    <span class="hljs-comment">// &quot;unhandledrejection&quot;</span>
    <span class="hljs-built_in">console</span>.log(event.reason.message);          <span class="hljs-comment">// &quot;Explosion!&quot;</span>
    <span class="hljs-built_in">console</span>.log(rejected === event.promise);    <span class="hljs-comment">// true</span>
});

<span class="hljs-built_in">window</span>.onrejectionhandled = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">event</span>) </span>{
    <span class="hljs-built_in">console</span>.log(event.type);                    <span class="hljs-comment">// &quot;rejectionhandled&quot;</span>
    <span class="hljs-built_in">console</span>.log(event.reason.message);          <span class="hljs-comment">// &quot;Explosion!&quot;</span>
    <span class="hljs-built_in">console</span>.log(rejected === event.promise);    <span class="hljs-comment">// true</span>
});

rejected = <span class="hljs-built_in">Promise</span>.reject(<span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Explosion!&quot;</span>));
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454; &#x43E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x43F;&#x43E;&#x434;&#x456;&#x439; &#x447;&#x435;&#x440;&#x435;&#x437; &#x437;&#x430;&#x43F;&#x438;&#x441; DOM Level 0 &#x434;&#x43B;&#x44F; <code>onunhandledrejection</code> &#x442;&#x430; <code>onrejectionhandled</code>. (&#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>addEventListener(&quot;unhandledrejection&quot;)</code> &#x442;&#x430; <code>addEventListener(&quot;rejectionhandled&quot;)</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x43C; &#x442;&#x430;&#x43A; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;.) &#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x43F;&#x43E;&#x434;&#x456;&#x439; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x43F;&#x440;&#x43E; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;. &#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>type</code>, <code>promise</code> &#x442;&#x430; <code>reason</code> &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x43E;&#x445; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x43F;&#x43E;&#x434;&#x456;&#x439;.</p>
<p>&#x41A;&#x43E;&#x434; &#x434;&#x43B;&#x44F; &#x43C;&#x43E;&#x43D;&#x456;&#x442;&#x43E;&#x440;&#x438;&#x43D;&#x433;&#x443; &#x43D;&#x435;&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x438;&#x445; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x44C; &#x443; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x456; &#x434;&#x443;&#x436;&#x435; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x43D;&#x430; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x436;&#x435; &#x43A;&#x43E;&#x434; &#x434;&#x43B;&#x44F; Node.js:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> possiblyUnhandledRejections = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Map</span>();

<span class="hljs-comment">// &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435;&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x435;, &#x434;&#x43E;&#x434;&#x430;&#x454;&#x43C;&#x43E; &#x439;&#x43E;&#x433;&#x43E; &#x432; &#x43C;&#x430;&#x43F;&#x443;</span>
<span class="hljs-built_in">window</span>.onunhandledrejection = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">event</span>) </span>{
    possiblyUnhandledRejections.set(event.promise, event.reason);
};

<span class="hljs-built_in">window</span>.onrejectionhandled = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">event</span>) </span>{
    possiblyUnhandledRejections.delete(event.promise);
};

setInterval(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{

    possiblyUnhandledRejections.forEach(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">reason, promise</span>) </span>{
        <span class="hljs-built_in">console</span>.log(reason.message ? reason.message : reason);

        <span class="hljs-comment">// &#x440;&#x43E;&#x431;&#x438;&#x43C;&#x43E; &#x449;&#x43E;&#x441;&#x44C;, &#x449;&#x43E;&#x431; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x446;&#x456; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;</span>
        handleRejection(promise, reason);
    });

    possiblyUnhandledRejections.clear();

}, <span class="hljs-number">60000</span>);
</code></pre>
<p>&#x422;&#x430;&#x43A;&#x430; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x44F; &#x43C;&#x430;&#x439;&#x436;&#x435; &#x43D;&#x456;&#x447;&#x438;&#x43C; &#x43D;&#x435; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x457; &#x43D;&#x430; Node.js. &#x412;&#x43E;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x442;&#x43E;&#x439; &#x436;&#x435; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x434;&#x43B;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x442;&#x430; &#x457;&#x445;&#x43D;&#x456;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43C;&#x430;&#x43F;&#x456; &#x442;&#x430; &#x457;&#x445; &#x43F;&#x43E;&#x434;&#x430;&#x43B;&#x44C;&#x448;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;. &#x404;&#x434;&#x438;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x2014; &#x442;&#x435;, &#x44F;&#x43A; &#x43C;&#x438; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454;&#x43C;&#x43E; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x437; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x43F;&#x43E;&#x434;&#x456;&#x439;.</p>
<p>&#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x441;&#x432;&#x43E;&#x454;&#x440;&#x456;&#x434;&#x43D;&#x438;&#x43C; &#x442;&#x440;&#x44E;&#x43A;&#x43E;&#x43C;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x432;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x43F;&#x43E;&#x447;&#x430;&#x43B;&#x438; &#x432;&#x456;&#x434;&#x447;&#x443;&#x432;&#x430;&#x442;&#x438;, &#x44F;&#x43A;&#x438;&#x43C;&#x438; &#x43F;&#x43E;&#x442;&#x443;&#x436;&#x43D;&#x438;&#x43C;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438;. &#x427;&#x430;&#x441; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x442;&#x438; &#x434;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x433;&#x43E; &#x435;&#x442;&#x430;&#x43F;&#x443; &#x456; &#x43E;&#x431;&#x2019;&#x454;&#x434;&#x43D;&#x430;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x443; &#x43E;&#x434;&#x438;&#x43D; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43E;&#x43A;.</p>
<h2 id="&#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x438;-&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;">&#x41B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;</h2>
<p>&#x414;&#x43E; &#x446;&#x456;&#x454;&#x457; &#x43C;&#x438;&#x442;&#x456;, &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43B;&#x438;&#x448;&#x435; &#x43D;&#x435;&#x437;&#x43D;&#x430;&#x447;&#x43D;&#x438;&#x43C; &#x43F;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x43D;&#x430;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432; &#x442;&#x430; &#x444;&#x443;&#x43D;&#x446;&#x456;&#x457; <code>setTimeout()</code>, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x454; &#x449;&#x435; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x447;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x43F;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438;. &#x417;&#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x430;, &#x454; &#x440;&#x44F;&#x434; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x456;&#x432; &#x43E;&#x431;&#x2019;&#x454;&#x434;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x443; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x438;, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x443; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443;.</p>
<p>&#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>then()</code> &#x430;&#x431;&#x43E; <code>catch()</code> &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x456; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x449;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;. &#x426;&#x435;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x432;&#x438;&#x440;&#x456;&#x448;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; (resolve) &#x43B;&#x438;&#x448;&#x435; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x439; &#x431;&#x443;&#x432; &#x430;&#x431;&#x43E; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x439; (fulfilled), &#x430;&#x431;&#x43E; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x439; (rejected). &#x420;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">42</span>);
});

p1.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);
}).then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Finished&quot;</span>);
});
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x432;&#x438;&#x432;&#x435;&#x434;&#x435;:</p>
<pre><code>42
Finished
</code></pre><p>&#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>p1.then()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x443; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>then()</code>. &#x41D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; <code>then()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x435; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x440;&#x456;&#x448;&#x435;&#x43D;&#x43E;. &#x42F;&#x43A;&#x449;&#x43E; &#x431; &#x432;&#x438; &#x440;&#x43E;&#x437;&#x2019;&#x454;&#x434;&#x43D;&#x430;&#x43B;&#x438; &#x446;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;, &#x446;&#x435; &#x43C;&#x43E;&#x433;&#x43B;&#x43E; &#x431; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x442;&#x438; &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">42</span>);
});

<span class="hljs-keyword">let</span> p2 = p1.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);
})

p2.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Finished&quot;</span>);
});
</code></pre>
<p>&#x41F;&#x440;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x43C;&#x443; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x456;, &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; <code>p1.then()</code> &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>p2</code>, &#x430; &#x442;&#x43E;&#x434;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>p2.then()</code> &#x456; &#x434;&#x43E;&#x434;&#x430;&#x454; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;. &#x42F;&#x43A; &#x432;&#x438; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x437;&#x434;&#x43E;&#x433;&#x430;&#x434;&#x430;&#x442;&#x438;&#x441;&#x44C;, &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>p2.then()</code> &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;. &#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x446;&#x435;&#x439; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;.</p>
<h3 id="&#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x430;-&#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;">&#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;</h3>
<p>&#x41B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x434;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43B;&#x43E;&#x432;&#x438;&#x442;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43D;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x445; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">42</span>);
});

p1.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Boom!&quot;</span>);
}).catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">error</span>) </span>{
    <span class="hljs-built_in">console</span>.log(error.message);     <span class="hljs-comment">// &quot;Boom!&quot;</span>
});
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; <code>p1</code> &#x43A;&#x438;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;. &#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>catch()</code>, &#x44F;&#x43A;&#x438;&#x439; &#x454; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C; &#x443; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x443; &#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43C;&#x43E;&#x436;&#x435; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x446;&#x44E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x443; &#x441;&#x432;&#x456;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x44C;. &#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E; &#x446;&#x435; &#x441;&#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x43A;&#x438;&#x43D;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Explosion!&quot;</span>);
});

p1.catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">error</span>) </span>{
    <span class="hljs-built_in">console</span>.log(error.message);     <span class="hljs-comment">// &quot;Explosion!&quot;</span>
    <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>(<span class="hljs-string">&quot;Boom!&quot;</span>);
}).catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">error</span>) </span>{
    <span class="hljs-built_in">console</span>.log(error.message);     <span class="hljs-comment">// &quot;Boom!&quot;</span>
});
</code></pre>
<p>&#x422;&#x443;&#x442; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x446;&#x44C; &#x43A;&#x438;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443; &#x456; &#x442;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; <code>p1</code>. &#x422;&#x43E;&#x434;&#x456; &#x446;&#x435;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x43A;&#x438;&#x434;&#x430;&#x454; &#x449;&#x435; &#x43E;&#x434;&#x43D;&#x443; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A;&#x443; &#x43B;&#x43E;&#x432;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;. &#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x443; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x443; &#x437;&#x43D;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x440;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x443; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;&#x445; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x430;.</p>
<p>I&gt; &#x417;&#x430;&#x432;&#x436;&#x434;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x43A;&#x456;&#x43D;&#x446;&#x456; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x430; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;, &#x430;&#x431;&#x438; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x435;&#x432;&#x43D;&#x438;&#x43C;, &#x449;&#x43E; &#x432;&#x438; &#x43E;&#x431;&#x43E;&#x431;&#x43B;&#x44F;&#x454;&#x442;&#x435; &#x432;&#x441;&#x456; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;, &#x44F;&#x43A;&#x456; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43D;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x438;.</p>
<h3 id="&#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F;-&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;-&#x443;-&#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x443;-&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;">&#x41F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x443; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x443; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;</h3>
<p>&#x406;&#x43D;&#x448;&#x438;&#x43C; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x43E;&#x43C; &#x443; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x430;&#x445; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x432;&#x456;&#x434; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x434;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x433;&#x43E;. &#x412;&#x438; &#x432;&#x436;&#x435; &#x431;&#x430;&#x447;&#x438;&#x43B;&#x438;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; <code>resolve()</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x446;&#x44F;, &#x431;&#x443;&#x434;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x435; &#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x438;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x443; &#x434;&#x430;&#x43D;&#x438;&#x445; &#x43F;&#x43E; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x443; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x432;&#x448;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;. &#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">42</span>);
});

p1.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);         <span class="hljs-comment">// &quot;42&quot;</span>
    <span class="hljs-keyword">return</span> value + <span class="hljs-number">1</span>;
}).then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);         <span class="hljs-comment">// &quot;43&quot;</span>
});
</code></pre>
<p>&#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; <code>p1</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>value + 1</code> &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x456;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>value</code> &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454; 42 (&#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x446;&#x44F;), &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; 43. &#x426;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x443; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x44C;.</p>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;. &#x41F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x43D; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x456;&#x43D; &#x446;&#x435; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C;, &#x442;&#x43E; &#x446;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x443; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x443;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    reject(<span class="hljs-number">42</span>);
});

p1.catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.log(value);         <span class="hljs-comment">// &quot;42&quot;</span>
    <span class="hljs-keyword">return</span> value + <span class="hljs-number">1</span>;
}).then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-comment">// &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.log(value);         <span class="hljs-comment">// &quot;43&quot;</span>
});
</code></pre>
<p>&#x422;&#x443;&#x442; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x441;&#x44C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; <code>reject()</code> &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; 42. &#x426;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;, &#x430; &#x442;&#x430;&#x43C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>value + 1</code>. &#x41D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x445;&#x43E;&#x447;&#x430; &#x446;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x437; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;, &#x432;&#x43E;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x443; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x443; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x443;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x456; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x438; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43E;&#x43A; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;, &#x44F;&#x43A;&#x449;&#x43E; &#x441;&#x442;&#x430;&#x43B;&#x430;&#x441;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x43C;&#x443; &#x437; &#x43D;&#x438;&#x445;.</p>
<h3 id="&#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F;-&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;-&#x443;-&#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x430;&#x445;-&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;">&#x41F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x443; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x430;&#x445; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;</h3>
<p>&#x41F;&#x43E;&#x432;&#x435;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x43C;&#x456;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x434;&#x430;&#x43D;&#x456; &#x43C;&#x456;&#x436; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;&#x43C;&#x438;, &#x43F;&#x440;&#x43E;&#x442;&#x435;, &#x449;&#x43E;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x442;&#x435; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;? &#x42F;&#x43A;&#x449;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43C;, &#x442;&#x43E;&#x434;&#x456; &#x437;&#x43D;&#x430;&#x434;&#x43E;&#x431;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x449;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x43A;&#x440;&#x43E;&#x43A; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x44F;&#x43A; &#x437; &#x43D;&#x438;&#x43C; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x438;&#x441;&#x44C;. &#x420;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">42</span>);
});

<span class="hljs-keyword">let</span> p2 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">43</span>);
});

p1.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// 42</span>
    <span class="hljs-keyword">return</span> p2;
}).then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-comment">// &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// 43</span>
});
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, <code>p1</code> &#x43F;&#x43B;&#x430;&#x43D;&#x443;&#x454; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; 42. &#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; <code>p1</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>p2</code>, &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x436;&#x435; &#x432;&#x438;&#x440;&#x456;&#x448;&#x435;&#x43D;&#x438;&#x439; (resolved). &#x414;&#x440;&#x443;&#x433;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; <code>p2</code> &#x432;&#x436;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x439;. &#x42F;&#x43A;&#x449;&#x43E; &#x431; <code>p2</code> &#x431;&#x443;&#x432; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x43C;, &#x442;&#x43E;&#x431;&#x456; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; (&#x437;&#x430; &#x43D;&#x430;&#x44F;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456;) &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x432;&#x441;&#x44F; &#x431; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x430;&#x442;&#x435;&#x440;&#x43D;&#x456; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x43F;&#x43E;&#x43C;&#x456;&#x442;&#x438;&#x442;&#x438;, &#x449;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435; &#x434;&#x43E; <code>p2</code>, &#x430; &#x434;&#x43E; &#x442;&#x440;&#x435;&#x442;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;. &#x414;&#x440;&#x443;&#x433;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x442;&#x440;&#x435;&#x442;&#x44C;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;, &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x439; &#x434;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">42</span>);
});

<span class="hljs-keyword">let</span> p2 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">43</span>);
});

<span class="hljs-keyword">let</span> p3 = p1.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// 42</span>
    <span class="hljs-keyword">return</span> p2;
});

p3.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-comment">// &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// 43</span>
});
</code></pre>
<p>&#x422;&#x443;&#x442; &#x447;&#x456;&#x442;&#x43A;&#x43E; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x43E;, &#x449;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x440;&#x456;&#x43F;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; <code>p3</code>, &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; <code>p2</code>. &#x426;&#x435; &#x43C;&#x430;&#x43B;&#x435;&#x43D;&#x44C;&#x43A;&#x430;, &#x430;&#x43B;&#x435; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x430; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x44C;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435;&#x442;&#x44C;&#x441;&#x44F;, &#x44F;&#x43A;&#x449;&#x43E; <code>p2</code> &#x431;&#x443;&#x434;&#x435; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43E;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">42</span>);
});

<span class="hljs-keyword">let</span> p2 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    reject(<span class="hljs-number">43</span>);
});

p1.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// 42</span>
    <span class="hljs-keyword">return</span> p2;
}).then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-comment">// &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435;&#x442;&#x44C;&#x441;&#x44F;</span>
});
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x456;&#x43A;&#x43E;&#x43B;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; <code>p2</code> &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x439;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">42</span>);
});

<span class="hljs-keyword">let</span> p2 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    reject(<span class="hljs-number">43</span>);
});

p1.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-comment">// &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// 42</span>
    <span class="hljs-keyword">return</span> p2;
}).catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-comment">// &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// 43</span>
});
</code></pre>
<p>&#x422;&#x443;&#x442; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C;, &#x437; &#x44F;&#x43A;&#x438;&#x43C; <code>p2</code> &#x431;&#x443;&#x432; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x439;. &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; 43 &#x437; <code>p2</code> &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x443; &#x446;&#x435;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x41F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x438;&#x445; &#x437; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454; &#x442;&#x43E;&#x433;&#x43E;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x446;&#x44C; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;. &#x421;&#x43F;&#x435;&#x440;&#x448;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x446;&#x44C; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;, &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x432;&#x435;&#x446;&#x44C; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x456; &#x442;&#x430;&#x43A; &#x434;&#x430;&#x43B;&#x456;. &#x41F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x434;&#x430;&#x454; &#x432;&#x430;&#x43C; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x456; &#x43D;&#x430; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x456;&#x434;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">42</span>);
});

p1.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// 42</span>

    <span class="hljs-comment">// &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x43C;&#x43E; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;</span>
    <span class="hljs-keyword">let</span> p2 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
        resolve(<span class="hljs-number">43</span>);
    });

    <span class="hljs-keyword">return</span> p2
}).then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// 43</span>
});
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; <code>p1</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x435;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x434;&#x43E;&#x43A;&#x438; <code>p2</code> &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43E;. &#x422;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x439;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x43C; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x437;&#x430;&#x447;&#x435;&#x43A;&#x430;&#x442;&#x438;, &#x434;&#x43E;&#x43A;&#x438; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x441;&#x442;&#x430;&#x43D;&#x435; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x43C; (settled).</p>
<h2 id="&#x440;&#x43E;&#x431;&#x43E;&#x442;&#x430;-&#x437;-&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x43C;&#x430;-&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;&#x43C;&#x438;">&#x420;&#x43E;&#x431;&#x43E;&#x442;&#x430; &#x437; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x43C;&#x430; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;&#x43C;&#x438;</h2>
<p>&#x414;&#x43E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x443; &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x443; &#x446;&#x456;&#x439; &#x433;&#x43B;&#x430;&#x432;&#x456; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x432; &#x43B;&#x438;&#x448;&#x435; &#x437; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43A;&#x43E;&#x44E; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x437;&#x430; &#x440;&#x430;&#x437;. &#x41E;&#x434;&#x43D;&#x430;&#x43A; &#x447;&#x430;&#x441;&#x43E;&#x43C;, &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x434;&#x430;&#x43B;&#x44C;&#x448;&#x438;&#x445; &#x434;&#x456;&#x439;, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x441;&#x43B;&#x456;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x435;&#x441;&#x43E;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;. ECMAScript 6 &#x43D;&#x430;&#x434;&#x430;&#x454; &#x434;&#x432;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;: <code>Promise.all()</code> &#x442;&#x430; <code>Promise.race()</code>.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-promiseall">&#x41C;&#x435;&#x442;&#x43E;&#x434; Promise.all()</h3>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Promise.all()</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x43E;&#x434;&#x438;&#x43D; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x44F;&#x43A;&#x438;&#x439; &#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43E;&#x43C; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C;) &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;. &#x412;&#x456;&#x43D; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x440;&#x456;&#x448;&#x435;&#x43D;&#x438;&#x439; (resolved) &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x440;&#x456;&#x448;&#x435;&#x43D;&#x438;&#x439;. &#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x2013;&#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x431;&#x443;&#x434;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x439; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x441;&#x456; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x443; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x456; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x456;, &#x44F;&#x43A; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">42</span>);
});

<span class="hljs-keyword">let</span> p2 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">43</span>);
});

<span class="hljs-keyword">let</span> p3 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">44</span>);
});

<span class="hljs-keyword">let</span> p4 = <span class="hljs-built_in">Promise</span>.all([p1, p2, p3]);

p4.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Array</span>.isArray(value));  <span class="hljs-comment">// true</span>
    <span class="hljs-built_in">console</span>.log(value[<span class="hljs-number">0</span>]);              <span class="hljs-comment">// 42</span>
    <span class="hljs-built_in">console</span>.log(value[<span class="hljs-number">1</span>]);              <span class="hljs-comment">// 43</span>
    <span class="hljs-built_in">console</span>.log(value[<span class="hljs-number">2</span>]);              <span class="hljs-comment">// 44</span>
});
</code></pre>
<p>&#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x442;&#x443;&#x442; &#x432;&#x438;&#x440;&#x456;&#x448;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x43C;. &#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>Promise.all()</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; <code>p4</code>, &#x44F;&#x43A;&#x438;&#x439; &#x431;&#x443;&#x434;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43E;, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; <code>p1</code>, <code>p2</code> &#x442;&#x430; <code>p3</code> &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x456;. &#x420;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; <code>p4</code> &#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;&#x432;: 42, 43 &#x442;&#x430; 44. &#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x432;&#x438;&#x440;&#x456;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43F;&#x456;&#x432;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x442;&#x430; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x443;.</p>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x445;&#x43E;&#x447; &#x43E;&#x434;&#x438;&#x43D; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x437; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x438;&#x445; &#x443; <code>Promise.all()</code> &#x431;&#x443;&#x434;&#x435; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43E;, &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x2013;&#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43D;&#x435;&#x433;&#x430;&#x439;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x431;&#x435;&#x437; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">42</span>);
});

<span class="hljs-keyword">let</span> p2 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    reject(<span class="hljs-number">43</span>);
});

<span class="hljs-keyword">let</span> p3 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">44</span>);
});

<span class="hljs-keyword">let</span> p4 = <span class="hljs-built_in">Promise</span>.all([p1, p2, p3]);

p4.catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Array</span>.isArray(value))   <span class="hljs-comment">// false</span>
    <span class="hljs-built_in">console</span>.log(value);                 <span class="hljs-comment">// 43</span>
});
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, <code>p2</code> &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; 43. &#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; <code>p4</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x438;&#x442;&#x442;&#x454;&#x432;&#x43E; &#x431;&#x435;&#x437; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x437;&#x430;&#x432;&#x430;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; <code>p1</code> &#x430;&#x431;&#x43E; <code>p3</code> (&#x432;&#x43E;&#x43D;&#x438; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x430;&#x442;&#x44C; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43D;&#x430; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;, &#x43F;&#x440;&#x43E;&#x442;&#x435; <code>p4</code> &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43D;&#x430; &#x43D;&#x438;&#x445; &#x447;&#x435;&#x43A;&#x430;&#x442;&#x438;).</p>
<p>&#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454; &#x454;&#x434;&#x438;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;, &#x44F;&#x43A;&#x438;&#x439; &#x431;&#x443;&#x432; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x439;. &#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x432; 43, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x454; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44E; &#x437; <code>p2</code>.</p>
<h3 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-promiserace">&#x41C;&#x435;&#x442;&#x43E;&#x434; Promise.race()</h3>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Promise.race()</code> &#x43D;&#x430;&#x434;&#x430;&#x454; &#x434;&#x435;&#x449;&#x43E; &#x456;&#x43D;&#x448;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x43C;&#x43E;&#x43D;&#x456;&#x442;&#x43E;&#x440;&#x438;&#x43D;&#x433;&#x443; &#x437;&#x430; &#x433;&#x440;&#x443;&#x43F;&#x43E;&#x44E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;. &#x426;&#x435;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x456;&#x442;&#x435;&#x440;&#x430;&#x431;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x437; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;&#x43C;&#x438;, &#x437;&#x430; &#x44F;&#x43A;&#x438;&#x43C;&#x438; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x441;&#x43B;&#x456;&#x434;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x442;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x438;&#x442;&#x44C;&#x441;&#x44F;, &#x44F;&#x43A; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x434;&#x438;&#x43D; &#x437; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x447;&#x435;&#x43A;&#x430;&#x442;&#x438; &#x43D;&#x430; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x44F;&#x43A; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Promise.all()</code>, &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Promise.race()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x44F;&#x43A; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x445;&#x43E;&#x447; &#x43E;&#x434;&#x438;&#x43D; &#x437; &#x443;&#x441;&#x456;&#x445; &#x437; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x438;&#x442;&#x44C;&#x441;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-built_in">Promise</span>.resolve(<span class="hljs-number">42</span>);

<span class="hljs-keyword">let</span> p2 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">43</span>);
});

<span class="hljs-keyword">let</span> p3 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">44</span>);
});

<span class="hljs-keyword">let</span> p4 = <span class="hljs-built_in">Promise</span>.race([p1, p2, p3]);

p4.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// 42</span>
});
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, <code>p1</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x442;&#x43E;&#x434;&#x456; &#x44F;&#x43A; &#x456;&#x43D;&#x448;&#x456; &#x432;&#x456;&#x434;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;. &#x422;&#x43E;&#x434;&#x456; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; <code>p4</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; 42 &#x442;&#x430; &#x456;&#x433;&#x43D;&#x43E;&#x440;&#x443;&#x454; &#x456;&#x43D;&#x448;&#x456; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438;. &#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438;, &#x44F;&#x43A;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>Promise.race()</code>, &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x43F;&#x435;&#x440;&#x435;&#x431;&#x443;&#x432;&#x430;&#x44E;&#x442;&#x44C; &#x443; &#x433;&#x43E;&#x43D;&#x438;&#x442;&#x432;&#x456;, &#x445;&#x442;&#x43E; &#x437; &#x43D;&#x438;&#x445; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x44C;&#x441;&#x44F;. &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x441;&#x442;&#x430;&#x43D; &#xAB;fulfilled&#xBB; (&#x431;&#x443;&#x434;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x43C;), &#x442;&#x43E;&#x434;&#x456; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;, &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x441;&#x442;&#x430;&#x43D; &#xAB;fulfilled&#xBB;. &#x42F;&#x43A;&#x449;&#x43E; &#x436; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x441;&#x442;&#x430;&#x43D; &#xAB;rejected&#xBB; (&#x431;&#x443;&#x434;&#x435; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x43C;), &#x442;&#x43E;&#x434;&#x456; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x441;&#x442;&#x430;&#x43D; &#xAB;rejected&#xBB;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x437; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">42</span>);
});

<span class="hljs-keyword">let</span> p2 = <span class="hljs-built_in">Promise</span>.reject(<span class="hljs-number">43</span>);

<span class="hljs-keyword">let</span> p3 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">44</span>);
});

<span class="hljs-keyword">let</span> p4 = <span class="hljs-built_in">Promise</span>.race([p1, p2, p3]);

p4.catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);     <span class="hljs-comment">// 43</span>
});
</code></pre>
<p>&#x422;&#x443;&#x442; <code>p4</code> &#x454; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x43C; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>Promise.race()</code>, &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; <code>p2</code> &#x432;&#x436;&#x435; &#x43C;&#x430;&#x454; &#x441;&#x442;&#x430;&#x43D; &#xAB;rejected&#xBB;. &#x41D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x445;&#x43E;&#x447;&#x430; &#x439; <code>p1</code> &#x442;&#x430; <code>p3</code> &#x454; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x43C;&#x438;, &#x457;&#x445;&#x43D;&#x456; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x438; &#x456;&#x433;&#x43D;&#x43E;&#x440;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; <code>p2</code> &#x43F;&#x435;&#x440;&#x435;&#x439;&#x448;&#x43E;&#x432; &#x443; &#x441;&#x442;&#x430;&#x43D; &#xAB;rejected&#xBB;.</p>
<h2 id="&#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x432;&#x456;&#x434;-&#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;">&#x41D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;</h2>
<p>&#x42F;&#x43A; &#x456; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x43C;&#x438; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C;&#x438; &#x442;&#x438;&#x43F;&#x430;&#x43C;&#x438;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x438; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x438;&#x445; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;. &#x426;&#x435; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x456; &#x432;&#x430;&#x440;&#x456;&#x430;&#x43D;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;. &#x41F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x449;&#x43E; &#x432;&#x430;&#x43C; &#x445;&#x43E;&#x442;&#x456;&#x43B;&#x43E;&#x441;&#x44F; &#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x449;&#x43E; &#x43C;&#x430;&#x432; &#x431;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>success()</code> &#x442;&#x430; <code>failure()</code> &#x43D;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x447;&#x443; &#x434;&#x43E; &#x437;&#x432;&#x438;&#x447;&#x43D;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; <code>then()</code> &#x442;&#x430; <code>catch()</code>. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyPromise</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Promise</span> </span>{

    <span class="hljs-comment">// &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x43C;&#x43E; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;</span>

    success(resolve, reject) {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.then(resolve, reject);
    }

    failure(reject) {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.catch(reject);
    }

}

<span class="hljs-keyword">let</span> promise = <span class="hljs-keyword">new</span> MyPromise(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">42</span>);
});

promise.success(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);             <span class="hljs-comment">// 42</span>
}).failure(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);
});
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, <code>MyPromise</code> &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; <code>Promise</code> &#x442;&#x430; &#x43C;&#x430;&#x454; &#x434;&#x432;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>success()</code> &#x456;&#x43C;&#x456;&#x442;&#x443;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>resolve()</code>, &#x430; <code>failure()</code> &#x2014; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>reject()</code>.</p>
<p>&#x41E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; <code>this</code> &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x43E;&#x43D;&#x438; &#x456;&#x43C;&#x456;&#x442;&#x443;&#x44E;&#x442;&#x44C;. &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x442;&#x430;&#x43A;&#x456; &#x436;, &#x44F;&#x43A; &#x443; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E;, &#x43E;&#x434;&#x43D;&#x430;&#x43A; &#x442;&#x435;&#x43F;&#x435;&#x440; &#x432;&#x438;, &#x44F;&#x43A;&#x449;&#x43E; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435;, &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x438; <code>success()</code> &#x442;&#x430; <code>failure()</code>.</p>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x443;&#x441;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F;, &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>MyPromise.resolve()</code>, <code>MyPromise.reject()</code>, <code>MyPromise.race()</code> &#x442;&#x430; <code>MyPromise.all()</code> &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x440;&#x438;&#x441;&#x443;&#x442;&#x43D;&#x456; &#x443; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;. &#x41E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x434;&#x432;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x448;&#x456; &#x434;&#x432;&#x430; &#x454; &#x434;&#x435;&#x449;&#x43E; &#x456;&#x43D;&#x448;&#x438;&#x43C;&#x438;.</p>
<p>&#x406; <code>MyPromise.resolve()</code>, &#x456; <code>MyPromise.reject()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x44C; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; <code>MyPromise</code> &#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x446;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>Symbol.species</code> (&#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x430; &#x443; &#x413;&#x43B;&#x430;&#x432;&#x456; 9) &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x438;&#x43F;&#x443; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;, &#x44F;&#x43A;&#x438;&#x439; &#x442;&#x440;&#x435;&#x431;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438;. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x434;&#x43E; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x437; &#x446;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432;, &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x440;&#x456;&#x448;&#x435;&#x43D;&#x438;&#x439; &#x430;&#x431;&#x43E; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x438;&#x439;, &#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; &#x43D;&#x43E;&#x432;&#x438;&#x439; <code>MyPromise</code>, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x457;&#x442;&#x438; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> p1 = <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
    resolve(<span class="hljs-number">42</span>);
});

<span class="hljs-keyword">let</span> p2 = MyPromise.resolve(p1);
p2.success(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
    <span class="hljs-built_in">console</span>.log(value);         <span class="hljs-comment">// 42</span>
});

<span class="hljs-built_in">console</span>.log(p2 <span class="hljs-keyword">instanceof</span> MyPromise);   <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x422;&#x443;&#x442; <code>p1</code> &#x454; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x43C; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43C;, &#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>MyPromise.resolve()</code>. &#x420;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;, <code>p2</code>, &#x454; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x43C; <code>MyPromise</code>, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; <code>p1</code>, &#x44F;&#x43A;&#x435; &#x431;&#x443;&#x43B;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x43E; &#x443; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; <code>MyPromise</code> &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>MyPromise.resolve()</code> &#x430;&#x431;&#x43E; <code>MyPromise.reject()</code>, &#x432;&#x456;&#x43D; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x438;&#x439; &#x431;&#x435;&#x437; &#x432;&#x438;&#x440;&#x456;&#x448;&#x435;&#x43D;&#x43D;&#x44F;. &#x423; &#x432;&#x441;&#x456;&#x445; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x430;&#x445; &#x446;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x456; <code>Promise.resolve()</code> &#x442;&#x430; <code>Promise.reject()</code>.</p>
<h3 id="&#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x439;-&#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;-&#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;">&#x410;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;</h3>
<p>&#x423; &#x413;&#x43B;&#x430;&#x432;&#x456; 8 &#x44F; &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x432;&#x456;&#x432; &#x43F;&#x440;&#x43E; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x442;&#x430; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x432;, &#x44F;&#x43A; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x457;&#x445; &#x434;&#x43B;&#x44F; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> fs = <span class="hljs-built_in">require</span>(<span class="hljs-string">&quot;fs&quot;</span>);

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">run</span>(<span class="hljs-params">taskDef</span>) </span>{

    <span class="hljs-comment">// &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x43C;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x443;&#x441;&#x44E;&#x434;&#x438;</span>
    <span class="hljs-keyword">let</span> task = taskDef();

    <span class="hljs-comment">// &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x43C;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-keyword">let</span> result = task.next();

    <span class="hljs-comment">// &#x440;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x441;&#x442;&#x456;&#x439;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; next()</span>
    <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">step</span>(<span class="hljs-params"></span>) </span>{

        <span class="hljs-comment">// &#x44F;&#x43A;&#x449;&#x43E; &#x454; &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;</span>
        <span class="hljs-keyword">if</span> (!result.done) {
            <span class="hljs-keyword">if</span> (<span class="hljs-keyword">typeof</span> result.value === <span class="hljs-string">&quot;function&quot;</span>) {
                result.value(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err, data</span>) </span>{
                    <span class="hljs-keyword">if</span> (err) {
                        result = task.throw(err);
                        <span class="hljs-keyword">return</span>;
                    }

                    result = task.next(data);
                    step();
                });
            } <span class="hljs-keyword">else</span> {
                result = task.next(result.value);
                step();
            }

        }
    }

    <span class="hljs-comment">// &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x43C;&#x43E; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;</span>
    step();

}

<span class="hljs-comment">// &#x412;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x43C;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x44F;&#x43A;&#x430; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x437; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x43E;&#x43C; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;</span>

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">readFile</span>(<span class="hljs-params">filename</span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">callback</span>) </span>{
        fs.readFile(filename, callback);
    };
}

<span class="hljs-comment">// &#x417;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x454;&#x43C;&#x43E; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;</span>

run(<span class="hljs-function"><span class="hljs-keyword">function</span>*(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">let</span> contents = <span class="hljs-keyword">yield</span> readFile(<span class="hljs-string">&quot;config.json&quot;</span>);
    doSomethingWith(contents);
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Done&quot;</span>);
});
</code></pre>
<p>&#x404; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x43D;&#x438;&#x445; &#x43C;&#x456;&#x441;&#x446;&#x44C; &#x443; &#x446;&#x456;&#x439; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x457;. &#x41F;&#x43E;&#x2013;&#x43F;&#x435;&#x440;&#x448;&#x435;, &#x43E;&#x433;&#x43E;&#x440;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x457;&#x457; &#x43C;&#x43E;&#x436;&#x435; &#x434;&#x435;&#x449;&#x43E; &#x437;&#x430;&#x43F;&#x43B;&#x443;&#x442;&#x430;&#x442;&#x438; (&#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x441;&#x430;&#x43C;&#x435; &#x446;&#x435; &#x440;&#x435;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x454; &#x437;&#x430;&#x43F;&#x43B;&#x443;&#x442;&#x430;&#x43D;&#x438;&#x43C;). &#x41F;&#x43E;&#x2013;&#x434;&#x440;&#x443;&#x433;&#x435;, &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x443; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x438;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x449;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x43C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x432;&#x456;&#x434; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x43D;&#x435; &#x454; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x43C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x43E;&#x43C;.</p>
<p>&#x417; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;&#x43C;&#x438; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x43D;&#x43E; &#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x442;&#x438; &#x442;&#x430; &#x443;&#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x442;&#x438; &#x446;&#x435;&#x439; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;, &#x44F;&#x43A;&#x449;&#x43E; &#x43A;&#x43E;&#x436;&#x43D;&#x430; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x430; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;. &#x426;&#x435;&#x439; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x434;&#x430;&#x454; &#x432;&#x430;&#x43C; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x43D;&#x43E; &#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x442;&#x438; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;. &#x41E;&#x441;&#x44C; &#x43E;&#x434;&#x438;&#x43D; &#x437;&#x456; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x456;&#x432;, &#x44F;&#x43A; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x442;&#x438; &#x446;&#x435;&#x439; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> fs = <span class="hljs-built_in">require</span>(<span class="hljs-string">&quot;fs&quot;</span>);

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">run</span>(<span class="hljs-params">taskDef</span>) </span>{

    <span class="hljs-comment">// &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x43C;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x443;&#x441;&#x44E;&#x434;&#x438;</span>
    <span class="hljs-keyword">let</span> task = taskDef();

    <span class="hljs-comment">// &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x43C;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;</span>
    <span class="hljs-keyword">let</span> result = task.next();

    <span class="hljs-comment">// &#x440;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x441;&#x442;&#x456;&#x439;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; next()</span>
    (<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">step</span>(<span class="hljs-params"></span>) </span>{

        <span class="hljs-comment">// &#x44F;&#x43A;&#x449;&#x43E; &#x454; &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;</span>
        <span class="hljs-keyword">if</span> (!result.done) {

            <span class="hljs-comment">// &#x432;&#x438;&#x440;&#x456;&#x448;&#x443;&#x454;&#x43C;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x449;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x446;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C;</span>
            <span class="hljs-keyword">let</span> promise = <span class="hljs-built_in">Promise</span>.resolve(result.value);
            promise.then(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">value</span>) </span>{
                result = task.next(value);
                step();
            }).catch(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">error</span>) </span>{
                result = task.throw(error);
                step();
            });
        }
    }());
}

<span class="hljs-comment">// &#x412;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x43C;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x44F;&#x43A;&#x430; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x437; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x43E;&#x43C; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;</span>

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">readFile</span>(<span class="hljs-params">filename</span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">Promise</span>(<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">resolve, reject</span>) </span>{
        fs.readFile(filename, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">err, contents</span>) </span>{
            <span class="hljs-keyword">if</span> (err) {
                reject(err);
            } <span class="hljs-keyword">else</span> {
                resolve(contents);
            }
        });
    });
}

<span class="hljs-comment">// &#x417;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x454;&#x43C;&#x43E; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;</span>

run(<span class="hljs-function"><span class="hljs-keyword">function</span>*(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">let</span> contents = <span class="hljs-keyword">yield</span> readFile(<span class="hljs-string">&quot;config.json&quot;</span>);
    doSomethingWith(contents);
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Done&quot;</span>);
});
</code></pre>
<p>&#x423; &#x446;&#x456;&#x439; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; &#x43A;&#x43E;&#x434;&#x443;, &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>run()</code> &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;. &#x412;&#x43E;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; <code>task.next()</code>, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x430;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F; &#x456; &#x440;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; <code>step()</code>, &#x434;&#x43E;&#x43A;&#x438; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43D;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x438;&#x442;&#x44C; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443;.</p>
<p>&#x412;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; <code>step()</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x454; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x430;, &#x44F;&#x43A;&#x443; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;, &#x442;&#x43E;&#x434;&#x456; <code>result.done</code> &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454; <code>false</code>. &#x423; &#x446;&#x456;&#x439; &#x442;&#x43E;&#x447;&#x446;&#x456;, <code>result.value</code> &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43C;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x43C;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x43C;&#x43E; <code>Promise.resolve()</code> &#x43D;&#x430; &#x442;&#x43E;&#x439; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43E;&#x43A;, &#x44F;&#x43A;&#x449;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;. (&#x41F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x430;&#x439;&#x442;&#x435;, &#x449;&#x43E; <code>Promise.resolve()</code> &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x43A;&#x438;&#x434;&#x430;&#x454; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x430; &#x432;&#x441;&#x456; &#x456;&#x43D;&#x448;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x433;&#x43E;&#x440;&#x442;&#x430;&#x454; &#x443; &#x43D;&#x44C;&#x43E;&#x433;&#x43E;.) &#x422;&#x43E;&#x434;&#x456;, &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x449;&#x43E;&#x431; &#x434;&#x456;&#x441;&#x442;&#x430;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430; &#x456; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x446;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x430;&#x437;&#x430;&#x434; &#x434;&#x43E; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;. &#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, <code>result</code> &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x435; &#x447;&#x435;&#x440;&#x435;&#x437; <code>yield</code> &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x43F;&#x435;&#x440;&#x435;&#x434; &#x442;&#x438;&#x43C; &#x44F;&#x43A; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>step()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x447;&#x435; &#x441;&#x430;&#x43C;&#x430; &#x441;&#x435;&#x431;&#x435;.</p>
<p>&#x41E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x456; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x438; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>task.throw()</code> &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454; &#x446;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438; &#x43D;&#x430;&#x437;&#x430;&#x434; &#x443; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x456; &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430; &#x43B;&#x43E;&#x432;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;, <code>result</code> &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x435; &#x447;&#x435;&#x440;&#x435;&#x437; <code>yield</code> &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F;, <code>step()</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; <code>catch()</code> &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x443;.</p>
<p>&#x422;&#x430;&#x43A;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>run()</code> &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; <code>yield</code> &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x43C; &#x43A;&#x43E;&#x434;&#x43E;&#x43C;, &#x456; &#x43F;&#x440;&#x438; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; (&#x430;&#x431;&#x43E; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438;) &#x432;&#x456;&#x434; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;. &#x411;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x43E;&#x433;&#x43E;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43C;&#x43E;&#x436;&#x435; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x449;&#x43E;&#x441;&#x44C; &#x456;&#x43D;&#x448;&#x435; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x430;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x456; &#x442;&#x430; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x437; <code>yield</code>, &#x456; &#x432;&#x430;&#x43C; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x44F;&#x442;&#x438;, &#x447;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x43E;&#x43C;.</p>
<p>&#x404;&#x434;&#x438;&#x43D;&#x430; &#x432;&#x438;&#x43C;&#x43E;&#x433;&#x430;: &#x449;&#x43E;&#x431; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x44F;&#x43A; &#x43E;&#x442; <code>readFile()</code>, &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x441;&#x432;&#x456;&#x439; &#x441;&#x442;&#x430;&#x43D;. &#x414;&#x43B;&#x44F; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; Node.js &#x446;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x446;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x449;&#x43E;&#x431; &#x432;&#x43E;&#x43D;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456;&#x445; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x456;&#x432;.</p>
<h3 id="a-&#x43C;&#x430;&#x439;&#x431;&#x443;&#x442;&#x43D;&#x454;-&#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E;-&#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x443;-&#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;">A&gt; &#x41C;&#x430;&#x439;&#x431;&#x443;&#x442;&#x43D;&#x454; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;</h3>
<p>A&gt; &#x41D;&#x430; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43D;&#x44F;, &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x430; &#x449;&#x43E;&#x434;&#x43E; &#x432;&#x43D;&#x435;&#x441;&#x435;&#x43D;&#x43D;&#x44F; &#x443; JavaScript &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x443; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x445; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C;. &#x420;&#x43E;&#x431;&#x43E;&#x442;&#x430; &#x442;&#x440;&#x438;&#x432;&#x430;&#x454; &#x43D;&#x430;&#x434; <code>await</code>&#x2013;&#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x43E;&#x43C;, &#x449;&#x43E; &#x434;&#x443;&#x436;&#x435; &#x441;&#x445;&#x43E;&#x436;&#x438;&#x439; &#x43D;&#x430; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x437; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x443;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x432; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438;. &#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x44E; &#x456;&#x434;&#x435;&#x454;&#x44E; &#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x44F;&#x43A;&#x430; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F; <code>async</code>, &#x430; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x43C;&#x435; <code>await</code> &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; <code>yield</code>, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js">(<span class="hljs-keyword">async</span> <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">let</span> contents = <span class="hljs-keyword">await</span> readFile(<span class="hljs-string">&quot;config.json&quot;</span>);
    doSomethingWith(contents);
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&quot;Done&quot;</span>);
});
</code></pre>
<p>A&gt; &#x41A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>async</code> &#x43F;&#x435;&#x440;&#x435;&#x434; <code>function</code> &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x449;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43C;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;. &#x41A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>await</code> &#x441;&#x438;&#x433;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x454; &#x43F;&#x440;&#x43E; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; &#x444;&#x443;&#x43D;&#x446;&#x456;&#x457; <code>readFile(&quot;config.json&quot;)</code> &#x43C;&#x430;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x456; &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x456;&#x43D; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x442;&#x43E;&#x434;&#x456; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x434;&#x435; &#x43E;&#x433;&#x43E;&#x440;&#x43D;&#x435;&#x43D;&#x438;&#x439; &#x443; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;. &#x422;&#x43E;&#x447;&#x43D;&#x43E; &#x44F;&#x43A; &#x456; &#x443; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x457; <code>run()</code> &#x437; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x443;, <code>await</code> &#x43A;&#x438;&#x43D;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x44F;&#x43A;&#x449;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x431;&#x443;&#x434;&#x435; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43E;, &#x456; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x441;&#x435; &#x431;&#x443;&#x434;&#x435; &#x433;&#x430;&#x440;&#x430;&#x437;&#x434;. &#x41A;&#x456;&#x43D;&#x446;&#x435;&#x432;&#x438;&#x43C; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C; &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x442;&#x430;&#x43A;, &#x43D;&#x430;&#x447;&#x435; &#x432;&#x456;&#x43D; &#x454; &#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x43C; &#x431;&#x435;&#x437; &#x437;&#x430;&#x439;&#x432;&#x43E;&#x457; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x43C;&#x430;&#x448;&#x438;&#x43D;&#x43E;&#x44E; &#x441;&#x442;&#x430;&#x43D;&#x456;&#x432;, &#x44F;&#x43A;&#x430; &#x431;&#x430;&#x437;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x456;&#x442;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x445;.</p>
<p>A&gt; &#x41E;&#x447;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x449;&#x43E; <code>await</code>&#x2013;&#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x431;&#x443;&#x434;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43E; &#x443; ECMAScript 2017 (ECMAScript 8).</p>
<h2 id="&#x43F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;">&#x41F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;</h2>
<p>&#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x432;&#x434;&#x43E;&#x441;&#x43A;&#x43E;&#x43D;&#x430;&#x43B;&#x438;&#x442;&#x438; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x443; JavaScript, &#x434;&#x430;&#x44E;&#x447;&#x438; &#x432;&#x430;&#x43C; &#x43A;&#x440;&#x430;&#x449;&#x438;&#x439; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x44C; &#x442;&#x430; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x43D;&#x456;&#x436; &#x446;&#x435; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x434;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x434;&#x456;&#x457; &#x442;&#x430; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x438;. &#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x43F;&#x43B;&#x430;&#x43D;&#x443;&#x44E;&#x442;&#x44C; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x456; &#x443; &#x447;&#x435;&#x440;&#x433;&#x443; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x440;&#x443;&#x448;&#x456;&#x44F; JavaScript &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x434;&#x430;&#x43B;&#x44C;&#x448;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;, &#x442;&#x43E;&#x434;&#x456; &#x44F;&#x43A; &#x456;&#x43D;&#x448;&#x430; &#x447;&#x435;&#x440;&#x433;&#x430; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x454; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x438;&#x442;&#x438; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x442;&#x440;&#x438; &#x441;&#x442;&#x430;&#x43D;&#x438;: &#xAB;pending&#xBB; (&#x43E;&#x447;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;), &#xAB;fulfilled&#xBB; (&#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x439;) &#x442;&#x430; &#xAB;rejected&#xBB; (&#x43E;&#x447;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;). &#x41F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x442;&#x44C; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x443; &#x437; &#x441;&#x442;&#x430;&#x43D;&#x443; &#xAB;penging&#xBB; &#x456; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x44C; &#x443; &#x441;&#x442;&#x430;&#x43D; &#xAB;fulfilled&#xBB;, &#x43F;&#x440;&#x438; &#x443;&#x441;&#x43F;&#x456;&#x449;&#x43D;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x456;, &#x430;&#x431;&#x43E; &#x443; &#x441;&#x442;&#x430;&#x43D; &#xAB;rejected&#xBB; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x446;&#x456;. &#x414;&#x43B;&#x44F; &#x43E;&#x431;&#x43E;&#x445; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x456;&#x432; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x44C;&#x441;&#x44F; (settled). &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>then()</code> &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x457;&#x442;&#x438; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;, &#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>catch()</code> &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x457;&#x442;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x43E;&#x431;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A; &#x432;&#x456;&#x434;&#x445;&#x438;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x43C;&#x438; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x430;&#x43C;&#x438; &#x43E;&#x431;&#x2019;&#x454;&#x434;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x443; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x438; &#x456; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44E; &#x43C;&#x456;&#x436; &#x43D;&#x438;&#x43C;&#x438;. &#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>then()</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x442;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x440;&#x456;&#x448;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x440;&#x456;&#x448;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x439;. &#x422;&#x430;&#x43A;&#x456; &#x43B;&#x430;&#x43D;&#x446;&#x44E;&#x436;&#x43A;&#x438; &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x435;&#x440;&#x456;&#x439; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x445; &#x43F;&#x43E;&#x434;&#x456;&#x439;. &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>Promise.race()</code> &#x442;&#x430; <code>Promise.all()</code> &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x432;&#x456;&#x434;&#x441;&#x43B;&#x456;&#x434;&#x43A;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432; &#x442;&#x430; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E; &#x440;&#x435;&#x430;&#x433;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x456;&#x434; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443;.</p>
<p>&#x410;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x438;&#x439; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A; &#x437;&#x430;&#x432;&#x434;&#x430;&#x43D;&#x44C; &#x441;&#x442;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x454;&#x434;&#x43D;&#x430;&#x43D;&#x43D;&#x456; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x442;&#x430; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x438; &#x434;&#x430;&#x44E;&#x442;&#x44C; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x456;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x442;&#x430; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>yield</code> &#x434;&#x43B;&#x44F; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x456; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x456; &#x442;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x435;&#x432;&#x43D;&#x456; &#x434;&#x456;&#x457; &#x432; &#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x456;&#x434; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443;.</p>
<p>&#x411;&#x456;&#x43B;&#x44C;&#x448;&#x456;&#x441;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x438;&#x445; API &#x431;&#x443;&#x434;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x456; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x441;&#x456;&#x432;, &#x456; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438;, &#x449;&#x43E; &#x446;&#x44F; &#x442;&#x435;&#x43D;&#x434;&#x435;&#x43D;&#x446;&#x456;&#x44F; &#x431;&#x443;&#x434;&#x435; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x443; &#x43C;&#x430;&#x439;&#x431;&#x443;&#x442;&#x43D;&#x44C;&#x43E;&#x43C;&#x443;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="10-Arrays.html" class="navigation navigation-prev " aria-label="Previous page: Глава 10: Покращені можливості масивів">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="12-Proxies-and-Reflection.html" class="navigation navigation-next " aria-label="Next page: Глава 12: Проксі та АРІ рефлексії">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Глава 11: Проміси та асинхронне програмування","level":"1.13","depth":1,"next":{"title":"Глава 12: Проксі та АРІ рефлексії","level":"1.14","depth":1,"path":"manuscript/12-Proxies-and-Reflection.md","ref":"manuscript/12-Proxies-and-Reflection.md","articles":[]},"previous":{"title":"Глава 10: Покращені можливості масивів","level":"1.12","depth":1,"path":"manuscript/10-Arrays.md","ref":"manuscript/10-Arrays.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","yametrika","ga","rss","github-buttons"],"pluginsConfig":{"yametrika":{"number":"41711034"},"github":{"url":"https://github.com/denysdovhan/understandinges6ua"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Рoзуміння ECMAScript 6","description":"Український переклад книги «Understanding ES6».","author":"Denys Dovhan and Terry Sahaidak","site_url":"http://understandinges6.denysdovhan.com/","feed_url":"http://understandinges6.denysdovhan.com/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"github-buttons":{"repo":"denysdovhan/understandinges6ua","types":["star"],"size":"small"},"ga":{"configuration":"auto","token":"UA-40496885-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/denysdovhan/understandinges6ua/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"manuscript/11-Promises.md","mtime":"2017-01-16T14:14:39.027Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-01-16T14:16:21.136Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-yametrika/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

