
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Глава 13: Інкапсуляція коду через модулі · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="A-Other-Changes.html" />
    
    
    <link rel="prev" href="12-Proxies-and-Reflection.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"LambdaBooks/understandinges6ua","types":["star"],"size":"small"};
    </script>

    <link href="http://understandinges6.denysdovhan.com/rss.xml" title="Рoзуміння ECMAScript 6" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Рoзуміння ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-Block-Bindings.html">
            
                <a href="01-Block-Bindings.html">
            
                    
                    Глава 1: Блочне зв’язування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02-Strings-and-Regular-Expressions.html">
            
                <a href="02-Strings-and-Regular-Expressions.html">
            
                    
                    Глава 2: Рядки та регулярні вирази
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03-Functions.html">
            
                <a href="03-Functions.html">
            
                    
                    Глава 3: Функції
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="04-Objects.html">
            
                <a href="04-Objects.html">
            
                    
                    Глава 4: Розширена функціональність об’єктів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="05-Destructuring.html">
            
                <a href="05-Destructuring.html">
            
                    
                    Глава 5: Деструктурування для легшого доступу до даних
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="06-Symbols.html">
            
                <a href="06-Symbols.html">
            
                    
                    Глава 6: Символи та їх властивості
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="07-Sets-And-Maps.html">
            
                <a href="07-Sets-And-Maps.html">
            
                    
                    Глава 7: Множини та мапи
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="08-Iterators-And-Generators.html">
            
                <a href="08-Iterators-And-Generators.html">
            
                    
                    Глава 8: Ітератори та генератори
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="09-Classes.html">
            
                <a href="09-Classes.html">
            
                    
                    Глава 9: Знайомство з класами у JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10-Arrays.html">
            
                <a href="10-Arrays.html">
            
                    
                    Глава 10: Покращені можливості масивів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11-Promises.html">
            
                <a href="11-Promises.html">
            
                    
                    Глава 11: Проміси та асинхронне програмування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12-Proxies-and-Reflection.html">
            
                <a href="12-Proxies-and-Reflection.html">
            
                    
                    Глава 12: Проксі та АРІ рефлексії
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.15" data-path="13-Modules.html">
            
                <a href="13-Modules.html">
            
                    
                    Глава 13: Інкапсуляція коду через модулі
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="A-Other-Changes.html">
            
                <a href="A-Other-Changes.html">
            
                    
                    Додаток А: Дрібніші зміни у ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="B-ECMAScript-7.html">
            
                <a href="B-ECMAScript-7.html">
            
                    
                    Додаток Б: Розуміння ECMAScript 7 (2016)
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Глава 13: Інкапсуляція коду через модулі</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x456;&#x43D;&#x43A;&#x430;&#x43F;&#x441;&#x443;&#x43B;&#x44F;&#x446;&#x456;&#x44F;-&#x43A;&#x43E;&#x434;&#x443;-&#x437;&#x430;-&#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;">&#x406;&#x43D;&#x43A;&#x430;&#x43F;&#x441;&#x443;&#x43B;&#x44F;&#x446;&#x456;&#x44F; &#x43A;&#x43E;&#x434;&#x443; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;</h1>
<p>&#x41E;&#x434;&#x43D;&#x438;&#x43C; &#x437; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x445;&#x438;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x434;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43E;&#x43A; &#x456; &#x437;&#x430;&#x43F;&#x43B;&#x443;&#x442;&#x430;&#x43D;&#x438;&#x445; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x456;&#x432; JavaScript &#x432;&#x436;&#x435; &#x434;&#x430;&#x432;&#x43D;&#x43E; &#x454; shared everything-&#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x434;&#x43E; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x443;. &#x412; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; &#x456;&#x43D;&#x448;&#x456; &#x43C;&#x43E;&#x432;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x456; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x442;&#x44F; &#x44F;&#x43A; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x438;, JavaScript &#x432;&#x456;&#x434;&#x441;&#x442;&#x430;&#x432; &#x456; &#x432;&#x441;&#x435;, &#x449;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x43C;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x456; &#x43F;&#x43E;&#x434;&#x456;&#x43B;&#x44F;&#x454; &#x454;&#x434;&#x438;&#x43D;&#x443; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;. &#x422;&#x43E;&#x434;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x435;&#x431;-&#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x438; &#x441;&#x442;&#x430;&#x43B;&#x438; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x438;&#x43C;&#x438;, &#x430; &#x447;&#x430;&#x441;&#x442;&#x43E;&#x442;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; JavaScript &#x437;&#x440;&#x43E;&#x441;&#x43B;&#x430;, shared everything-&#x43F;&#x456;&#x434;&#x445;&#x456;&#x434; &#x43F;&#x43E;&#x447;&#x430;&#x432; &#x432;&#x438;&#x44F;&#x432;&#x43B;&#x44F;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438; &#x437; &#x43A;&#x43E;&#x43D;&#x444;&#x43B;&#x456;&#x43A;&#x442;&#x430;&#x43C;&#x438; &#x456;&#x43C;&#x435;&#x43D;, &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x43A;&#x438; &#x442;&#x430; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E;. &#x41E;&#x434;&#x43D;&#x456;&#x454;&#x44E; &#x437; &#x446;&#x456;&#x43B;&#x435;&#x439; ECMAScript 6 &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x438;&#x440;&#x456;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x456;&#x454;&#x457; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438; &#x456; &#x43D;&#x430;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443; &#x432; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x430;&#x445; JavaScript. &#x41E;&#x441;&#x44C; &#x442;&#x443;&#x442; &#x456; &#x437;&#x2019;&#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;.</p>
<h2 id="&#x449;&#x43E;-&#x442;&#x430;&#x43A;&#x435;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;">&#x429;&#x43E; &#x442;&#x430;&#x43A;&#x435; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;?</h2>
<p><em>&#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x456;</em> &#x2014; &#x446;&#x435; JavaScript &#x444;&#x430;&#x439;&#x43B;&#x438;, &#x44F;&#x43A;&#x456; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x456;&#x43D;&#x448;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; (&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; <em>&#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x456;&#x432;</em>, &#x44F;&#x43A;&#x456; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x438;&#x43C; &#x434;&#x43B;&#x44F; JavaScript &#x447;&#x438;&#x43D;&#x43E;&#x43C;). &#x41F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x430; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x434;&#x443;&#x436;&#x435; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x443; &#x441;&#x435;&#x43C;&#x430;&#x43D;&#x442;&#x438;&#x43A;&#x443; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x43D;&#x43E; &#x437; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x43C;&#x438; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x456;&#x432;:</p>
<ol>
<li>&#x41A;&#x43E;&#x434; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x456; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43D;&#x456;&#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x443;, &#x449;&#x43E;&#x431; &#x432;&#x456;&#x434;&#x43C;&#x43E;&#x432;&#x438;&#x442;&#x438;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x443;.</li>
<li>&#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x456;, &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x456; &#x43D;&#x430; &#x432;&#x438;&#x449;&#x43E;&#x43C;&#x443; &#x440;&#x456;&#x432;&#x43D;&#x456; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x43D;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x434;&#x43E; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;. &#x412;&#x43E;&#x43D;&#x438; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x442;&#x44C; &#x43B;&#x438;&#x448;&#x435; &#x432; &#x43C;&#x435;&#x436;&#x430;&#x445; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;.</li>
<li>&#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>this</code> &#x432; &#x432;&#x438;&#x449;&#x43E;&#x43C;&#x443; &#x440;&#x456;&#x432;&#x43D;&#x456; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x2014; <code>undefined</code>.</li>
<li>&#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x43D;&#x435; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x456;&#x432; &#x432; &#x441;&#x442;&#x438;&#x43B;&#x456; HTML &#x443; &#x43A;&#x43E;&#x434;&#x456; (&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;, &#x44F;&#x43A;&#x430; &#x434;&#x456;&#x454; &#x432;&#x456;&#x434; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;).</li>
<li>&#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;-&#x449;&#x43E;, &#x449;&#x43E; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C; &#x437;&#x430; &#x43C;&#x435;&#x436;&#x430;&#x43C;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;.</li>
<li>&#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;.</li>
</ol>
<p>&#x412;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x43D;&#x435;&#x437;&#x43D;&#x430;&#x447;&#x43D;&#x438;&#x43C;&#x438; &#x43D;&#x430; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x43F;&#x43E;&#x433;&#x43B;&#x44F;&#x434;, &#x430;&#x43B;&#x435; &#x432;&#x43E;&#x43D;&#x438; &#x456;&#x441;&#x442;&#x43E;&#x442;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x44E;&#x442;&#x44C; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; JavaScript, &#x43F;&#x440;&#x43E; &#x449;&#x43E; &#x44F; &#x431;&#x443;&#x434;&#x443; &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x442;&#x438; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456;. &#x420;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x44E; &#x441;&#x438;&#x43B;&#x43E;&#x44E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x442;&#x430; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x442;&#x456; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x456; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x456;, &#x430; &#x43D;&#x435; &#x432;&#x441;&#x435;, &#x449;&#x43E; &#x454; &#x443; &#x444;&#x430;&#x439;&#x43B;&#x456;. &#x414;&#x43E;&#x431;&#x440;&#x435; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x442;&#x430; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x43C;&#x430;&#x454; &#x444;&#x443;&#x43D;&#x434;&#x430;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x456;&#x432;.</p>
<h2 id="&#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x438;-&#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;">&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x438; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</h2>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>export</code>, &#x449;&#x43E;&#x431; &#x43D;&#x430;&#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x43E;&#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443; &#x456;&#x43D;&#x448;&#x438;&#x43C; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;&#x43C;. &#x412; &#x43D;&#x430;&#x439;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; <code>export</code> &#x43D;&#x430; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x43E;&#x457; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x430;&#x431;&#x43E; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443;, &#x449;&#x43E;&#x431; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x457;&#x445; &#x437; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454;&#x43C;&#x43E; &#x434;&#x430;&#x43D;&#x456;</span>
<span class="hljs-keyword">export</span> <span class="hljs-keyword">var</span> color = <span class="hljs-string">&quot;red&quot;</span>;
<span class="hljs-keyword">export</span> <span class="hljs-keyword">let</span> name = <span class="hljs-string">&quot;Nicholas&quot;</span>;
<span class="hljs-keyword">export</span> <span class="hljs-keyword">const</span> magicNumber = <span class="hljs-number">7</span>;

<span class="hljs-comment">// &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454;&#x43C;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;</span>
<span class="hljs-keyword">export</span> <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">sum</span>(<span class="hljs-params">num1, num2</span>) </span>{
   <span class="hljs-keyword">return</span> num1 + num1;
}

<span class="hljs-comment">// &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454;&#x43C;&#x43E; &#x43A;&#x43B;&#x430;&#x441;</span>
<span class="hljs-keyword">export</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Rectangle</span> </span>{
   <span class="hljs-keyword">constructor</span>(length, width) {
       <span class="hljs-keyword">this</span>.length = length;
       <span class="hljs-keyword">this</span>.width = width;
   }
}

<span class="hljs-comment">// &#x446;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;</span>
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">subtract</span>(<span class="hljs-params">num1, num2</span>) </span>{
   <span class="hljs-keyword">return</span> num1 - num2;
}

<span class="hljs-comment">// &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x43C;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x2026;</span>
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">multiply</span>(<span class="hljs-params">num1, num2</span>) </span>{
   <span class="hljs-keyword">return</span> num1 * num2;
}

<span class="hljs-comment">// &#x2026; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454;&#x43C;&#x43E; &#x43F;&#x456;&#x437;&#x43D;&#x456;&#x448;&#x435;</span>
<span class="hljs-keyword">export</span> { multiply };
</code></pre>
<p>&#x404; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x440;&#x435;&#x447;&#x435;&#x439;, &#x43D;&#x430; &#x44F;&#x43A;&#x456; &#x442;&#x440;&#x435;&#x431;&#x430; &#x437;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x438; &#x443;&#x432;&#x430;&#x433;&#x443; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;. &#x41F;&#x43E;-&#x43F;&#x435;&#x440;&#x448;&#x435;, &#x43A;&#x43E;&#x436;&#x43D;&#x435; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x438;&#x43C; &#x441;&#x43B;&#x43E;&#x432;&#x43E;&#x43C; <code>export</code> &#x454; &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x442;&#x430;&#x43A;&#x438;&#x43C;, &#x44F;&#x43A;&#x438;&#x43C; &#x432;&#x43E;&#x43D;&#x43E; &#x431;&#x443;&#x43B;&#x43E; &#x431;&#x438; &#x431;&#x435;&#x437; &#x43D;&#x44C;&#x43E;&#x433;&#x43E;. &#x41A;&#x43E;&#x436;&#x43D;&#x430; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x430;&#x431;&#x43E; &#x43A;&#x43B;&#x430;&#x441; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x456;&#x43C;&#x2019;&#x44F;; &#x446;&#x435; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x439; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x454; &#x456;&#x43C;&#x2019;&#x44F;. &#x412;&#x438; &#x43D;&#x435; &#x437;&#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x430;&#x43D;&#x43E;&#x43D;&#x456;&#x43C;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x430;&#x431;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x438;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x446;&#x435;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;, &#x43F;&#x440;&#x438;&#x43D;&#x430;&#x439;&#x43C;&#x43D;&#x456; &#x431;&#x435;&#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>default</code> (&#x44F;&#x43A;&#x435; &#x431;&#x443;&#x434;&#x435; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x443;&#x442;&#x43E; &#x432; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456; &#xAB;&#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;&#x445;&#xBB;).</p>
<p>&#x414;&#x430;&#x43B;&#x456;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435;&#x43C;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; <code>multiply()</code>, &#x449;&#x43E; &#x43D;&#x435; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x43E;&#x43D;&#x430; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x430;. &#x426;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x430;&#x43C; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F;: &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F;. &#x41D;&#x430;&#x440;&#x435;&#x448;&#x442;&#x456;, &#x437;&#x432;&#x435;&#x440;&#x43D;&#x456;&#x442;&#x44C; &#x443;&#x432;&#x430;&#x433;&#x443;, &#x449;&#x43E; &#x446;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43D;&#x435; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; <code>subtract()</code>. &#x426;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x437;&#x430; &#x43C;&#x435;&#x436;&#x430;&#x43C;&#x438; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x430;&#x431;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x438;, &#x44F;&#x43A;&#x456; &#x44F;&#x432;&#x43D;&#x43E; &#x43D;&#x435; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;.</p>
<h2 id="&#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x438;-&#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;">&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x438; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</h2>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x437; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x430;&#x43C;&#x438;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B; &#x432; &#x456;&#x43D;&#x448;&#x43E;&#x43C;&#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>import</code>. &#x414;&#x432;&#x456; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>import</code> &#x2014; &#x446;&#x435; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x438;, &#x44F;&#x43A;&#x456; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;, &#x437;&#x432;&#x456;&#x434;&#x43A;&#x438; &#x442;&#x456; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x431;&#x443;&#x434;&#x443; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x456;. &#x426;&#x435; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x430; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { identifier1, identifier2 } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;
</code></pre>
<p>&#x424;&#x456;&#x433;&#x443;&#x440;&#x43D;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x43F;&#x456;&#x441;&#x43B;&#x44F; <code>import</code> &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x44E;&#x442;&#x44C; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x456; &#x442;&#x440;&#x435;&#x431;&#x430; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;. &#x41A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>from</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x435;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;, &#x437; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x456; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;. &#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x440;&#x44F;&#x434;&#x43A;&#x430;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x454; &#x448;&#x43B;&#x44F;&#x445; &#x434;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; (&#x442;&#x430;&#x43A; &#x437;&#x432;&#x430;&#x43D;&#x438;&#x439; <em>&#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;</em>). &#x411;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C; &#x442;&#x43E;&#x439; &#x441;&#x430;&#x43C;&#x438;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; &#x448;&#x43B;&#x44F;&#x445;&#x443;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x431; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443; <code>&lt;script&gt;</code>, &#x449;&#x43E; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x2014; &#x432;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x438; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x443;. Node.js, &#x437; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x431;&#x43E;&#x43A;&#x443;, &#x434;&#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x432;&#x43E;&#x433;&#x43E; &#x437;&#x432;&#x438;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x443; &#x440;&#x43E;&#x437;&#x440;&#x456;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x456;&#x436; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x43C;&#x438; &#x456; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x430;&#x43C;&#x438;, &#x491;&#x440;&#x443;&#x43D;&#x442;&#x443;&#x44E;&#x447;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x43F;&#x440;&#x435;&#x444;&#x456;&#x43A;&#x441;&#x430;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;&#x43E;&#x457; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, <code>example</code> &#x2014; &#x43F;&#x430;&#x43A;&#x435;&#x442;, &#x430; <code>./example.js</code> &#x2014; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B;.</p>
<p>I&gt; &#x421;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x44C; &#x434;&#x43B;&#x44F; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x43F;&#x43E;&#x434;&#x456;&#x431;&#x43D;&#x43E; &#x434;&#x43E; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;, &#x430;&#x43B;&#x435; &#x43D;&#x435; &#x454; &#x43D;&#x438;&#x43C;.</p>
<p>&#x417;&#x430; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x44C; &#x437; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x432;&#x43E;&#x43D;&#x43E; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A;, &#x43D;&#x456;&#x431;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; <code>const</code>. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x456;&#x43D;&#x448;&#x443; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x443; &#x437; &#x442;&#x438;&#x43C; &#x436;&#x435; &#x456;&#x43C;&apos;&#x44F;&#x43C; (&#x432; &#x442;&#x43E;&#x43C;&#x443; &#x447;&#x438;&#x441;&#x43B;&#x456; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437; &#x442;&#x438;&#x43C; &#x436;&#x435; &#x456;&#x43C;&apos;&#x44F;&#x43C;), &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x439;&#x442;&#x435; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440; &#x434;&#x43E; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; <code>import</code> &#x430;&#x431;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x456;&#x442;&#x44C; &#x439;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;.</p>
<h3 id="&#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x43E;&#x434;&#x438;&#x43D;&#x438;&#x447;&#x43D;&#x43E;&#x433;&#x43E;-&#x437;&#x432;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;">&#x406;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x434;&#x438;&#x43D;&#x438;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</h3>
<p>&#x41F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E;, &#x449;&#x43E; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x432; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456; &#xAB;&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x438; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#xBB; &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x437; &#x456;&#x43C;&apos;&#x44F;&#x43C; <code>example.js</code>. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x43C;&#x430; &#x448;&#x43B;&#x44F;&#x445;&#x430;&#x43C;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x434;&#x43D;&#x435; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454;&#x43C;&#x43E; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43E;&#x434;&#x43D;&#x435;</span>
<span class="hljs-keyword">import</span> { sum } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;

<span class="hljs-built_in">console</span>.log(sum(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>));     <span class="hljs-comment">// 3</span>

sum = <span class="hljs-number">1</span>;        <span class="hljs-comment">// &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;</span>
</code></pre>
<p>&#x41D;&#x435;&#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; <code>example.js</code> &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435;, &#x43D;&#x456;&#x436; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43E;&#x434;&#x43D;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x446;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; <code>sum()</code>. &#x41F;&#x440;&#x438; &#x441;&#x43F;&#x440;&#x43E;&#x431;&#x456; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x457;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>sum</code>, &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;.</p>
<p>W&gt; &#x41F;&#x435;&#x440;&#x435;&#x43A;&#x43E;&#x43D;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44F; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E;&#x431; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x438;&#x442;&#x438; <code>/</code>, <code>./</code>, &#x447;&#x438; <code>../</code> &#x43D;&#x430; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x443; &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454;&#x442;&#x435; &#x434;&#x43B;&#x44F; &#x43A;&#x440;&#x430;&#x449;&#x43E;&#x457; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x445; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445; &#x456; Node.js.</p>
<h3 id="&#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445;-&#x437;&#x432;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x44C;">&#x406;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x44C;</h3>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x44C; &#x437; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x44F;&#x432;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x440;&#x430;&#x445;&#x443;&#x432;&#x430;&#x442;&#x438; &#x457;&#x445; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x43D;&#x438;&#x439; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;</span>
<span class="hljs-keyword">import</span> { sum, multiply, magicNumber } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;
<span class="hljs-built_in">console</span>.log(sum(<span class="hljs-number">1</span>, magicNumber));   <span class="hljs-comment">// 8</span>
<span class="hljs-built_in">console</span>.log(multiply(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>));        <span class="hljs-comment">// 2</span>
</code></pre>
<p>&#x422;&#x443;&#x442;, &#x437; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x440;&#x438; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;: <code>sum</code>, <code>multiply</code> &#x442;&#x430; <code>magicNumber</code>. &#x41F;&#x43E;&#x442;&#x456;&#x43C; &#x432;&#x43E;&#x43D;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A;, &#x43D;&#x430;&#x447;&#x435; &#x432;&#x43E;&#x43D;&#x438; &#x431;&#x443;&#x43B;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;.</p>
<h3 id="&#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x432;&#x441;&#x44C;&#x43E;&#x433;&#x43E;-&#x437;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;">&#x406;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x441;&#x44C;&#x43E;&#x433;&#x43E; &#x437; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;</h3>
<p>&#x404; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x438;&#x439; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43E;&#x43A;, &#x44F;&#x43A;&#x438;&#x439; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x435;&#x441;&#x44C; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x44F;&#x43A; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x439; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;. &#x412;&#x441;&#x435; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x456; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454;&#x43C;&#x43E; &#x432;&#x441;&#x435;</span>
<span class="hljs-keyword">import</span> * <span class="hljs-keyword">as</span> example <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;
<span class="hljs-built_in">console</span>.log(example.sum(<span class="hljs-number">1</span>,
       example.magicNumber));          <span class="hljs-comment">// 8</span>
<span class="hljs-built_in">console</span>.log(example.multiply(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>));    <span class="hljs-comment">// 2</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456; &#x432;&#x441;&#x456; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437; <code>example.js</code> &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442; &#x43F;&#x456;&#x434; &#x43D;&#x430;&#x437;&#x432;&#x43E;&#x44E; <code>example</code>. &#x406;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x438; (&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>sum()</code> , &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>multiple()</code> &#x456; <code>magicNumber</code>) &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x44F;&#x43A; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; &#x432; <code>example</code>. &#x426;&#x435;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x43D;&#x430;&#x437;&#x438;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <em>&#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x440;&#x443; &#x456;&#x43C;&#x435;&#x43D;</em>, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442; <code>example</code> &#x43D;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x443; <code>example.js</code> &#x456; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x430; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x440;&#x443; &#x456;&#x43C;&#x435;&#x43D; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x447;&#x43B;&#x435;&#x43D;&#x456;&#x432; <code>example.js</code>.</p>
<p>&#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x43C;&#x430;&#x439;&#x442;&#x435; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;, &#x449;&#x43E; &#x43D;&#x435;&#x437;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x43E; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x440;&#x430;&#x437;&#x456;&#x432; &#x432;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x435; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x432; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456; <code>import</code>, &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43E;&#x434;&#x438;&#x43D; &#x440;&#x430;&#x437;. &#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x43A;&#x43E;&#x434; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x438;&#x439;, &#x456;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x446;&#x456;&#x439;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43F;&#x430;&#x43C;&apos;&#x44F;&#x442;&#x456; &#x456; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438;, &#x43A;&#x43E;&#x43B;&#x438; <code>import</code> &#x437;&#x43D;&#x43E;&#x432;&#x443; &#x431;&#x443;&#x434;&#x435; &#x437;&#x432;&#x435;&#x440;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x434;&#x43E; &#x43D;&#x44C;&#x43E;&#x433;&#x43E;. &#x417;&#x432;&#x435;&#x440;&#x43D;&#x456;&#x442;&#x44C; &#x443;&#x432;&#x430;&#x433;&#x443; &#x43D;&#x430; &#x442;&#x430;&#x43A;&#x435;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { sum } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;
<span class="hljs-keyword">import</span> { multiply } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;
<span class="hljs-keyword">import</span> { magicNumber } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;
</code></pre>
<p>&#x41D;&#x435;&#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x454; &#x442;&#x440;&#x438; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; <code>import</code> &#x432; &#x434;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;, &#x43A;&#x43E;&#x434; &#x437; <code>example.js</code> &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43E;&#x434;&#x438;&#x43D; &#x440;&#x430;&#x437;. &#x42F;&#x43A;&#x449;&#x43E; &#x456;&#x43D;&#x448;&#x456; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x432; &#x442;&#x43E;&#x43C;&#x443; &#x436; &#x441;&#x430;&#x43C;&#x43E;&#x43C;&#x443; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x443; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x431;&#x443;&#x43B;&#x438; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437; <code>example.js</code>, &#x446;&#x456; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x434;&#x438;&#x43D; &#x456; &#x442;&#x43E;&#x439; &#x436;&#x435; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x449;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434;.</p>
<h3 id="&#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F;-&#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;">&#x41E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;</h3>
<p>&#x412;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x44F;&#x43A; <code>export</code> &#x442;&#x430;&#x43A; &#x456; <code>import</code> &#x454; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x456; &#x437;&#x430; &#x43C;&#x435;&#x436;&#x430;&#x43C;&#x438; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x431;&#x443;&#x434;&#x435; &#x434;&#x430;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x443; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">if</span> (flag) {
 <span class="hljs-keyword">export</span> flag;    <span class="hljs-comment">// &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;</span>
}
</code></pre>
<p>&#x412;&#x438;&#x440;&#x430;&#x437; <code>export</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x443; <code>if</code>, &#x43D;&#x435; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F;. &#x415;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x443;&#x43C;&#x43E;&#x432;&#x43D;&#x438;&#x43C; &#x430;&#x431;&#x43E; &#x437;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x456;&#x447;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;. &#x41E;&#x434;&#x43D;&#x456;&#x454;&#x44E; &#x437; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x454; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x438; &#x440;&#x443;&#x448;&#x456;&#x44E; JavaScript &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x43E; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>export</code> &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43D;&#x430; &#x43D;&#x430;&#x439;&#x432;&#x438;&#x449;&#x43E;&#x43C;&#x443; &#x440;&#x456;&#x432;&#x43D;&#x456; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;.</p>
<p>&#x41A;&#x440;&#x456;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>import</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43D;&#x430; &#x43D;&#x430;&#x439;&#x432;&#x438;&#x449;&#x43E;&#x43C;&#x443; &#x440;&#x456;&#x432;&#x43D;&#x456;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x441;&#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x438;&#x442;&#x44C; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x443; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">tryImport</span>(<span class="hljs-params"></span>) </span>{
 <span class="hljs-keyword">import</span> flag <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;    <span class="hljs-comment">// &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;</span>
}
</code></pre>
<p>&#x412;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x456;&#x447;&#x43D;&#x43E; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437; &#x442;&#x456;&#x454;&#x457; &#x436; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x438; &#x437; &#x44F;&#x43A;&#x43E;&#x457; &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x456;&#x447;&#x43D;&#x43E; &#x457;&#x445; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;. &#x41A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x456; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>export</code> &#x442;&#x430; <code>import</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x456; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x431;&#x443;&#x442;&#x438; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x43C;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x456;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;, &#x442;&#x430;&#x43A;&#x456; &#x44F;&#x43A; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x456; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x43E;&#x440;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x441;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438;, &#x44F;&#x43A;&#x430; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x44F; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x437; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;.</p>
<h3 id="&#x442;&#x43E;&#x43D;&#x43A;&#x438;&#x439;-&#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;-&#x432;-&#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456;-&#x437;&#x432;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;">&#x422;&#x43E;&#x43D;&#x43A;&#x438;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x432; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</h3>
<p>&#x412; ECMAScript 6 &#x432;&#x438;&#x440;&#x430;&#x437; <code>import</code> &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x43B;&#x438;&#x448;&#x435; &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x439; &#x456; &#x43A;&#x43B;&#x430;&#x441;&#x456;&#x432;, &#x430; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x430; &#x43E;&#x440;&#x438;&#x433;&#x456;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x44F;&#x43A; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456;. &#x41D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x43D;&#x435;&#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x44F;&#x43A;&#x438;&#x439; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;, &#x44F;&#x43A;&#x438;&#x439; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454; &#x446;&#x435;&#x439; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440; &#x43C;&#x43E;&#x436;&#x435;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E;, &#x449;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x446;&#x435;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">export</span> <span class="hljs-keyword">var</span> name = <span class="hljs-string">&quot;Nicholas&quot;</span>;
<span class="hljs-keyword">export</span> <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">setName</span>(<span class="hljs-params">newName</span>) </span>{
   name = newName;
}
</code></pre>
<p>&#x41F;&#x440;&#x438; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x456; &#x446;&#x438;&#x445; &#x434;&#x432;&#x43E;&#x445; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x44C;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>setName()</code> &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>name</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { name, setName } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;

<span class="hljs-built_in">console</span>.log(name);       <span class="hljs-comment">// &quot;Nicholas&quot;</span>
setName(<span class="hljs-string">&quot;Greg&quot;</span>);
<span class="hljs-built_in">console</span>.log(name);       <span class="hljs-comment">// &quot;Greg&quot;</span>

name = <span class="hljs-string">&quot;Nicholas&quot;</span>;       <span class="hljs-comment">// &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;</span>
</code></pre>
<p>&#x412;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>setName(&quot;Greg&quot;)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x437; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43B;&#x430;&#x441;&#x44C; <code>setName()</code> &#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43C;, &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x44E;&#x447;&#x438; <code>name</code> &#x432; <code>&quot;Greg&quot;</code>. &#x417;&#x432;&#x435;&#x440;&#x43D;&#x456;&#x442;&#x44C; &#x443;&#x432;&#x430;&#x433;&#x443;, &#x446;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x430; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; <code>name</code>. &#x426;&#x435; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; <code>name</code> &#x454; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x456;&#x43C;&apos;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>name</code>, &#x44F;&#x43A;&#x438;&#x439; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;. <code>name</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x435; &#x432; &#x43A;&#x43E;&#x434;&#x456; &#x432;&#x438;&#x449;&#x435; &#x456; <code>name</code>, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x435; &#x432; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x437; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x43B;&#x43E; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x435; &#x2014; &#x446;&#x435; &#x43D;&#x435; &#x43E;&#x434;&#x43D;&#x435; &#x439; &#x442;&#x435; &#x436; &#x441;&#x430;&#x43C;&#x435;.</p>
<h2 id="&#x43F;&#x435;&#x440;&#x435;&#x439;&#x43C;&#x435;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x456;&#x432;-&#x456;-&#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x456;&#x432;">&#x41F;&#x435;&#x440;&#x435;&#x439;&#x43C;&#x435;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x456;&#x432; &#x456; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x456;&#x432;</h2>
<p>&#x406;&#x43D;&#x43E;&#x434;&#x456;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43D;&#x435; &#x437;&#x430;&#x445;&#x43E;&#x442;&#x456;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x440;&#x438;&#x433;&#x456;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x435; &#x456;&#x43C;&apos;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x430;&#x431;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x443; &#x44F;&#x43A;&#x443; &#x432;&#x438; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x437; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;. &#x41D;&#x430; &#x449;&#x430;&#x441;&#x442;&#x44F;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x438;&#x442;&#x438; &#x43D;&#x430;&#x437;&#x432;&#x443; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x44F;&#x43A; &#x43F;&#x440;&#x438; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x456;, &#x442;&#x430;&#x43A; &#x456; &#x43F;&#x440;&#x438; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x456;.</p>
<p>&#x423; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x43F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E;, &#x449;&#x43E; &#x443; &#x432;&#x430;&#x441; &#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;, &#x44F;&#x43A;&#x443; &#x432;&#x438; &#x445;&#x43E;&#x442;&#x456;&#x43B;&#x438; &#x431; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437; &#x456;&#x43D;&#x448;&#x438;&#x43C; &#x456;&#x43C;&apos;&#x44F;&#x43C;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>as</code>, &#x449;&#x43E;&#x431; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x456;&#x43C;&apos;&#x44F; &#x437; &#x44F;&#x43A;&#x438;&#x43C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x430; &#x431;&#x443;&#x442;&#x438; &#x432;&#x456;&#x434;&#x43E;&#x43C;&#x430; &#x437;&#x430; &#x43C;&#x435;&#x436;&#x430;&#x43C;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">sum</span>(<span class="hljs-params">num1, num2</span>) </span>{
   <span class="hljs-keyword">return</span> num1 + num2;
}

<span class="hljs-keyword">export</span> { sum <span class="hljs-keyword">as</span> add };
</code></pre>
<p>&#x422;&#x443;&#x442;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>sum()</code> (<code>sum</code> &#x2014; &#x446;&#x435; <em>&#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x435; &#x456;&#x43C;&#x2019;&#x44F;</em>) &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x44F;&#x43A; <code>add()</code> (<code>add</code> &#x2014; &#x446;&#x435; <em>&#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x435; &#x456;&#x43C;&#x2019;&#x44F;</em>). &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x43A;&#x43E;&#x43B;&#x438; &#x456;&#x43D;&#x448;&#x438;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x445;&#x43E;&#x447;&#x435; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x446;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;, &#x432;&#x456;&#x43D; &#x43C;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x456;&#x43C;&apos;&#x44F; <code>add</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { add } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;
</code></pre>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x445;&#x43E;&#x447;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x43D;&#x435;&#x457; &#x456;&#x43D;&#x448;&#x435; &#x456;&#x43C;&#x2019;&#x44F;, &#x432;&#x456;&#x43D; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>as</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { add <span class="hljs-keyword">as</span> sum } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;
<span class="hljs-built_in">console</span>.log(<span class="hljs-keyword">typeof</span> add);            <span class="hljs-comment">// &quot;undefined&quot;</span>
<span class="hljs-built_in">console</span>.log(sum(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>));             <span class="hljs-comment">// 3</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; <code>add()</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; <em>&#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x435; &#x456;&#x43C;&#x2019;&#x44F;</em> &#x442;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x443;&#x454; &#x457;&#x457; &#x43D;&#x430; <code>sum()</code> (&#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x435; &#x456;&#x43C;&#x2019;&#x44F;). &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x437; &#x456;&#x43C;&#x2019;&#x44F;&#x43C; <code>add</code>.</p>
<h2 id="&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;-&#x437;&#x430;-&#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;-&#x432;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;&#x445;">&#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;&#x445;</h2>
<p>&#x421;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x43E; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x442;&#x430; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x437; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x446;&#x44F; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x44C; &#x431;&#x443;&#x43B;&#x430; &#x434;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x43C; &#x44F;&#x432;&#x438;&#x449;&#x435;&#x43C; &#x432; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;&#x445; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;, &#x44F;&#x43A; &#x43E;&#x442; CommonJS (&#x456;&#x43D;&#x448;&#x438;&#x439; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; JavaScript &#x43F;&#x43E;&#x437;&#x430; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43E;&#x43C;). <em>&#x417;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;</em> &#x434;&#x43B;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x454; &#x43E;&#x434;&#x43D;&#x456;&#x454;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x44E;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x454;&#x44E; &#x430;&#x431;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x43E;&#x43C;, &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x43C; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>default</code>, &#x456; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x438; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43E;&#x434;&#x438;&#x43D; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x43E;&#x432;&#x430; <code>default</code> &#x437; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x43C;&#x430; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x430;&#x43C;&#x438; &#x454; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x457; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x43E;&#x44E;.</p>
<h3 id="&#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;-&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;-&#x437;&#x430;-&#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;">&#x415;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;</h3>
<p>&#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x44F;&#x43A; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>default</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">num1, num2</span>) </span>{
   <span class="hljs-keyword">return</span> num1 + num2;
}
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E;. &#x41A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; <code>default</code> &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x446;&#x435;&#x439; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442; &#x454; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x43C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x454; &#x456;&#x43C;&#x435;&#x43D;&#x456;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x441;&#x430;&#x43C;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x454; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x43C;.</p>
<p>&#x41A;&#x440;&#x456;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440; &#x44F;&#x43A; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x43F;&#x43E;&#x43C;&#x456;&#x441;&#x442;&#x438;&#x432;&#x448;&#x438; &#x439;&#x43E;&#x433;&#x43E; &#x43F;&#x456;&#x441;&#x43B;&#x44F; <code>export default</code>, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">sum</span>(<span class="hljs-params">num1, num2</span>) </span>{
   <span class="hljs-keyword">return</span> num1 + num2;
}

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> sum;
</code></pre>
<p>&#x422;&#x443;&#x442; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>sum()</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x430; &#x43F;&#x435;&#x440;&#x448;&#x43E;&#x44E;, &#x430; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x430; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x431;&#x440;&#x430;&#x442;&#x438; &#x446;&#x435;&#x439; &#x43F;&#x456;&#x434;&#x445;&#x456;&#x434;, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x456;&#x434;&#x43D;&#x43E; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x438;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;.</p>
<p>&#x422;&#x440;&#x435;&#x442;&#x456;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x44F;&#x43A; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x43C;&#x435;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;:</p>
<pre><code class="lang-js">
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">sum</span>(<span class="hljs-params">num1, num2</span>) </span>{
 <span class="hljs-keyword">return</span> num1 + num2;
}

<span class="hljs-keyword">export</span> { sum <span class="hljs-keyword">as</span> <span class="hljs-keyword">default</span> };
</code></pre>
<p>&#x406;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440; <code>default</code> &#x43C;&#x430;&#x454; &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x43C;&#x435;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x456; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x456; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>default</code> &#x2014; &#x446;&#x435; &#x43A;&#x43B;&#x44E;&#x447;&#x43E;&#x432;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; &#x432; JavaScript, &#x432;&#x43E;&#x43D;&#x43E; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x435; &#x434;&#x43B;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x430;&#x431;&#x43E; &#x456;&#x43C;&#x2019;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x443; (&#x430;&#x43B;&#x435; &#x432;&#x43E;&#x43D;&#x43E; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x435; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x456;&#x43C;&#x2019;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;). &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>default</code> &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x43C;&#x435;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x454; &#x43E;&#x43A;&#x440;&#x435;&#x43C;&#x438;&#x43C; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x43E;&#x43C;, &#x449;&#x43E;&#x431; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x443;&#x437;&#x433;&#x43E;&#x434;&#x436;&#x435;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x437; &#x442;&#x438;&#x43C;, &#x44F;&#x43A; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x430; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x43D;&#x435; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x426;&#x435;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x439;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43E;&#x434;&#x438;&#x43D; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440; <code>export</code> &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x432;&#x456;&#x434;&#x440;&#x430;&#x437;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x456;&#x432;, &#x432; &#x442;&#x43E;&#x43C;&#x443; &#x447;&#x438;&#x441;&#x43B;&#x456; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;.</p>
<h3 id="&#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;-&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;-&#x437;&#x430;-&#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;">&#x406;&#x43C;&#x43F;&#x43E;&#x440;&#x442; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;</h3>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x437; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;</span>
<span class="hljs-keyword">import</span> sum <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;

<span class="hljs-built_in">console</span>.log(sum(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>));     <span class="hljs-comment">// 3</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x437; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; <code>example.js</code>. &#x417;&#x432;&#x435;&#x440;&#x43D;&#x456;&#x442;&#x44C; &#x443;&#x432;&#x430;&#x433;&#x443;, &#x449;&#x43E; &#x444;&#x456;&#x433;&#x443;&#x440;&#x43D;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F;, &#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x432;&#x438; &#x431;&#x430;&#x447;&#x438;&#x43B;&#x438; &#x432; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x456; &#x43D;&#x435; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x41B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x435; &#x456;&#x43C;&#x2019;&#x44F; <code>sum</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x43E;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x44F;&#x43A;&#x443; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;. &#x426;&#x435;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x454; &#x43D;&#x430;&#x439;&#x447;&#x438;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C;, &#x456; &#x442;&#x432;&#x43E;&#x440;&#x446;&#x456; ECMAScript 6 &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x44E;&#x442;&#x44C;, &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x431;&#x443;&#x434;&#x435; &#x434;&#x43E;&#x43C;&#x456;&#x43D;&#x443;&#x44E;&#x447;&#x43E;&#x44E; &#x444;&#x43E;&#x440;&#x43C;&#x43E;&#x44E; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x432; &#x406;&#x43D;&#x442;&#x435;&#x440;&#x43D;&#x435;&#x442;&#x456;, &#x449;&#x43E; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x436;&#x435; &#x456;&#x441;&#x43D;&#x443;&#x44E;&#x447;&#x438;&#x439; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;.</p>
<p>&#x414;&#x43B;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x44E;&#x442;&#x44C;, &#x44F;&#x43A; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x442;&#x430;&#x43A; &#x456; &#x43E;&#x434;&#x438;&#x43D; &#x430;&#x431;&#x43E; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x44C; &#x43D;&#x435; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x441;&#x456; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x437;&#x432;&apos;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E;, &#x449;&#x43E; &#x443; &#x432;&#x430;&#x441; &#x454; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">export</span> <span class="hljs-keyword">let</span> color = <span class="hljs-string">&quot;red&quot;</span>;

<span class="hljs-keyword">export</span> <span class="hljs-keyword">default</span> <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">num1, num2</span>) </span>{
   <span class="hljs-keyword">return</span> num1 + num2;
}
</code></pre>
<p>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x44F;&#x43A; <code>color</code>, &#x442;&#x430;&#x43A; &#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44E; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>import</code> &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> sum, { color } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;

<span class="hljs-built_in">console</span>.log(sum(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>));     <span class="hljs-comment">// 3</span>
<span class="hljs-built_in">console</span>.log(color);         <span class="hljs-comment">// &quot;red&quot;</span>
</code></pre>
<p>&#x41A;&#x43E;&#x43C;&#x430; &#x432;&#x456;&#x434;&#x434;&#x456;&#x43B;&#x44F;&#x454; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x435; &#x456;&#x43C;&apos;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432;&#x456;&#x434; &#x456;&#x43C;&#x435;&#x43D; &#x43D;&#x435; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x44F;&#x43A;&#x456; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43E;&#x442;&#x43E;&#x447;&#x435;&#x43D;&#x456; &#x444;&#x456;&#x433;&#x443;&#x440;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x443;&#x436;&#x43A;&#x430;&#x43C;&#x438;. &#x41C;&#x430;&#x439;&#x442;&#x435; &#x43D;&#x430; &#x443;&#x432;&#x430;&#x437;&#x456;, &#x449;&#x43E; &#x437;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x435; &#x439;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x456;&#x43C;&#x435;&#x43D;&#x430;&#x43C;&#x438; &#x43D;&#x435; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x432; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456; <code>import</code>.</p>
<p>&#x42F;&#x43A; &#x456; &#x43F;&#x440;&#x438; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x456; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x437; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x43E;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x43C;&#x435;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x43E; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;</span>
<span class="hljs-keyword">import</span> { <span class="hljs-keyword">default</span> <span class="hljs-keyword">as</span> sum, color } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;example&quot;</span>;

<span class="hljs-built_in">console</span>.log(sum(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>));     <span class="hljs-comment">// 3</span>
<span class="hljs-built_in">console</span>.log(color);         <span class="hljs-comment">// &quot;red&quot;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; (<code>default</code>) &#x43F;&#x435;&#x440;&#x435;&#x439;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; <code>sum</code> &#x456; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442; <code>color</code>  &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;. &#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x438;&#x439; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x443;.</p>
<h2 id="&#x43F;&#x435;&#x440;&#x435;&#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x437;&#x432;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x44C;">&#x41F;&#x435;&#x440;&#x435;&#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x44C;</h2>
<p>&#x41C;&#x43E;&#x436;&#x435; &#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x442;&#x430;&#x43A;, &#x449;&#x43E; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x449;&#x43E;&#x441;&#x44C;, &#x449;&#x43E; &#x432;&#x430;&#x448; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x432; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454;&#x442;&#x435; &#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A;&#x443; &#x437; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x43D;&#x435;&#x432;&#x435;&#x43B;&#x438;&#x43A;&#x438;&#x445; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;). &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x446;&#x435;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x438; &#x432;&#x436;&#x435; &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x443;&#x442;&#x456; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456;, &#x442;&#x430;&#x43A;&#x456; &#x44F;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> { sum } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;
<span class="hljs-keyword">export</span> { sum }
</code></pre>
<p>&#x426;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;, &#x430;&#x43B;&#x435; &#x454; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43E;&#x434;&#x438;&#x43D; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x43E;&#x436;&#x435; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x442;&#x435; &#x436; &#x441;&#x430;&#x43C;&#x435;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">export</span> { sum } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;
</code></pre>
<p>&#x426;&#x44F; &#x444;&#x43E;&#x440;&#x43C;&#x430; <code>export</code> &#x448;&#x443;&#x43A;&#x430;&#x454; &#x432; &#x437;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E;&#x43C;&#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x43D;&#x44F; <code>sum</code>, &#x430; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454; &#x439;&#x43E;&#x433;&#x43E;. &#x417;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x43E;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x431;&#x440;&#x430;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x456;&#x43D;&#x448;&#x435; &#x456;&#x43C;&apos;&#x44F;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">export</span> { sum <span class="hljs-keyword">as</span> add } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;
</code></pre>
<p>&#x422;&#x443;&#x442; <code>sum</code> &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x435; &#x437; <code>&quot;./example.js&quot;</code>, &#x430; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x435; &#x44F;&#x43A; <code>add</code>.</p>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x441;&#x435; &#x437; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x442;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; <code>*</code>:</p>
<pre><code class="lang-js"><span class="hljs-keyword">export</span> * <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;
</code></pre>
<p>&#x41F;&#x440;&#x438; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x456; &#x432;&#x441;&#x44C;&#x43E;&#x433;&#x43E;, &#x432;&#x438; &#x440;&#x430;&#x437;&#x43E;&#x43C; &#x437; &#x443;&#x441;&#x456;&#x43C;&#x430; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x430;&#x43C;&#x438;, &#x449;&#x43E; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x456;&#x43C;&#x2019;&#x44F;, &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x456; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x456; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x43F;&#x43B;&#x438;&#x43D;&#x443;&#x442;&#x438; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437; &#x432;&#x430;&#x448;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x44F;&#x43A;&#x449;&#x43E; <code>&quot;example.js&quot;</code> &#x43C;&#x430;&#x454; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x432;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x43D;&#x435; &#x432; &#x437;&#x43C;&#x43E;&#x437;&#x456; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x443;.</p>
<h2 id="&#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;-&#x431;&#x435;&#x437;-&#x437;&#x432;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;">&#x406;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x431;&#x435;&#x437; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;</h2>
<p>&#x414;&#x435;&#x44F;&#x43A;&#x456; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43D;&#x456;&#x447;&#x43E;&#x433;&#x43E; &#x43D;&#x435; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;, &#x430;, &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x43D;&#x43E;&#x441;&#x438;&#x442;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x432; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x438; &#x432; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;. &#x41D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x44F;&#x43A;&#x449;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x456; &#x432;&#x435;&#x440;&#x445;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x456;&#x432;&#x43D;&#x44F;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x456; &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x430;&#x43F;&#x43B;&#x44F;&#x44E;&#x442;&#x44C; &#x432; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;, &#x446;&#x435; &#x43D;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x434;&#x43E; &#x43D;&#x435;&#x457;. &#x417;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x456;&#x432;, &#x442;&#x430;&#x43A;&#x438;&#x445; &#x44F;&#x43A; <code>Array</code> &#x456;<code>Object</code>, &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x434;&#x43E; &#x446;&#x438;&#x445; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442;&#x456;&#x432; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x432;&#x456;&#x434;&#x434;&#x437;&#x435;&#x440;&#x43A;&#x430;&#x43B;&#x435;&#x43D;&#x456; &#x432; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;&#x445;.</p>
<p>&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E;, &#x449;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x434;&#x43E; &#x432;&#x441;&#x456;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x437; &#x456;&#x43C;&#x2019;&#x44F;&#x43C; <code>pushAll()</code>, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x41A;&#x43E;&#x434; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x431;&#x435;&#x437; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x456;&#x432; &#x447;&#x438; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x456;&#x432;</span>
<span class="hljs-built_in">Array</span>.prototype.pushAll = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">items</span>) </span>{

   <span class="hljs-comment">// items &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x43C;</span>
   <span class="hljs-keyword">if</span> (!<span class="hljs-built_in">Array</span>.isArray(items)) {
       <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> <span class="hljs-built_in">TypeError</span>(<span class="hljs-string">&quot;Argument must be an array.&quot;</span>);
   }

   <span class="hljs-comment">// &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x43C;&#x43E; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x456; push() &#x442;&#x430; spread &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;</span>
   <span class="hljs-keyword">return</span> <span class="hljs-keyword">this</span>.push(...items);
};
</code></pre>
<p>&#x426;&#x435; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x438;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;, &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x430;&#x431;&#x43E; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;. &#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x438;&#x439; &#x44F;&#x43A; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x442;&#x430;&#x43A; &#x456; &#x441;&#x446;&#x435;&#x43D;&#x430;&#x440;&#x456;&#x44E;. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x456;&#x43D; &#x43D;&#x435; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454; &#x43D;&#x456;&#x447;&#x43E;&#x433;&#x43E;, &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x43F;&#x440;&#x43E;&#x449;&#x435;&#x43D;&#x438;&#x439; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x431;&#x435;&#x437; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x445; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x44C;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">import</span> <span class="hljs-string">&quot;./example.js&quot;</span>;

<span class="hljs-keyword">let</span> colors = [<span class="hljs-string">&quot;red&quot;</span>, <span class="hljs-string">&quot;green&quot;</span>, <span class="hljs-string">&quot;blue&quot;</span>];
<span class="hljs-keyword">let</span> items = [];

items.pushAll(colors);
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43A;&#x43E;&#x434; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x454; &#x442;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>pushAll()</code>, &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; <code>pushAll()</code> &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; <code>pushAll()</code> &#x442;&#x435;&#x43F;&#x435;&#x440; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x443; &#x432;&#x441;&#x456;&#x445; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x430;&#x445; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;.</p>
<p>I&gt; &#x406;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x438; &#x431;&#x435;&#x437; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x448;&#x432;&#x438;&#x434;&#x448;&#x435; &#x437;&#x430; &#x432;&#x441;&#x435;, &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x43B;&#x456;&#x444;&#x456;&#x43B;&#x456;&#x432; (polyfills) &#x442;&#x430; &#x448;&#x438;&#x43C;&#x456;&#x432; (shims).</p>
<h2 id="&#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;">&#x417;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;</h2>
<p>&#x412; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; ECMAScript 6 &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x434;&#x43B;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;, &#x432;&#x456;&#x43D; &#x43D;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x44F;&#x43A; &#x457;&#x445; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x432;&#x430;&#x442;&#x438;. &#x426;&#x435; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x430; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457;, &#x44F;&#x43A;&#x430; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x430; &#x431;&#x443;&#x434;&#x438; &#x430;&#x433;&#x43D;&#x43E;&#x441;&#x442;&#x438;&#x447;&#x43D;&#x43E;&#x44E; &#x434;&#x43E; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457; &#x432; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x445; &#x43E;&#x442;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x445;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x442;&#x43E;&#x433;&#x43E; &#x449;&#x43E;&#x431; &#x43D;&#x430;&#x43C;&#x430;&#x433;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x438; &#x454;&#x434;&#x438;&#x43D;&#x443; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44E;, &#x44F;&#x43A;&#x430; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x438;&#x449; JavaScript, ECMAScript 6 &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x456; &#x442;&#x435;&#x437;&#x438; &#x437; &#x43C;&#x435;&#x445;&#x430;&#x43D;&#x456;&#x437;&#x43C;&#x443; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x44F;&#x43A;&#x438;&#x439; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x44D;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x43C; &#x434;&#x43E; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x456;&#x448;&#x43D;&#x44C;&#x43E;&#x457; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x43F;&#x456;&#x434; &#x43D;&#x430;&#x437;&#x432;&#x43E;&#x44E; <code>HostResolveImportedModule</code>. &#x412;&#x435;&#x431;-&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x43C; &#x442;&#x430; Node.js &#x43D;&#x430;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x440;&#x456;&#x448;&#x438;&#x442;&#x438;, &#x44F;&#x43A; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; <code>HostResolveImportedModule</code> &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C;, &#x449;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x43C;&#x430;&#x442;&#x438; &#x441;&#x435;&#x43D;&#x441; &#x434;&#x43B;&#x44F; &#x457;&#x445; &#x441;&#x435;&#x440;&#x435;&#x434;&#x43E;&#x432;&#x438;&#x449;.</p>
<h3 id="&#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;-&#x432;-&#x432;&#x435;&#x431;-&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445;">&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x432; &#x432;&#x435;&#x431;-&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445;</h3>
<p>&#x429;&#x435; &#x434;&#x43E; ECMAScript 6, &#x432;&#x435;&#x431;-&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438; &#x43C;&#x430;&#x43B;&#x438; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x456;&#x432; &#x449;&#x43E;&#x431; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x438; JavaScript &#x443; &#x432;&#x435;&#x431;-&#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x438;. &#x426;&#x438;&#x43C;&#x438; &#x43E;&#x43F;&#x446;&#x456;&#x44F;&#x43C;&#x438; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x456;&#x432; &#x454;:</p>
<ol>
<li>&#x417;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x43A;&#x43E;&#x434;&#x443; JavaScript &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430; <code>&lt;script&gt;</code> &#x437; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x43E;&#x43C; <code>src</code>, &#x449;&#x43E; &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x43C;&#x456;&#x441;&#x446;&#x435; &#x440;&#x43E;&#x437;&#x442;&#x430;&#x448;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x437; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x434;.</li>
<li>&#x412;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x443; JavaScript &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x432; &#x43F;&#x43E;&#x442;&#x456;&#x43A; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432; HTML &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430; <code>&lt;script&gt;</code> &#x431;&#x435;&#x437; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x430; <code>src</code>.</li>
<li>&#x417;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x434;&#x443; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; JavaScript &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &quot;&#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x430;&quot; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &quot;&#x432;&#x435;&#x431;-&#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x430;&quot; &#x430;&#x431;&#x43E; &quot;&#x441;&#x435;&#x440;&#x432;&#x456;&#x441;-&#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x430;&quot;).</li>
</ol>
<p>&#x414;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x432;&#x43D;&#x43E;&#x44E; &#x43C;&#x456;&#x440;&#x43E;&#x44E; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;, &#x432;&#x435;&#x431;-&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x431;&#x443;&#x43B;&#x438; &#x43E;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x438; &#x43A;&#x43E;&#x436;&#x435;&#x43D; &#x437; &#x446;&#x438;&#x445; &#x43C;&#x435;&#x445;&#x430;&#x43D;&#x456;&#x437;&#x43C;&#x456;&#x432;. &#x426;&#x456; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x456; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456; &#x432; HTML &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457;, &#x456; &#x44F; &#x431;&#x443;&#x434;&#x443; &#x43F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x457;&#x445; &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456;.</p>
<h4 id="&#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;-&#x437;-script">&#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x437; <code>&lt;script&gt;</code></h4>
<p>&#x41F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x43E;&#x44E; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430; <code>&lt;script&gt;</code> &#x454; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; JavaScript, &#x44F;&#x43A; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x456;&#x432; (&#x43D;&#x435; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;). &#x426;&#x435; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F;, &#x43A;&#x43E;&#x43B;&#x438; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; <code>type</code> &#x432;&#x456;&#x434;&#x441;&#x443;&#x442;&#x43D;&#x456;&#x439; &#x430;&#x431;&#x43E; &#x43A;&#x43E;&#x43B;&#x438; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; <code>type</code> &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442; &#x442;&#x438;&#x43F;&#x443; JavaScript (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, <code>&quot;text/javascript&quot;</code>). &#x415;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; <code>&lt;script&gt;</code> &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x430;&#x431;&#x43E; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x438;&#x442;&#x438; &#x444;&#x430;&#x439;&#x43B;, &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x439; &#x432; <code>src</code>. &#x414;&#x43B;&#x44F; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;module&quot;</code> &#x431;&#x443;&#x43B;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x43D;&#x43E; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43E;&#x43F;&#x446;&#x456;&#x457; <code>type</code>. &#x412;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; <code>type</code> &#x432; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>&quot;module&quot;</code> &#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x44F;&#x454; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x443;, &#x449;&#x43E; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x432;&#x430;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x439; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x430;&#x431;&#x43E; &#x43A;&#x43E;&#x434;, &#x449;&#x43E; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x444;&#x430;&#x439;&#x43B;&#x456;, &#x437;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x43C; &#x432; <code>src</code> &#x442;&#x440;&#x435;&#x431;&#x430; &#x44F;&#x43A; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;, &#x430; &#x43D;&#x435; &#x44F;&#x43A; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;. &#x41E;&#x441;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-html"><span class="hljs-comment">&lt;!-- &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x438;&#x442;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x437; JavaScript &#x444;&#x430;&#x439;&#x43B;&#x443; --&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span> <span class="hljs-attr">type</span>=<span class="hljs-string">&quot;module&quot;</span> <span class="hljs-attr">src</span>=<span class="hljs-string">&quot;module.js&quot;</span>&gt;</span><span class="undefined"></span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>

<span class="hljs-comment">&lt;!-- &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x435; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; --&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span> <span class="hljs-attr">type</span>=<span class="hljs-string">&quot;module&quot;</span>&gt;</span><span class="javascript">

<span class="hljs-keyword">import</span> { sum } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;

<span class="hljs-keyword">let</span> result = sum(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>);

</span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
</code></pre>
<p>&#x41F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; <code>&lt;script&gt;</code> &#x432; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x454; &#x437;&#x43E;&#x432;&#x43D;&#x456;&#x448;&#x43D;&#x456;&#x439; &#x444;&#x430;&#x439;&#x43B; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x44E;&#x447;&#x438; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; <code>src</code>. &#x404;&#x434;&#x438;&#x43D;&#x43E;&#x44E; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x432;&#x456;&#x434; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x446;&#x435;&#x43D;&#x430;&#x440;&#x456;&#x44E; &#x454; &#x442;&#x435;, &#x449;&#x43E; <code>&quot;module&quot;</code> &#x437;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x432; <code>type</code>. &#x414;&#x440;&#x443;&#x433;&#x438;&#x439; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; <code>&lt;script&gt;</code> &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x431;&#x435;&#x437;&#x43F;&#x43E;&#x441;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E; &#x432; &#x432;&#x435;&#x431;-&#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x443;. &#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x430; <code>result</code> &#x43D;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x430; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; (&#x44F;&#x43A; &#x446;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x432; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456; <code>&lt;script&gt;</code>) &#x456;, &#x43E;&#x442;&#x436;&#x435;, &#x43D;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; <code>window</code> &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;.</p>
<p>&#x42F;&#x43A; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x431;&#x430;&#x447;&#x438;&#x442;&#x438;, &#x43F;&#x456;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x43D;&#x430; &#x432;&#x435;&#x431;-&#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x430;&#x445; &#x434;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x435; &#x456; &#x441;&#x445;&#x43E;&#x436;&#x435; &#x437; &#x43F;&#x456;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x456;&#x432;. &#x41F;&#x440;&#x43E;&#x442;&#x435;, &#x454; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x44F;&#x43A; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;.</p>
<p>I&gt; &#x41C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x432;&#x438; &#x43F;&#x43E;&#x43C;&#x456;&#x442;&#x438;&#x43B;&#x438;, &#x449;&#x43E; <code>&quot;module&quot;</code> &#x43D;&#x435; &#x454; &#x442;&#x438;&#x43F;&#x43E;&#x43C; &#x432;&#x43C;&#x456;&#x441;&#x442;&#x443;, &#x44F;&#x43A; &#x442;&#x438;&#x43F; <code>&quot;text/javascript&quot;</code>. &#x424;&#x430;&#x439;&#x43B;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; JavaScript &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43E;&#x431;&#x441;&#x43B;&#x443;&#x433;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x437; &#x442;&#x438;&#x43C; &#x436;&#x435; &#x442;&#x438;&#x43F;&#x43E;&#x43C; &#x432;&#x43C;&#x456;&#x441;&#x442;&#x443; &#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x456;&#x432; JavaScript, &#x442;&#x430;&#x43A; &#x449;&#x43E; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x434;&#x438;&#x444;&#x435;&#x440;&#x435;&#x43D;&#x446;&#x456;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x432;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x43D;&#x43E; &#x43D;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x456; &#x442;&#x438;&#x43F;&#x443; &#x432;&#x43C;&#x456;&#x441;&#x442;&#x443;. &#x41A;&#x440;&#x456;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438; &#x456;&#x433;&#x43D;&#x43E;&#x440;&#x443;&#x44E;&#x442;&#x44C; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; <code>&lt;script&gt;</code>, &#x43A;&#x43E;&#x43B;&#x438; <code>type</code> &#x43D;&#x435;&#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x438;&#x439;, &#x442;&#x43E;&#x43C;&#x443; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438;, &#x44F;&#x43A;&#x456; &#x43D;&#x435; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x44E;&#x442;&#x44C; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x456;&#x433;&#x43D;&#x43E;&#x440;&#x443;&#x432;&#x430;&#x442;&#x438; &#x440;&#x44F;&#x434;&#x43E;&#x43A; <code>&lt;script type=&quot;module&quot;&gt;</code>, &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x443;&#x44E;&#x447;&#x438; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x443; &#x437;&#x432;&#x43E;&#x440;&#x43E;&#x442;&#x43D;&#x443; &#x441;&#x443;&#x43C;&#x456;&#x441;&#x43D;&#x456;&#x441;&#x442;&#x44C;.</p>
<h4 id="&#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44C;-&#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;-&#x443;-&#x432;&#x435;&#x431;-&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x456;">&#x41F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x443; &#x432;&#x435;&#x431;-&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x456;</h4>
<p>&#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x454; &#x443;&#x43D;&#x456;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C;&#x438; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E;, &#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x456;&#x432;, &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>import</code>, &#x449;&#x43E;&#x431; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438;, &#x449;&#x43E; &#x456;&#x43D;&#x448;&#x456; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x431;&#x443;&#x442;&#x438; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x456;, &#x449;&#x43E;&#x431; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;. &#x414;&#x43B;&#x44F; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x438; &#x446;&#x456;&#x454;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456;, <code>&lt;script type=&quot;module&quot;&gt;</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x434;&#x456;&#x454; &#x442;&#x430;&#x43A;, &#x43D;&#x456;&#x431;&#x438; &#x431;&#x443;&#x43B;&#x43E; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x430;&#x43D;&#x43E; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; <code>defer</code>.</p>
<p>&#x410;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; <code>defer</code> &#x43D;&#x435; &#x454; &#x43E;&#x431;&#x43E;&#x432;&apos;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x456;&#x432;, &#x430;&#x43B;&#x435; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;. &#x424;&#x430;&#x439;&#x43B; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x43F;&#x43E;&#x447;&#x43D;&#x435; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F;, &#x44F;&#x43A; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; HTML &#x43F;&#x430;&#x440;&#x441;&#x435;&#x440; &#x437;&#x443;&#x441;&#x442;&#x440;&#x456;&#x43D;&#x435; <code>&lt;script type=&quot;module&quot;&gt;</code> &#x437; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x43E;&#x43C; <code>src</code>, &#x430;&#x43B;&#x435; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x434;&#x43E; &#x442;&#x438;&#x445; &#x43F;&#x456;&#x440;, &#x43F;&#x43E;&#x43A;&#x438; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x43F;&#x440;&#x43E;&#x430;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x43E;. &#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x437;&apos;&#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; HTML-&#x444;&#x430;&#x439;&#x43B;&#x456;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; <code>&lt;script type=&quot;module&quot;&gt;</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x438;&#x439; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43C;, &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x44F;&#x43A;&#x449;&#x43E; &#x43E;&#x434;&#x438;&#x43D; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E;&#x433;&#x43E; <code>src</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-html"><span class="hljs-comment">&lt;!-- &#x446;&#x435;&#x439; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C; --&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span> <span class="hljs-attr">type</span>=<span class="hljs-string">&quot;module&quot;</span> <span class="hljs-attr">src</span>=<span class="hljs-string">&quot;module1.js&quot;</span>&gt;</span><span class="undefined"></span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>

<span class="hljs-comment">&lt;!-- &#x446;&#x435;&#x439; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43E; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43C; --&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span> <span class="hljs-attr">type</span>=<span class="hljs-string">&quot;module&quot;</span>&gt;</span><span class="javascript">
<span class="hljs-keyword">import</span> { sum } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example.js&quot;</span>;

<span class="hljs-keyword">let</span> result = sum(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>);
</span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>

<span class="hljs-comment">&lt;!-- &#x446;&#x435;&#x439; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x442;&#x440;&#x435;&#x442;&#x456;&#x43C; --&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span> <span class="hljs-attr">type</span>=<span class="hljs-string">&quot;module&quot;</span> <span class="hljs-attr">src</span>=<span class="hljs-string">&quot;module2.js&quot;</span>&gt;</span><span class="undefined"></span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
</code></pre>
<p>&#x426;&#x456; &#x442;&#x440;&#x438; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x438; <code>&lt;script&gt;</code> &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x456;, &#x442;&#x43E;&#x43C;&#x443; <code>module1.js</code> &#x431;&#x443;&#x434;&#x435; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x438;&#x439; &#x434;&#x43E; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x430; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x438;&#x439; &#x43F;&#x435;&#x440;&#x435;&#x434; <code>module2.js</code>.</p>
<p>&#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x43C;&#x43E;&#x436;&#x435; &#x43C;&#x430;&#x442;&#x438; <code>import</code> &#x437; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x430;&#x431;&#x43E; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;, &#x449;&#x43E; &#x443;&#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x44E;&#x454; &#x441;&#x43F;&#x440;&#x430;&#x432;&#x443;. &#x422;&#x43E;&#x43C;&#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x441;&#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x443; &#x43F;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x430;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F;, &#x449;&#x43E;&#x431; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x441;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; <code>import</code>. &#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>import</code> &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x454; &#x432;&#x438;&#x431;&#x456;&#x440;&#x43A;&#x443; (&#x437; &#x43C;&#x435;&#x440;&#x435;&#x436;&#x456; &#x430;&#x431;&#x43E; &#x437; &#x43A;&#x435;&#x448;&#x443;), &#x456; &#x436;&#x43E;&#x434;&#x435;&#x43D; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x442;&#x438;&#x445; &#x43F;&#x456;&#x440;, &#x43F;&#x43E;&#x43A;&#x438; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x456; &#x456; &#x43F;&#x440;&#x43E;&#x430;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x432;&#x441;&#x456; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x438; <code>import</code>.</p>
<p>&#x412;&#x441;&#x456; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;, &#x442;&#x456; &#x449;&#x43E; &#x44F;&#x432;&#x43D;&#x43E; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x456; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; <code>&lt;script type=&quot;module&quot;&gt;</code> &#x456; &#x442;&#x456;, &#x449;&#x43E; &#x43D;&#x435;&#x44F;&#x432;&#x43D;&#x43E; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x456; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; <code>import</code>, &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;. &#x423; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x43F;&#x43E;&#x432;&#x43D;&#x430; &#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F;:</p>
<ol>
<li>&#x417;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x438;&#x442;&#x438; &#x456; &#x43F;&#x440;&#x43E;&#x430;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; <code>module1.js</code>.</li>
<li>&#x420;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x43E; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x438;&#x442;&#x438; &#x456; &#x43F;&#x440;&#x43E;&#x430;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; <code>import</code> &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x438; &#x432; <code>module1.js</code>.</li>
<li>&#x41F;&#x440;&#x43E;&#x430;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;.</li>
<li>&#x420;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x43E; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x438;&#x442;&#x438; &#x456; &#x43F;&#x440;&#x43E;&#x430;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; <code>import</code> &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x438; &#x443; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;.</li>
<li>&#x417;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x438;&#x442;&#x438; &#x456; &#x43F;&#x440;&#x43E;&#x430;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438;  <code>module2.js</code>.</li>
<li>&#x420;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x43E; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x438;&#x442;&#x438; &#x456; &#x43F;&#x440;&#x43E;&#x430;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; <code>import</code> &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x438; &#x432; <code>module2.js</code></li>
</ol>
<p>&#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F;, &#x43D;&#x456;&#x447;&#x43E;&#x433;&#x43E; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x442;&#x438;&#x445; &#x43F;&#x456;&#x440;, &#x434;&#x43E;&#x43A;&#x438; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x440;&#x43E;&#x437;&#x456;&#x431;&#x440;&#x430;&#x43D;&#x438;&#x439;. &#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43D;&#x44F; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x430;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x443; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;, &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x435;:</p>
<ol>
<li>&#x420;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; <code>import</code> &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x456;&#x432; &#x434;&#x43B;&#x44F; <code>module1.js</code>.</li>
<li>&#x412;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; <code>module1.js</code>.</li>
<li>&#x420;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; <code>import</code> &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x456;&#x432; &#x434;&#x43B;&#x44F; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;.</li>
<li>&#x412;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;.</li>
<li>&#x420;&#x435;&#x43A;&#x443;&#x440;&#x441;&#x438;&#x432;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; <code>import</code> &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x456;&#x432; &#x434;&#x43B;&#x44F; <code>module2.js</code>.</li>
<li>&#x412;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; <code>module2.js</code>.</li>
</ol>
<p>&#x417;&#x432;&#x435;&#x440;&#x43D;&#x456;&#x442;&#x44C; &#x443;&#x432;&#x430;&#x433;&#x443; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x434;&#x456;&#x454;, &#x44F;&#x43A; &#x456; &#x456;&#x43D;&#x448;&#x456; &#x434;&#x432;&#x430; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x437;&#x430; &#x432;&#x438;&#x43D;&#x44F;&#x442;&#x43A;&#x43E;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x43A;&#x43E;&#x434; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x435;&#x43D; &#x431;&#x443;&#x442;&#x438; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x432; &#x43F;&#x435;&#x440;&#x448;&#x443; &#x447;&#x435;&#x440;&#x433;&#x443;. &#x412; &#x456;&#x43D;&#x448;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; <code>import</code> &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x456;&#x432; &#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x442;&#x430;&#x43A;&#x430; &#x441;&#x430;&#x43C;&#x430;.</p>
<p>I&gt; &#x410;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; <code>defer</code> &#x456;&#x433;&#x43D;&#x43E;&#x440;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; <code>&lt;script type=&quot;module&quot;&gt;</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x432;&#x436;&#x435; &#x432;&#x435;&#x434;&#x435; &#x441;&#x435;&#x431;&#x435; &#x442;&#x430;&#x43A; &#x43D;&#x430;&#x447;&#x435; <code>defer</code> &#x432;&#x436;&#x435; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F;.</p>
<h4 id="&#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x435;-&#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;-&#x432;-&#x432;&#x435;&#x431;-&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445;">&#x410;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x435; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x432; &#x432;&#x435;&#x431;-&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445;</h4>
<p>&#x41C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;, &#x432;&#x438; &#x432;&#x436;&#x435; &#x437;&#x43D;&#x430;&#x439;&#x43E;&#x43C;&#x456; &#x437; <code>async</code> &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430; <code>&lt;script&gt;</code>. &#x41F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; &#x437; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x430;&#x43C;&#x438;, <code>async</code> &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x443;&#x454;, &#x449;&#x43E; &#x444;&#x430;&#x439;&#x43B; &#x441;&#x446;&#x435;&#x43D;&#x430;&#x440;&#x456;&#x44E; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43E;, &#x44F;&#x43A; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x456;&#x43D; &#x431;&#x443;&#x434;&#x443; &#x43F;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x456; &#x440;&#x43E;&#x437;&#x456;&#x431;&#x440;&#x430;&#x43D;&#x438;&#x439;. &#x41F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; <code>async</code> &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x456;&#x432; &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456; &#x43D;&#x435; &#x432;&#x43F;&#x43B;&#x438;&#x432;&#x430;&#x454; &#x43D;&#x430; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x446;&#x435;&#x43D;&#x430;&#x440;&#x456;&#x457;. &#x421;&#x446;&#x435;&#x43D;&#x430;&#x440;&#x456;&#x457; &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F;, &#x44F;&#x43A; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x438;&#x43B;&#x43E;&#x441;&#x44C; &#x457;&#x445; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F;, &#x43D;&#x435; &#x447;&#x435;&#x43A;&#x430;&#x44E;&#x447;&#x438; &#x43F;&#x43E;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x43E;&#x437;&#x431;&#x43E;&#x440;&#x443; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;, &#x449;&#x43E; &#x457;&#x445; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C;.</p>
<p>&#x410;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; <code>async</code> &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x456; &#x434;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;. &#x412;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>async</code> &#x437; <code>&lt;script type=&quot;module&quot;&gt;</code> &#x437;&#x43C;&#x443;&#x448;&#x443;&#x454; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x438;&#x441;&#x44C; &#x430;&#x43D;&#x430;&#x43B;&#x43E;&#x433;&#x456;&#x447;&#x43D;&#x43E; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x443;. &#x404;&#x434;&#x438;&#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x43E;&#x43B;&#x44F;&#x433;&#x430;&#x454; &#x432; &#x442;&#x43E;&#x43C;&#x443;, &#x449;&#x43E; &#x432;&#x441;&#x456; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x438; &#x437; <code>import</code> &#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43E; &#x441;&#x430;&#x43C; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;. &#x426;&#x435; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x443;&#x454;, &#x449;&#x43E; &#x432;&#x441;&#x456; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x44F;&#x43A;&#x456; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x456; &#x439;&#x43E;&#x43C;&#x443; &#x449;&#x43E;&#x431; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x456; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x441;&#x430;&#x43C; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43E;; &#x432;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; <em>&#x43A;&#x43E;&#x43B;&#x438;</em> &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F;. &#x420;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x435;&#x43C;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-html"><span class="hljs-comment">&lt;!-- &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43D;&#x456;&#x44F;&#x43A;&#x43E;&#x457; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x456;&#x457;, &#x44F;&#x43A;&#x438;&#x439; &#x437; &#x43D;&#x438;&#x445; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x438;&#x439; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C; --&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span> <span class="hljs-attr">type</span>=<span class="hljs-string">&quot;module&quot;</span> <span class="hljs-attr">async</span> <span class="hljs-attr">src</span>=<span class="hljs-string">&quot;module1.js&quot;</span>&gt;</span><span class="undefined"></span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
<span class="hljs-tag">&lt;<span class="hljs-name">script</span> <span class="hljs-attr">type</span>=<span class="hljs-string">&quot;module&quot;</span> <span class="hljs-attr">async</span> <span class="hljs-attr">src</span>=<span class="hljs-string">&quot;module2.js&quot;</span>&gt;</span><span class="undefined"></span><span class="hljs-tag">&lt;/<span class="hljs-name">script</span>&gt;</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x454; &#x434;&#x432;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;, &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x456; &#x432; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;. &#x41D;&#x435;&#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x441;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x438;, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C;, &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x433;&#x43B;&#x44F;&#x43D;&#x443;&#x432;&#x448;&#x438; &#x43D;&#x430; &#x446;&#x435;&#x439; &#x43A;&#x43E;&#x434;. &#x42F;&#x43A;&#x449;&#x43E; <code>module1.js</code> &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x438;&#x442;&#x44C; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C; (&#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x447;&#x438; &#x432;&#x441;&#x456; &#x439;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x438; <code>import</code>), &#x442;&#x43E; &#x432;&#x456;&#x43D; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x432; &#x43F;&#x435;&#x440;&#x448;&#x443; &#x447;&#x435;&#x440;&#x433;&#x443;. &#x42F;&#x43A;&#x449;&#x43E; <code>module2.js</code> &#x437;&#x430;&#x43A;&#x456;&#x43D;&#x447;&#x438;&#x442;&#x44C; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C;, &#x442;&#x43E; &#x446;&#x435;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x431;&#x443;&#x434;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x432; &#x43F;&#x435;&#x440;&#x448;&#x443; &#x447;&#x435;&#x440;&#x433;&#x443;.</p>
<h4 id="&#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;-&#x443;-&#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456;-&#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x456;&#x432;">&#x417;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x443; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x201C;&#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x456;&#x432;&#x201D;</h4>
<p>&#x412;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x438;, &#x44F;&#x43A; &#x432;&#x435;&#x431;-&#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x438; &#x430;&#x431;&#x43E; &#x441;&#x435;&#x440;&#x432;&#x456;&#x441;-&#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x438;, &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C; &#x43A;&#x43E;&#x434; JavaScript &#x43F;&#x43E;&#x437;&#x430; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x43C; &#x432;&#x435;&#x431;-&#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x438;. &#x421;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x430; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x454; &#x432; &#x441;&#x435;&#x431;&#x435; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x435;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x443; <code>Worker</code> (&#x430;&#x431;&#x43E; &#x456;&#x43D;&#x448;&#x438;&#x439; &#x43A;&#x43B;&#x430;&#x441;) &#x456; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x443; &#x439;&#x43E;&#x433;&#x43E; &#x432; &#x444;&#x430;&#x439;&#x43B; JavaScript. &#x41C;&#x435;&#x445;&#x430;&#x43D;&#x456;&#x437;&#x43C; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x456;&#x432; &#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x456; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x456;&#x432;, &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x438;&#x442;&#x438; script.js &#x44F;&#x43A; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;</span>
<span class="hljs-keyword">let</span> worker = <span class="hljs-keyword">new</span> Worker(<span class="hljs-string">&quot;script.js&quot;</span>);
</code></pre>
<p>&#x414;&#x43B;&#x44F; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x438; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;, &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x443; HTML &#x434;&#x43E;&#x434;&#x430;&#x43B;&#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x434;&#x43B;&#x44F; &#x446;&#x438;&#x445; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x456;&#x432;. &#x414;&#x440;&#x443;&#x433;&#x438;&#x43C; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x454; &#x43E;&#x431;&apos;&#x454;&#x43A;&#x442; &#x437; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; <code>type</code> &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; <code>&quot;script&quot;</code>. &#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x438; <code>type</code> &#x432; <code>&quot;module&quot;</code> &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x438;&#x442;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x438;&#x442;&#x438; module.js &#x44F;&#x43A; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;</span>
<span class="hljs-keyword">let</span> worker = <span class="hljs-keyword">new</span> Worker(<span class="hljs-string">&quot;module.js&quot;</span>, { type: <span class="hljs-string">&quot;module&quot;</span> });
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x454; <code>module.js</code> &#x44F;&#x43A; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x443;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x448;&#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; <code>&quot;module&quot;</code> &#x44F;&#x43A; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>type</code>. (&#x412;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>type</code> &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#x456;&#x43C;&#x456;&#x442;&#x430;&#x446;&#x456;&#x457; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; <code>type</code> &#x443; <code>&lt;script&gt;</code> &#x434;&#x438;&#x444;&#x435;&#x440;&#x435;&#x43D;&#x446;&#x456;&#x44E;&#x454; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x456; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x438;.) &#x414;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x456;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432; &#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x456;&#x432; &#x443; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x456;.</p>
<p>&#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x456;-&#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x438;, &#x44F;&#x43A; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43E;, &#x442;&#x430;&#x43A;&#x456; &#x441;&#x430;&#x43C;&#x456;, &#x44F;&#x43A; &#x456; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x438;-&#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x438;, &#x430;&#x43B;&#x435; &#x454; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x432;&#x438;&#x43D;&#x44F;&#x442;&#x43A;&#x456;&#x432;. &#x41F;&#x43E;-&#x43F;&#x435;&#x440;&#x448;&#x435;, &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x438;-&#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x438; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x456; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x437; &#x442;&#x43E;&#x433;&#x43E; &#x43C;&#x456;&#x441;&#x446;&#x44F;, &#x449;&#x43E; &#x456; &#x432;&#x435;&#x431;-&#x441;&#x442;&#x43E;&#x440;&#x456;&#x43D;&#x43A;&#x430;, &#x43D;&#x430; &#x44F;&#x43A;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F;, &#x430;&#x43B;&#x435; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;-&#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x438; &#x43D;&#x435; &#x43D;&#x430;&#x441;&#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x456;. &#x425;&#x43E;&#x447;&#x430; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;-&#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x456; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x432;&#x430;&#x442;&#x438; &#x444;&#x430;&#x439;&#x43B;&#x438;, &#x44F;&#x43A;&#x456; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x456; Cross-Origin Resource Sharing (CORS) &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x438; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x430;&#x432; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x443;. &#x41F;&#x43E;-&#x434;&#x440;&#x443;&#x433;&#x435;, &#x432; &#x442;&#x43E;&#x439; &#x447;&#x430;&#x441; &#x44F;&#x43A; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;-&#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>self.importScripts()</code> &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x445; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x456;&#x432; &#x443; &#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;, <code>self.importScripts()</code> &#x437;&#x430;&#x432;&#x436;&#x434;&#x438; &#x437;&#x430;&#x437;&#x43D;&#x430;&#x454; &#x43D;&#x435;&#x432;&#x434;&#x430;&#x447;&#x456; &#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;-&#x432;&#x43E;&#x440;&#x43A;&#x435;&#x440;&#x456;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>import</code>.</p>
<h3 id="&#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;-&#x43F;&#x456;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x44F;-&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43D;&#x438;&#x445;-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;">&#x421;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430; &#x43F;&#x456;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43D;&#x438;&#x445; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;</h3>
<p>&#x412;&#x441;&#x456; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x438; &#x432; &#x440;&#x43E;&#x437;&#x434;&#x456;&#x43B;&#x456; &#x434;&#x43E; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x447;&#x430;&#x441;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x432;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x43D;&#x438;&#x439; &#x448;&#x43B;&#x44F;&#x445; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x442;&#x430;&#x43A;&#x438;&#x439; &#x44F;&#x43A; <code>&quot;./example.js&quot;</code>. &#x411;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438; &#x432;&#x438;&#x43C;&#x430;&#x433;&#x430;&#x44E;&#x442;&#x44C; &#x449;&#x43E;&#x431; &#x448;&#x43B;&#x44F;&#x445;&#x438; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x431;&#x443;&#x43B;&#x438; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x43C;&#x443; &#x437; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x445; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456;&#x432;:</p>
<ul>
<li>&#x41F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; <code>/</code>, &#x449;&#x43E;&#x431; &#x43F;&#x456;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x438;&#x442;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x437; &#x43A;&#x43E;&#x440;&#x435;&#x43D;&#x435;&#x432;&#x43E;&#x433;&#x43E; &#x43A;&#x430;&#x442;&#x430;&#x43B;&#x43E;&#x433;&#x443;</li>
<li>&#x41F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; <code>./</code>, &#x449;&#x43E;&#x431; &#x43F;&#x456;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x438;&#x442;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x437; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x430;&#x442;&#x430;&#x43B;&#x43E;&#x433;&#x443;</li>
<li>&#x41F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; <code>../</code>, &#x449;&#x43E;&#x431; &#x43F;&#x456;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x438;&#x442;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x437; &#x431;&#x430;&#x442;&#x44C;&#x43A;&#x456;&#x432;&#x441;&#x44C;&#x43A;&#x43E;&#x433;&#x43E; &#x43A;&#x430;&#x442;&#x430;&#x43B;&#x43E;&#x433;&#x443;</li>
<li>&#x424;&#x43E;&#x440;&#x43C;&#x430;&#x442; URL</li>
</ul>
<p>&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x43F;&#x440;&#x438;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x43E;, &#x449;&#x43E; &#x443; &#x432;&#x430;&#x441; &#x454; &#x444;&#x430;&#x439;&#x43B; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x440;&#x43E;&#x437;&#x442;&#x430;&#x448;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x432; <code>https://www.example.com/modules/module.js</code> &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442; &#x437; https://www.example.com/modules/example1.js</span>
<span class="hljs-keyword">import</span> { first } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;./example1.js&quot;</span>;

<span class="hljs-comment">// &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442; &#x437; https://www.example.com/example2.js</span>
<span class="hljs-keyword">import</span> { second } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;../example2.js&quot;</span>;

<span class="hljs-comment">// &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442; &#x437; https://www.example.com/example3.js</span>
<span class="hljs-keyword">import</span> { third } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;/example3.js&quot;</span>;

<span class="hljs-comment">// &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442; &#x437; https://www2.example.com/example4.js</span>
<span class="hljs-keyword">import</span> { fourth } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;https://www2.example.com/example4.js&quot;</span>;
</code></pre>
<p>&#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x437; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x432; &#x434;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; &#x454; &#x432;&#x430;&#x43B;&#x456;&#x434;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x456;, &#x432; &#x442;&#x43E;&#x43C;&#x443; &#x447;&#x438;&#x441;&#x43B;&#x456; &#x43F;&#x43E;&#x432;&#x43D;&#x438;&#x439; URL &#x432; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44C;&#x43E;&#x43C;&#x443; &#x440;&#x44F;&#x434;&#x43A;&#x443; (&#x432;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x431;&#x443;&#x442;&#x438; &#x432;&#x43F;&#x435;&#x432;&#x43D;&#x435;&#x43D;&#x456;, &#x449;&#x43E; <code>ww2.example.com</code> &#x43C;&#x430;&#x454; &#x43D;&#x430;&#x43B;&#x435;&#x436;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C; &#x43D;&#x430;&#x43B;&#x430;&#x448;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x441;&#x432;&#x456;&#x439; Cross-Origin Resource Sharing (CORS) &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x43A;, &#x449;&#x43E;&#x431; &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x438; &#x43C;&#x456;&#x436;&#x434;&#x43E;&#x43C;&#x435;&#x43D;&#x43D;&#x456; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F;). &#x426;&#x435; &#x454;&#x434;&#x438;&#x43D;&#x438;&#x439; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456;&#x432; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432;, &#x449;&#x43E; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x442;&#x438; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; (&#x445;&#x43E;&#x447;&#x430; &#x43F;&#x43E;&#x43A;&#x438; &#x449;&#x435; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x43D;&#x430; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x438;&#x442;&#x44C; &#x456;&#x43D;&#x449;&#x456; &#x448;&#x43B;&#x44F;&#x445;&#x438; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x456;&#x432;). &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x43D;&#x430; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x439; &#x43F;&#x43E;&#x433;&#x43B;&#x44F;&#x434; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x454; &#x43D;&#x435;&#x434;&#x456;&#x439;&#x441;&#x43D;&#x438;&#x43C;&#x438; &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x445; &#x456; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x434;&#x443;&#x442;&#x44C; &#x434;&#x43E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x438;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x43D;&#x435;&#x434;&#x456;&#x439;&#x441;&#x43D;&#x438;&#x439; - &#x43D;&#x435; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; /, ./, &#x447;&#x438; ../</span>
<span class="hljs-keyword">import</span> { first } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;example.js&quot;</span>;

<span class="hljs-comment">// &#x43D;&#x435;&#x434;&#x456;&#x439;&#x441;&#x43D;&#x438;&#x439; - &#x43D;&#x435; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;  /, ./, &#x447;&#x438; ../</span>
<span class="hljs-keyword">import</span> { second } <span class="hljs-keyword">from</span> <span class="hljs-string">&quot;example/index.js&quot;</span>;
</code></pre>
<p>&#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x437; &#x446;&#x438;&#x445; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x43E;&#x43C;. &#x414;&#x432;&#x430; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x43D;&#x435;&#x432;&#x456;&#x440;&#x43D;&#x438;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; (&#x43D;&#x435;&#x43C;&#x430;&#x454; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;) &#x43D;&#x435;&#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430;&#x432;&#x456;&#x442;&#x44C; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x43E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438;, &#x43A;&#x43E;&#x43B;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x456; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; <code>src</code> &#x432; &#x435;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x456; <code>&lt;script&gt;</code>. &#x426;&#x435; &#x441;&#x443;&#x442;&#x442;&#x454;&#x432;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x432; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x446;&#x456; &#x43C;&#x456;&#x436; <code>&lt;script&gt;</code> &#x442;&#x430; <code>import</code>.</p>
<h2 id="&#x43F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;">&#x41F;&#x456;&#x434;&#x441;&#x443;&#x43C;&#x43E;&#x43A;</h2>
<p>ECMAScript 6 &#x434;&#x43E;&#x434;&#x430;&#x454; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x434;&#x43E; &#x43C;&#x43E;&#x432;&#x438; &#x44F;&#x43A; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x43F;&#x430;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x456; &#x456;&#x43D;&#x43A;&#x430;&#x43F;&#x441;&#x443;&#x43B;&#x44F;&#x446;&#x456;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x456;. &#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x456;&#x43D;&#x430;&#x43A;&#x448;&#x435;, &#x43D;&#x456;&#x436; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x438;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x44E;&#x442;&#x44C; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x457;&#x445;&#x43D;&#x456;&#x43C;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x43C;&#x438; &#x432;&#x435;&#x440;&#x445;&#x43D;&#x44C;&#x43E;&#x433;&#x43E; &#x440;&#x456;&#x432;&#x43D;&#x44F;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;&#x43C;&#x438; &#x456; &#x43A;&#x43B;&#x430;&#x441;&#x430;&#x43C;&#x438;, &#x456; <code>this</code> &#x454; <code>undefined</code>. &#x414;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43D;&#x435; &#x442;&#x430;&#x43A;, &#x44F;&#x43A; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x438;, &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x431;&#x443;&#x442;&#x438; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x456; &#x432; &#x456;&#x43D;&#x448;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431;.</p>
<p>&#x412;&#x438; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;, &#x44F;&#x43A;&#x456; &#x431; &#x432;&#x438; &#x445;&#x43E;&#x442;&#x456;&#x43B;&#x438; &#x437;&#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x443; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;&#x445;. &#x417;&#x43C;&#x456;&#x43D;&#x43D;&#x456;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x456; &#x43A;&#x43B;&#x430;&#x441;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x456;, &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x434;&#x43E;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x434;&#x438;&#x43D; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;, &#x456;&#x43D;&#x448;&#x438;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x43C;&#x43E;&#x436;&#x435; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x432;&#x441;&#x456; &#x430;&#x431;&#x43E; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x437; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x445; &#x456;&#x43C;&#x435;&#x43D;. &#x426;&#x456; &#x456;&#x43C;&#x435;&#x43D;&#x430; &#x434;&#x456;&#x44E;&#x442;&#x44C; &#x442;&#x430;&#x43A;, &#x43D;&#x456;&#x431;&#x438; &#x457;&#x445; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43E; &#x447;&#x435;&#x440;&#x435;&#x437; <code>let</code>, &#x456; &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x431;&#x43B;&#x43E;&#x43A;&#x43E;&#x432;&#x456; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x456; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x431;&#x443;&#x442;&#x438; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x43D;&#x43E; &#x43E;&#x433;&#x43E;&#x43B;&#x43E;&#x448;&#x435;&#x43D;&#x456; &#x432; &#x442;&#x43E;&#x43C;&#x443; &#x436; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;.</p>
<p>&#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x43D;&#x456;&#x447;&#x43E;&#x433;&#x43E; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x43C;&#x430;&#x43D;&#x456;&#x43F;&#x443;&#x43B;&#x44E;&#x44E;&#x442;&#x44C; &#x447;&#x438;&#x43C;&#x43E;&#x441;&#x44C; &#x443; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;. &#x412; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x43C;&#x43E;&#x436;&#x43D;&#x430; &#x456;&#x43C;&#x43F;&#x43E;&#x440;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x437; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x431;&#x435;&#x437; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x434;&#x44C;-&#x44F;&#x43A;&#x438;&#x445; &#x437;&#x432;&#x2019;&#x44F;&#x437;&#x443;&#x432;&#x430;&#x43D;&#x44C; &#x443; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;.</p>
<p>&#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x43D;&#x456; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x432; &#x456;&#x43D;&#x448;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;, &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438; &#x432;&#x432;&#x435;&#x43B;&#x438; <code>&lt;script type=&quot;module&quot;&gt;</code> &#x449;&#x43E;&#x431; &#x441;&#x438;&#x433;&#x43D;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438;, &#x449;&#x43E; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x444;&#x430;&#x439;&#x43B; &#x430;&#x431;&#x43E; &#x432;&#x431;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x434; &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x438;&#x439; &#x443; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x456; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;. &#x424;&#x430;&#x439;&#x43B;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x456;&#x432; &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x435;&#x43D;&#x456; &#x437;&#x430; &#x434;&#x43E;&#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x43E;&#x44E; <code>&lt;script type=&quot;module&quot;&gt;</code> &#x437;&#x430;&#x432;&#x430;&#x43D;&#x442;&#x430;&#x436;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A;, &#x43D;&#x456;&#x431;&#x438; &#x434;&#x43E; &#x43D;&#x438;&#x445; &#x431;&#x443;&#x432; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x439; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442; <code>defer</code>. &#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x456; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x443;, &#x432; &#x44F;&#x43A;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x43D;&#x438; &#x437;&apos;&#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;, &#x44F;&#x43A; &#x442;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x431;&#x443;&#x434;&#x435; &#x43F;&#x43E;&#x432;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x440;&#x43E;&#x437;&#x456;&#x431;&#x440;&#x430;&#x43D;&#x438;&#x439;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="12-Proxies-and-Reflection.html" class="navigation navigation-prev " aria-label="Previous page: Глава 12: Проксі та АРІ рефлексії">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="A-Other-Changes.html" class="navigation navigation-next " aria-label="Next page: Додаток А: Дрібніші зміни у ECMAScript 6">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Глава 13: Інкапсуляція коду через модулі","level":"1.15","depth":1,"next":{"title":"Додаток А: Дрібніші зміни у ECMAScript 6","level":"1.16","depth":1,"path":"manuscript/A-Other-Changes.md","ref":"manuscript/A-Other-Changes.md","articles":[]},"previous":{"title":"Глава 12: Проксі та АРІ рефлексії","level":"1.14","depth":1,"path":"manuscript/12-Proxies-and-Reflection.md","ref":"manuscript/12-Proxies-and-Reflection.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","yametrika","ga","rss","github-buttons"],"pluginsConfig":{"yametrika":{},"github":{"url":"https://github.com/LambdaBooks/understandinges6ua"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Рoзуміння ECMAScript 6","description":"Український переклад книги «Understanding ES6».","author":"Denys Dovhan","site_url":"http://understandinges6.denysdovhan.com/","feed_url":"http://understandinges6.denysdovhan.com/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"github-buttons":{"repo":"LambdaBooks/understandinges6ua","types":["star"],"size":"small"},"ga":{"configuration":"auto","token":"UA-40496885-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/LambdaBooks/understandinges6ua/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"manuscript/13-Modules.md","mtime":"2017-02-23T12:11:22.205Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-02-23T12:13:00.674Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-yametrika/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

