
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Додаток А: Дрібніші зміни у ECMAScript 6 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="B-ECMAScript-7.html" />
    
    
    <link rel="prev" href="13-Modules.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"LambdaBooks/understandinges6ua","types":["star"],"size":"small"};
    </script>

    <link href="http://understandinges6.denysdovhan.com/rss.xml" title="Рoзуміння ECMAScript 6" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Рoзуміння ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-Block-Bindings.html">
            
                <a href="01-Block-Bindings.html">
            
                    
                    Глава 1: Блочне зв’язування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02-Strings-and-Regular-Expressions.html">
            
                <a href="02-Strings-and-Regular-Expressions.html">
            
                    
                    Глава 2: Рядки та регулярні вирази
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03-Functions.html">
            
                <a href="03-Functions.html">
            
                    
                    Глава 3: Функції
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="04-Objects.html">
            
                <a href="04-Objects.html">
            
                    
                    Глава 4: Розширена функціональність об’єктів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="05-Destructuring.html">
            
                <a href="05-Destructuring.html">
            
                    
                    Глава 5: Деструктурування для легшого доступу до даних
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="06-Symbols.html">
            
                <a href="06-Symbols.html">
            
                    
                    Глава 6: Символи та їх властивості
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="07-Sets-And-Maps.html">
            
                <a href="07-Sets-And-Maps.html">
            
                    
                    Глава 7: Множини та мапи
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="08-Iterators-And-Generators.html">
            
                <a href="08-Iterators-And-Generators.html">
            
                    
                    Глава 8: Ітератори та генератори
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="09-Classes.html">
            
                <a href="09-Classes.html">
            
                    
                    Глава 9: Знайомство з класами у JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10-Arrays.html">
            
                <a href="10-Arrays.html">
            
                    
                    Глава 10: Покращені можливості масивів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11-Promises.html">
            
                <a href="11-Promises.html">
            
                    
                    Глава 11: Проміси та асинхронне програмування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12-Proxies-and-Reflection.html">
            
                <a href="12-Proxies-and-Reflection.html">
            
                    
                    Глава 12: Проксі та АРІ рефлексії
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13-Modules.html">
            
                <a href="13-Modules.html">
            
                    
                    Глава 13: Інкапсуляція коду через модулі
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.16" data-path="A-Other-Changes.html">
            
                <a href="A-Other-Changes.html">
            
                    
                    Додаток А: Дрібніші зміни у ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="B-ECMAScript-7.html">
            
                <a href="B-ECMAScript-7.html">
            
                    
                    Додаток Б: Розуміння ECMAScript 7 (2016)
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Додаток А: Дрібніші зміни у ECMAScript 6</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x434;&#x43E;&#x434;&#x430;&#x442;&#x43E;&#x43A;-&#x430;-&#x434;&#x440;&#x456;&#x431;&#x43D;&#x456;&#x448;&#x456;-&#x437;&#x43C;&#x456;&#x43D;&#x438;">&#x414;&#x43E;&#x434;&#x430;&#x442;&#x43E;&#x43A; &#x410;: &#x414;&#x440;&#x456;&#x431;&#x43D;&#x456;&#x448;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438;</h1>
<p>&#x41F;&#x43E;&#x440;&#x443;&#x447; &#x437; &#x43C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x43C;&#x456;&#x43D;&#x430;&#x43C;&#x438;, &#x43F;&#x440;&#x43E; &#x44F;&#x43A;&#x456; &#x432;&#x436;&#x435; &#x440;&#x43E;&#x437;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x443; &#x446;&#x456;&#x439; &#x43A;&#x43D;&#x438;&#x437;&#x456;, ECMAScript 6 &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x440;&#x44F;&#x434; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x437;&#x43C;&#x456;&#x43D;, &#x44F;&#x43A;&#x456; &#x454; &#x43C;&#x435;&#x43D;&#x448; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C;&#x438;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x43C;&#x438; &#x436; &#x43A;&#x43E;&#x440;&#x438;&#x441;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x43D;&#x44F; JavaScript. &#x426;&#x456; &#x437;&#x43C;&#x456;&#x43D;&#x438; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x456;&#x43B;&#x438;&#x445; &#x447;&#x438;&#x441;&#x435;&#x43B;, &#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x43E;&#x432;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x44C;, &#x432;&#x434;&#x43E;&#x441;&#x43A;&#x43E;&#x43D;&#x430;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; Unicode&#x2013;&#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x442;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>__proto__</code>. &#x42F; &#x43E;&#x43F;&#x438;&#x448;&#x443; &#x457;&#x445; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x443;.</p>
<h2 id="&#x440;&#x43E;&#x431;&#x43E;&#x442;&#x430;-&#x437;-&#x446;&#x456;&#x43B;&#x438;&#x43C;&#x438;-&#x447;&#x438;&#x441;&#x43B;&#x430;&#x43C;&#x438;">&#x420;&#x43E;&#x431;&#x43E;&#x442;&#x430; &#x437; &#x446;&#x456;&#x43B;&#x438;&#x43C;&#x438; &#x447;&#x438;&#x441;&#x43B;&#x430;&#x43C;&#x438;</h2>
<p>JavaScript &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; IEEE 754 &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x446;&#x456;&#x43B;&#x438;&#x445; &#x442;&#x430; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x438;&#x445; &#x447;&#x438;&#x441;&#x435;&#x43B;, &#x44F;&#x43A;&#x430; &#x431;&#x443;&#x43B;&#x430; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x43E;&#x44E; &#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x438;&#x445; &#x43D;&#x435;&#x43F;&#x43E;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x44C; &#x43F;&#x440;&#x43E;&#x442;&#x44F;&#x433;&#x43E;&#x43C; &#x431;&#x430;&#x433;&#x430;&#x442;&#x44C;&#x43E;&#x445; &#x440;&#x43E;&#x43A;&#x456;&#x432;. &#x41C;&#x43E;&#x432;&#x430; &#x434;&#x43E;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x454; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x438;&#x445; &#x437;&#x443;&#x441;&#x438;&#x43B;&#x44C;, &#x449;&#x43E;&#x431; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;, &#x449;&#x43E; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x430;&#x43C; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x442;&#x443;&#x440;&#x431;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44F; &#x43F;&#x440;&#x43E; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x456; &#x43A;&#x43E;&#x434;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x447;&#x438;&#x441;&#x435;&#x43B;, &#x430;&#x43B;&#x435; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438; &#x432;&#x441;&#x435; &#x449;&#x435; &#x437;&#x2019;&#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x447;&#x430;&#x441; &#x432;&#x456;&#x434; &#x447;&#x430;&#x441;&#x443;. ECMAScript 6 &#x43F;&#x440;&#x430;&#x433;&#x43D;&#x435; &#x432;&#x438;&#x440;&#x456;&#x448;&#x438;&#x442;&#x438; &#x446;&#x435;, &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x447;&#x438; &#x446;&#x456;&#x43B;&#x456; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x43B;&#x435;&#x433;&#x448;&#x438;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x442;&#x430; &#x440;&#x43E;&#x431;&#x43E;&#x442;&#x438; &#x437; &#x43D;&#x438;&#x43C;&#x438;.</p>
<h3 id="&#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F;-&#x446;&#x456;&#x43B;&#x438;&#x445;-&#x447;&#x438;&#x441;&#x435;&#x43B;">&#x406;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F; &#x446;&#x456;&#x43B;&#x438;&#x445; &#x447;&#x438;&#x441;&#x435;&#x43B;</h3>
<p>&#x41F;&#x43E;&#x2013;&#x43F;&#x435;&#x440;&#x448;&#x435;, ECMAScript 6 &#x434;&#x43E;&#x434;&#x430;&#x454; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Number.isInteger()</code>, &#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x447;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x454; &#x446;&#x456;&#x43B;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x443; JavaScript. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; JavaScript &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; IEEE 754 &#x434;&#x43B;&#x44F; &#x432;&#x456;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x447;&#x438;&#x441;&#x435;&#x43B; &#x43E;&#x431;&#x43E;&#x445; &#x442;&#x438;&#x43F;&#x456;&#x432;, &#x434;&#x456;&#x439;&#x441;&#x43D;&#x456; &#x442;&#x430; &#x446;&#x456;&#x43B;&#x456; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x2014;&#x440;&#x456;&#x437;&#x43D;&#x43E;&#x43C;&#x443;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Number.isInteger()</code> &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x430;&#x433;&#x438; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x456; &#x43A;&#x43E;&#x43B;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x440;&#x443;&#x448;&#x456;&#x439; JavaScript &#x434;&#x438;&#x432;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;, &#x449;&#x43E;&#x431; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x447;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x454; &#x446;&#x456;&#x43B;&#x438;&#x43C; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x43C;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x441;&#x435;&#x43B;, &#x44F;&#x43A;&#x456; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x44E;&#x442;&#x44C; &#x44F;&#x43A; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x456;, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x446;&#x456;&#x43B;&#x456;, &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Number.isInteger()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x43D;&#x435; <code>true</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Number</span>.isInteger(<span class="hljs-number">25</span>));      <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Number</span>.isInteger(<span class="hljs-number">25.0</span>));    <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Number</span>.isInteger(<span class="hljs-number">25.1</span>));    <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x456;, <code>Number.isInteger()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>true</code> &#x456; &#x434;&#x43B;&#x44F; <code>25</code>, &#x456; &#x434;&#x43B;&#x44F; <code>25.0</code>, &#x43D;&#x435; &#x434;&#x438;&#x432;&#x43B;&#x44F;&#x447;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x454; &#x432;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x430;&#x454; &#x44F;&#x43A; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x435;. &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x435; &#x434;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x435;&#x441;&#x44F;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x457; &#x442;&#x43E;&#x447;&#x43A;&#x438; &#x434;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x43D;&#x435; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x439;&#x43E;&#x433;&#x43E; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x438;&#x43C; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x43C; &#x443; JavaScript. &#x41E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>25.0</code> &#x43D;&#x430;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x456; &#x454; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x43C; <code>25</code>, &#x432;&#x43E;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x446;&#x456;&#x43B;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x447;&#x438;&#x441;&#x43B;&#x43E; <code>25.1</code> &#x437;&#x431;&#x435;&#x440;&#x456;&#x433;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; &#x432;&#x43E;&#x43D;&#x43E; &#x454; &#x434;&#x435;&#x441;&#x44F;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x43C; &#x434;&#x440;&#x43E;&#x431;&#x43E;&#x43C;.</p>
<h3 id="&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x456;-&#x446;&#x456;&#x43B;&#x456;-&#x447;&#x438;&#x441;&#x43B;&#x430;">&#x411;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x456; &#x446;&#x456;&#x43B;&#x456; &#x447;&#x438;&#x441;&#x43B;&#x430;</h3>
<p>IEEE 754 &#x43C;&#x43E;&#x436;&#x435; &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x438; &#x446;&#x456;&#x43B;&#x456; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x43C;&#x456;&#x436; -2^53^ &#x442;&#x430; 2^53^, &#x430; &#x43F;&#x43E;&#x437;&#x430; &#x446;&#x438;&#x43C; &#x201C;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x438;&#x43C;&#x201D; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x436;&#x43A;&#x43E;&#x43C;, &#x434;&#x432;&#x456;&#x439;&#x43A;&#x43E;&#x432;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x43D;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x43B;&#x44F; &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x43E;&#x445; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;. &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; JavaScript &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x43E;, &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x438; &#x446;&#x456;&#x43B;&#x456; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x443; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x436;&#x43A;&#x443; IEEE 754. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Math</span>.pow(<span class="hljs-number">2</span>, <span class="hljs-number">53</span>));      <span class="hljs-comment">// 9007199254740992</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Math</span>.pow(<span class="hljs-number">2</span>, <span class="hljs-number">53</span>) + <span class="hljs-number">1</span>);  <span class="hljs-comment">// 9007199254740992</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x43E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x440;&#x456;&#x437;&#x43D;&#x438;&#x445; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x456; &#x446;&#x456;&#x43B;&#x456; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x443; JavaScript. &#x426;&#x435;&#x439; &#x435;&#x444;&#x435;&#x43A;&#x442; &#x441;&#x442;&#x430;&#x454; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x43F;&#x43E;&#x43C;&#x456;&#x442;&#x43D;&#x456;&#x448;&#x438;&#x43C; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x434;&#x430;&#x43B;&#x44C;&#x448;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x445;&#x43E;&#x434;&#x456; &#x437;&#x430; &#x43C;&#x435;&#x436;&#x456; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x456;&#x430;&#x43F;&#x430;&#x437;&#x43E;&#x43D;&#x443;.</p>
<p>ECMAScript 6 &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Number.isSafeInteger()</code> &#x434;&#x43B;&#x44F; &#x43A;&#x440;&#x430;&#x449;&#x43E;&#x457; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x446;&#x456;&#x43B;&#x438;&#x445; &#x447;&#x438;&#x441;&#x435;&#x43B;, &#x44F;&#x43A;&#x456; &#x43C;&#x43E;&#x432;&#x430; &#x43C;&#x43E;&#x436;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x438; &#x442;&#x43E;&#x447;&#x43D;&#x43E;. &#x412;&#x456;&#x43D; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x434;&#x43E;&#x434;&#x430;&#x454; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>Number.MAX_SAFE_INTEGER</code> &#x442;&#x430; <code>Number.MIN_SAFE_INTEGER</code> &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x43E;&#x433;&#x43E; &#x442;&#x430; &#x43D;&#x430;&#x439;&#x43C;&#x435;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x436;&#x43A;&#x443; &#x446;&#x456;&#x43B;&#x438;&#x445; &#x447;&#x438;&#x441;&#x435;&#x43B;, &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;. &#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Number.isSafeInteger()</code> &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x443;&#x454;, &#x449;&#x43E;&#x431; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x431;&#x443;&#x43B;&#x43E; &#x446;&#x456;&#x43B;&#x43E;&#x447;&#x438;&#x441;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x456; &#x43F;&#x43E;&#x442;&#x440;&#x430;&#x43F;&#x43B;&#x44F;&#x43B;&#x43E; &#x443; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x43C;&#x456;&#x436;&#x43E;&#x43A; &#x446;&#x456;&#x43B;&#x438;&#x445; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;, &#x44F;&#x43A; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> inside = <span class="hljs-built_in">Number</span>.MAX_SAFE_INTEGER,
    outside = inside + <span class="hljs-number">1</span>;

<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Number</span>.isInteger(inside));          <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Number</span>.isSafeInteger(inside));      <span class="hljs-comment">// true</span>

<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Number</span>.isInteger(outside));         <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Number</span>.isSafeInteger(outside));     <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x427;&#x438;&#x441;&#x43B;&#x43E; <code>inside</code> &#x454; &#x43D;&#x430;&#x439;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x438;&#x43C; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x438;&#x43C; &#x446;&#x456;&#x43B;&#x438;&#x43C; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x43C;, &#x442;&#x43E;&#x43C;&#x443; <code>true</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437; &#x43E;&#x431;&#x43E;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; <code>Number.isInteger()</code> &#x442;&#x430; <code>Number.isSafeInteger()</code>. &#x427;&#x438;&#x441;&#x43B;&#x43E; <code>outside</code> &#x454; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C; &#x43F;&#x456;&#x434;&#x43E;&#x437;&#x440;&#x456;&#x43B;&#x438;&#x43C; &#x446;&#x456;&#x43B;&#x43E;&#x447;&#x438;&#x441;&#x435;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x456; &#x432;&#x43E;&#x43D;&#x43E; &#x43D;&#x435; &#x432;&#x432;&#x430;&#x436;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x438;&#x43C;, &#x43D;&#x435; &#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x43E; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x446;&#x456;&#x43B;&#x438;&#x43C; &#x447;&#x438;&#x441;&#x43B;&#x43E;&#x43C;.</p>
<p>&#x417;&#x430;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439;, &#x437;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x430;&#x440;&#x438;&#x444;&#x43C;&#x435;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x445; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439; &#x430;&#x431;&#x43E; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x43D;&#x44C;, &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43B;&#x438;&#x448;&#x435; &#x437; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x438;&#x43C;&#x438; &#x446;&#x456;&#x43B;&#x438;&#x43C;&#x438; &#x447;&#x438;&#x441;&#x43B;&#x430;&#x43C;&#x438;, &#x442;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>Number.isSafeInteger()</code> &#x44F;&#x43A; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443; &#x432;&#x430;&#x43B;&#x456;&#x434;&#x430;&#x446;&#x456;&#x457; &#x432;&#x432;&#x43E;&#x434;&#x443; &#x431;&#x443;&#x43B;&#x43E; &#x431; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x43E;&#x44E; &#x456;&#x434;&#x435;&#x454;&#x44E;.</p>
<h2 id="&#x43D;&#x43E;&#x432;&#x456;-&#x43C;&#x430;&#x442;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456;-&#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;">&#x41D;&#x43E;&#x432;&#x456; &#x43C;&#x430;&#x442;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438;</h2>
<p>&#x41D;&#x43E;&#x432;&#x438;&#x439; &#x430;&#x43A;&#x446;&#x435;&#x43D;&#x442; &#x43D;&#x430; &#x456;&#x433;&#x440;&#x430;&#x445; &#x442;&#x430; &#x433;&#x440;&#x430;&#x444;&#x456;&#x446;&#x456;, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x456;&#x432; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, ECMAScript 6 &#x434;&#x43E;&#x434;&#x430;&#x432; &#x443; JavaScript &#x442;&#x438;&#x43F;&#x456;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x438;, &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x456;&#x432; &#x434;&#x43E; &#x443;&#x441;&#x432;&#x456;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x440;&#x443;&#x448;&#x456;&#x457; JavaScript &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x43C;&#x430;&#x442;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x44C; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x435;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;. &#x41F;&#x440;&#x43E;&#x442;&#x435; &#x441;&#x442;&#x440;&#x430;&#x442;&#x435;&#x433;&#x456;&#x457; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x456;&#x437;&#x430;&#x446;&#x456;&#x457;, &#x44F;&#x43A; &#x43E;&#x442; asm.js, &#x44F;&#x43A;&#x456; &#x434;&#x43B;&#x44F; &#x43F;&#x456;&#x434;&#x432;&#x438;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x448;&#x432;&#x438;&#x434;&#x43A;&#x43E;&#x434;&#x456;&#x457; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x44E;&#x442;&#x44C; &#x43D;&#x430; &#x43F;&#x456;&#x434;&#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x43D;&#x456; JavaScript, &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x44E;&#x442;&#x44C; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x456;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x456;&#x457; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x44C; &#x43D;&#x430;&#x439;&#x448;&#x432;&#x438;&#x434;&#x448;&#x438;&#x43C; &#x448;&#x43B;&#x44F;&#x445;&#x43E;&#x43C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x43A;&#x43E;&#x43B;&#x438; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x442;&#x440;&#x430;&#x43A;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x44F;&#x43A; 32-&#x431;&#x456;&#x442;&#x43D;&#x456; &#x446;&#x456;&#x43B;&#x456; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x430;&#x431;&#x43E; 64-&#x431;&#x456;&#x442;&#x43D;&#x456; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x456; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x454; &#x432;&#x430;&#x436;&#x43B;&#x438;&#x432;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#x430;&#x43F;&#x430;&#x440;&#x430;&#x442;&#x43D;&#x438;&#x445; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439;, &#x44F;&#x43A;&#x456; &#x454; &#x43D;&#x430;&#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x448;&#x432;&#x438;&#x434;&#x448;&#x438;&#x43C;&#x438; &#x437;&#x430; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;.</p>
<p>&#x412; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;, ECMAScript 6 &#x434;&#x43E;&#x434;&#x430;&#x454; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442; <code>Math</code>, &#x434;&#x43B;&#x44F; &#x43F;&#x456;&#x434;&#x432;&#x438;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x448;&#x432;&#x438;&#x434;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x43C;&#x430;&#x442;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x44C;. &#x41F;&#x456;&#x434;&#x432;&#x438;&#x449;&#x435;&#x43D;&#x43D;&#x44F; &#x448;&#x432;&#x438;&#x434;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x44C; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43F;&#x43E;&#x43A;&#x440;&#x430;&#x449;&#x443;&#x454; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x443; &#x448;&#x432;&#x438;&#x434;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x443;&#x44E;&#x442;&#x44C; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x44C;, &#x44F;&#x43A; &#x43E;&#x442; &#x433;&#x440;&#x430;&#x444;&#x456;&#x447;&#x43D;&#x456; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x438;. &#x41D;&#x43E;&#x432;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x43B;&#x456;&#x447;&#x435;&#x43D;&#x456; &#x43D;&#x438;&#x436;&#x447;&#x435;:</p>
<ul>
<li><code>Math.acosh(x)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43E;&#x431;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x438;&#x439; &#x433;&#x456;&#x43F;&#x435;&#x440;&#x431;&#x43E;&#x43B;&#x456;&#x447;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x441;&#x438;&#x43D;&#x443;&#x441; <code>x</code>;</li>
<li><code>Math.asinh(x)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43E;&#x431;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x438;&#x439; &#x433;&#x456;&#x43F;&#x435;&#x440;&#x431;&#x43E;&#x43B;&#x456;&#x447;&#x43D;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x443;&#x441; <code>x</code>;</li>
<li><code>Math.atanh(x)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43E;&#x431;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x438;&#x439; &#x433;&#x456;&#x43F;&#x435;&#x440;&#x431;&#x43E;&#x43B;&#x456;&#x447;&#x43D;&#x438;&#x439; &#x442;&#x430;&#x43D;&#x433;&#x435;&#x43D;&#x441; <code>x</code>;</li>
<li><code>Math.cbrt(x)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43A;&#x43E;&#x440;&#x456;&#x43D;&#x44C; &#x43A;&#x443;&#x431;&#x456;&#x447;&#x43D;&#x438;&#x439; &#x437; <code>x</code>;</li>
<li><code>Math.clz32(x)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x435;&#x434;&#x443;&#x447;&#x438;&#x445; &#x43D;&#x443;&#x43B;&#x44C;&#x43E;&#x432;&#x438;&#x445; &#x431;&#x456;&#x442;&#x456;&#x432; &#x443; 32-&#x431;&#x456;&#x442;&#x43D;&#x43E;&#x43C;&#x443; &#x446;&#x456;&#x43B;&#x43E;&#x447;&#x438;&#x441;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x456; <code>x</code>;</li>
<li><code>Math.cosh(x)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x433;&#x456;&#x43F;&#x435;&#x440;&#x431;&#x43E;&#x43B;&#x456;&#x447;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x441;&#x438;&#x43D;&#x443;&#x441; <code>x</code>;</li>
<li><code>Math.expm1(x)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x432;&#x456;&#x434;&#x43D;&#x456;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; 1 &#x432;&#x456;&#x434; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437; <code>x</code>;</li>
<li><code>Math.fround(x)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43D;&#x430;&#x439;&#x431;&#x43B;&#x438;&#x436;&#x447;&#x435; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E; &#x43E;&#x434;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x43E;&#x457; &#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432;&#x456;&#x434; <code>x</code>;</li>
<li><code>Math.hypot(...values)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x440;&#x456;&#x43D;&#x44C; &#x441;&#x443;&#x43C;&#x438; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x456;&#x432; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x437; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;;</li>
<li><code>Math.imul(x, y)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x456;&#x441;&#x442;&#x438;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; 32-&#x431;&#x456;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x432;&#x43E;&#x445; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x456;&#x432;;</li>
<li><code>Math.log1p(x)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43D;&#x430;&#x442;&#x443;&#x440;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43B;&#x43E;&#x433;&#x430;&#x440;&#x438;&#x444;&#x43C; &#x432;&#x456;&#x434; <code>1 + x</code>;</li>
<li><code>Math.log10(x)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43B;&#x43E;&#x433;&#x430;&#x440;&#x438;&#x444;&#x43C; &#x437;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43E;&#x44E; 10 &#x432;&#x456;&#x434; <code>x</code>;</li>
<li><code>Math.log2(x)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43B;&#x43E;&#x433;&#x430;&#x440;&#x438;&#x444;&#x43C; &#x437;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43E;&#x44E; 2 &#x432;&#x456;&#x434; <code>x</code>;</li>
<li><code>Math.sign(x)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; -1, &#x44F;&#x43A;&#x449;&#x43E; <code>x</code> &#x454; &#x432;&#x456;&#x434;&#x2019;&#x454;&#x43C;&#x43D;&#x438;&#x43C;, 0 &#x44F;&#x43A;&#x449;&#x43E; <code>x</code> &#x440;&#x456;&#x432;&#x43D;&#x438;&#x439; +0 &#x430;&#x431;&#x43E; -0 &#x442;&#x430; 1, &#x44F;&#x43A;&#x449;&#x43E; <code>x</code> &#x454; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43D;&#x456;&#x43C;;</li>
<li><code>Math.sinh(x)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x433;&#x456;&#x43F;&#x435;&#x440;&#x431;&#x43E;&#x43B;&#x456;&#x447;&#x43D;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x443;&#x441; <code>x</code>;</li>
<li><code>Math.tanh(x)</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x433;&#x456;&#x43F;&#x435;&#x440;&#x431;&#x43E;&#x43B;&#x456;&#x447;&#x43D;&#x438;&#x439; &#x442;&#x430;&#x43D;&#x433;&#x435;&#x43D;&#x441; <code>x</code>;</li>
<li><code>Math.trunc(x)</code> &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x454; &#x434;&#x440;&#x43E;&#x431;&#x43E;&#x432;&#x443; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x443; &#x437; &#x434;&#x456;&#x439;&#x441;&#x43D;&#x43E;&#x433;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x430; &#x442;&#x430; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x446;&#x456;&#x43B;&#x435; &#x447;&#x438;&#x441;&#x43B;&#x43E;.</li>
</ul>
<p>&#x414;&#x435;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x435; &#x43F;&#x43E;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; &#x442;&#x430; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x432;&#x43E;&#x43D;&#x438; &#x440;&#x43E;&#x431;&#x43B;&#x44F;&#x442;&#x44C;, &#x432;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x437;&#x430; &#x43C;&#x435;&#x436;&#x456; &#x446;&#x456;&#x454;&#x457; &#x43A;&#x43D;&#x438;&#x433;&#x438;. &#x41F;&#x440;&#x43E;&#x442;&#x435;, &#x44F;&#x43A;&#x449;&#x43E; &#x432;&#x430;&#x448; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43E;&#x43A; &#x43C;&#x430;&#x454; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x438; &#x437;&#x430;&#x433;&#x430;&#x43B;&#x44C;&#x43D;&#x456; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x44F;, &#x43D;&#x435; &#x437;&#x430;&#x431;&#x443;&#x434;&#x44C;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x442;&#x438; &#x43D;&#x43E;&#x432;&#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x438; <code>Math</code> &#x43F;&#x435;&#x440;&#x435;&#x434; &#x442;&#x438;&#x43C;, &#x44F;&#x43A; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x438; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x44E; &#x441;&#x430;&#x43C;&#x43E;&#x441;&#x442;&#x456;&#x439;&#x43D;&#x43E;.</p>
<h2 id="unicode&#x2013;&#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x438;">Unicode&#x2013;&#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x438;</h2>
<p>ECMAScript 6 &#x43F;&#x440;&#x43E;&#x43F;&#x43E;&#x43D;&#x443;&#x454; &#x43A;&#x440;&#x430;&#x449;&#x443; &#x43F;&#x456;&#x434;&#x442;&#x440;&#x438;&#x43C;&#x43A;&#x443; Unicode, &#x43D;&#x456;&#x436; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; JavaScript, &#x456; &#x432;&#x456;&#x43D; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x454; &#x442;&#x435;, &#x44F;&#x43A;&#x456; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x438; &#x43C;&#x43E;&#x436;&#x443;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;. &#x423; ECMAScript 5 &#x432;&#x436;&#x435; &#x43C;&#x43E;&#x436;&#x43B;&#x438;&#x432;&#x43E; &#x431;&#x443;&#x43B;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; Unicod&#x2013;&#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x43B;&#x44F; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x412;&#x430;&#x43B;&#x456;&#x434;&#x43D;&#x43E; &#x443; ECMAScript 5 &#x442;&#x430; 6</span>
<span class="hljs-keyword">var</span> \u0061 = <span class="hljs-string">&quot;abc&quot;</span>;

<span class="hljs-built_in">console</span>.log(\u0061);     <span class="hljs-comment">// &quot;abc&quot;</span>

<span class="hljs-comment">// &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x43E; &#x434;&#x43E;:</span>
<span class="hljs-built_in">console</span>.log(a);          <span class="hljs-comment">// &quot;abc&quot;</span>
</code></pre>
<p>&#x41F;&#x456;&#x441;&#x43B;&#x44F; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; <code>var</code>, &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, &#x434;&#x43B;&#x44F; &#x437;&#x432;&#x435;&#x440;&#x43D;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x457; &#x432;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x456; <code>\u0061</code>, &#x456; <code>a</code>. &#x423; ECMAScript 6 &#x432;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x456; &#x43A;&#x435;&#x440;&#x456;&#x432;&#x43D;&#x456; &#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x412;&#x430;&#x43B;&#x456;&#x434;&#x43D;&#x43E; &#x443; ECMAScript 5 &#x442;&#x430; 6</span>
<span class="hljs-keyword">var</span> \u{<span class="hljs-number">61</span>} = <span class="hljs-string">&quot;abc&quot;</span>;

<span class="hljs-built_in">console</span>.log(\u{<span class="hljs-number">61</span>});      <span class="hljs-comment">// &quot;abc&quot;</span>

<span class="hljs-comment">// &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x43E; &#x434;&#x43E;:</span>
 <span class="hljs-built_in">console</span>.log(a);          <span class="hljs-comment">// &quot;abc&quot;</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x430;&#x43C;&#x456;&#x43D;&#x44F;&#x454; <code>\u0061</code> &#x43D;&#x430; &#x439;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x43E;&#x432;&#x438;&#x439; &#x435;&#x43A;&#x432;&#x456;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;. &#x423; &#x432;&#x441;&#x456;&#x445; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x432;&#x456;&#x43D; &#x440;&#x43E;&#x431;&#x438;&#x442;&#x44C; &#x442;&#x435; &#x441;&#x430;&#x43C;&#x435;, &#x449;&#x43E; &#x456; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x456;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;.</p>
<p>&#x41A;&#x440;&#x456;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, ECMAScript 6 &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454; &#x432;&#x430;&#x43B;&#x456;&#x434;&#x43D;&#x456; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x443; &#x432;&#x456;&#x434;&#x43F;&#x43E;&#x432;&#x456;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x434;&#x43E; <a href="http://unicode.org/reports/tr31/" target="_blank">Unicode Standard Annex #31: Unicode Identifier and Pattern Syntax</a>, &#x44F;&#x43A;&#x438;&#x439; &#x434;&#x430;&#x454; &#x442;&#x430;&#x43A;&#x456; &#x432;&#x43A;&#x430;&#x437;&#x456;&#x432;&#x43A;&#x438;:</p>
<ol>
<li>&#x41F;&#x435;&#x440;&#x448;&#x438;&#x43C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x43C; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x435;&#x43D; &#x431;&#x443;&#x442;&#x438; <code>$</code>, <code>_</code> &#x430;&#x431;&#x43E; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x456;&#x43D;&#x448;&#x438;&#x439; Unicode&#x2013;&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x437; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x44E; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; <code>ID_Start</code>.</li>
<li>&#x41A;&#x43E;&#x436;&#x435;&#x43D; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x441;&#x443;&#x431;&#x43F;&#x43E;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x43E;&#x432;&#x438;&#x43D;&#x435;&#x43D; &#x431;&#x443;&#x442;&#x438; <code>$</code>, <code>_</code>, <code>\u200c</code> (zero-width non-joiner), <code>\u200d</code> (zero-width joiner) &#x430;&#x431;&#x43E; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x456;&#x43D;&#x448;&#x438;&#x439; Unicode&#x2013;&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x437; &#x43F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x43E;&#x44E; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44E; <code>ID_Start</code>.</li>
</ol>
<p>&#x41F;&#x43E;&#x445;&#x456;&#x434;&#x43D;&#x456; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>ID_Start</code> &#x442;&#x430; <code>ID_Continue</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456; &#x432; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x456; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x442;&#x430; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x456;&#x432; Unicode (Unicode Identifier and Pattern Syntax) &#x44F;&#x43A; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x454; &#x43F;&#x440;&#x438;&#x439;&#x43D;&#x44F;&#x442;&#x43D;&#x438;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x456;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;, &#x44F;&#x43A; &#x43E;&#x442; &#x437;&#x43C;&#x456;&#x43D;&#x43D;&#x438;&#x445; &#x430;&#x431;&#x43E; &#x434;&#x43E;&#x43C;&#x435;&#x43D;&#x43D;&#x438;&#x445; &#x456;&#x43C;&#x435;&#x43D;. &#x426;&#x44F; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F; &#x43D;&#x435; &#x441;&#x442;&#x43E;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x435; JavaScript.</p>
<h2 id="&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44F;-&#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;-proto">&#x424;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>__proto__</code></h2>
<p>&#x429;&#x435; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E; &#x44F;&#x43A; ECMAScript 5 &#x431;&#x443;&#x43B;&#x43E; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43E;, &#x434;&#x435;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x440;&#x443;&#x448;&#x456;&#x457;&#x432; JavaScript &#x432;&#x436;&#x435; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443;&#x432;&#x430;&#x43B;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x43D;&#x443; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; <code>__proto__</code>, &#x44F;&#x43A;&#x430; &#x43C;&#x43E;&#x436;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>[[Prototype]]</code>. &#x41F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x43E; <code>__proto__</code> &#x431;&#x443;&#x432; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x432;&#x456;&#x441;&#x43D;&#x438;&#x43A; &#x434;&#x43B;&#x44F; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456;&#x432; <code>Object.getPrototypeOf()</code> &#x442;&#x430; <code>Object.setPrototypeOf()</code>. &#x41E;&#x447;&#x456;&#x43A;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x440;&#x443;&#x448;&#x456;&#x457; JavaScript &#x432;&#x438;&#x434;&#x430;&#x43B;&#x44F;&#x442;&#x44C; &#x446;&#x44E; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43D;&#x435; &#x43C;&#x430;&#x454; &#x437;&#x43C;&#x456;&#x441;&#x442;&#x443; (&#x431;&#x443;&#x43B;&#x43E; &#x431;&#x430;&#x433;&#x430;&#x442;&#x43E; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x438;&#x445; JavaScript&#x2013;&#x431;&#x456;&#x431;&#x43B;&#x456;&#x43E;&#x442;&#x435;&#x43A;, &#x44F;&#x43A;&#x456; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x43B;&#x438; <code>__proto__</code>), &#x442;&#x43E;&#x43C;&#x443; ECMAScript 6 &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x454; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; <code>__proto__</code>. &#x41F;&#x440;&#x43E;&#x442;&#x435; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x456;&#x437;&#x430;&#x446;&#x456;&#x44F; &#x437;&#x2019;&#x44F;&#x432;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x414;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x443; &#x411; &#x434;&#x43E; ECMA-262 &#x440;&#x430;&#x437;&#x43E;&#x43C; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43F;&#x43E;&#x43F;&#x435;&#x440;&#x435;&#x434;&#x436;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;:</p>
<blockquote>
<p>&#x426;&#x456; &#x43D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x435; &#x432;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; &#x44F;&#x434;&#x440;&#x430; &#x43C;&#x43E;&#x432;&#x438; ECMAScript. &#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x430;&#x43C; &#x43D;&#x435; &#x441;&#x43B;&#x456;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x430;&#x431;&#x43E; &#x43F;&#x43E;&#x43A;&#x43B;&#x430;&#x434;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x446;&#x438;&#x445; &#x43D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x44C; &#x442;&#x430; &#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43F;&#x440;&#x438; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43D;&#x456; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x443; &#x43D;&#x430; ECMAScript. &#x406;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x44F;&#x43C; ECMAScript &#x43D;&#x435; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x440;&#x435;&#x430;&#x43B;&#x456;&#x437;&#x443;&#x432;&#x430;&#x442;&#x438; &#x446;&#x456; &#x43D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; &#x44F;&#x43A;&#x449;&#x43E; &#x446;&#x44F; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x44F; &#x43D;&#x435; &#x454; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; &#x432;&#x435;&#x431;&#x2013;&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430; &#x430;&#x431;&#x43E; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x454; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x443; &#x437;&#x430;&#x441;&#x442;&#x430;&#x440;&#x456;&#x43B;&#x43E;&#x433;&#x43E; ECMAScript&#x2013;&#x43A;&#x43E;&#x434;&#x443; &#x437; &#x44F;&#x43A;&#x438;&#x43C; &#x437;&#x443;&#x441;&#x442;&#x440;&#x456;&#x447;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x435;&#x431;&#x2013;&#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x438;.</p>
</blockquote>
<p>&#x421;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F; ECMAScript &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x443;&#x454; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>Object.getPrototypeOf()</code> &#x442;&#x430; <code>Object.setPrototypeOf()</code> &#x437;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; <code>__proto__</code>, &#x43E;&#x441;&#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x438; <code>__proto__</code> &#x43C;&#x430;&#x454; &#x442;&#x430;&#x43A;&#x456; &#x445;&#x430;&#x440;&#x430;&#x43A;&#x442;&#x435;&#x440;&#x438;&#x441;&#x442;&#x438;&#x43A;&#x438;:</p>
<ol>
<li>&#x412;&#x438; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; <code>__proto__</code> &#x43B;&#x438;&#x448;&#x435; &#x440;&#x430;&#x437; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x43C;&#x443; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;. &#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x435; &#x434;&#x432;&#x456; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>__proto__</code>, &#x442;&#x43E;&#x434;&#x456; &#x43A;&#x438;&#x43D;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;. &#x426;&#x435; &#x454;&#x434;&#x438;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x443; &#x437; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;.</li>
<li>&#x41E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x430; <code>[&quot;__proto__&quot;]</code> &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x430; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C; &#x456; &#x43D;&#x435; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454; &#x442;&#x430; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430;. &#x412;&#x441;&#x456; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x430;, &#x44F;&#x43A;&#x456; &#x441;&#x442;&#x43E;&#x441;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x445; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;&#x432; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x443;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x446;&#x456;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x456;, &#x43D;&#x430; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x443; &#x432;&#x456;&#x434; &#x43D;&#x435;&#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x432;&#x430;&#x43D;&#x43E;&#x457; &#x444;&#x43E;&#x440;&#x43C;&#x438;, &#x44F;&#x43A;&#x430; &#x43C;&#x430;&#x454; &#x432;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x44F;.</li>
</ol>
<p>&#x412;&#x430;&#x43C; &#x441;&#x43B;&#x456;&#x434; &#x443;&#x43D;&#x438;&#x43A;&#x430;&#x442;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>__proto__</code>, &#x43F;&#x440;&#x43E;&#x442;&#x435; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F; &#x457;&#x457; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x454; &#x446;&#x456;&#x43A;&#x430;&#x432;&#x438;&#x43C;. &#x423; &#x440;&#x443;&#x448;&#x456;&#x44F;&#x445; ECMAScript 6, <code>Object.prototype.__proto__</code> &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x44F;&#x43A; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x456;&#x441;&#x442;&#x44C;&#x2013;&#x430;&#x43A;&#x441;&#x435;&#x441;&#x43E;&#x440;, &#x443; &#x44F;&#x43A;&#x43E;&#x457; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>get</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; <code>Object.getPrototypeOf()</code>, &#x430; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>set</code> &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x430;&#x454; <code>Object.setPrototypeOf()</code>. &#x426;&#x435; &#x43D;&#x435; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x454; &#x441;&#x43F;&#x440;&#x430;&#x432;&#x436;&#x43D;&#x456;&#x445; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x432;&#x456;&#x434; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; <code>__proto__</code> &#x442;&#x430; <code>Object.getPrototypeOf()</code>/<code>Object.setPrototypeOf()</code>, &#x437;&#x430; &#x432;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; <code>__proto__</code> &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x454; &#x432;&#x430;&#x43C; &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F; &#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x43E;&#x43C;&#x443; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;&#x456;. &#x41E;&#x441;&#x44C; &#x44F;&#x43A; &#x446;&#x435; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> person = {
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Hello&quot;</span>;
    }
};

<span class="hljs-keyword">let</span> dog = {
    getGreeting() {
        <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Woof&quot;</span>;
    }
};

<span class="hljs-comment">// person &#x454; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x43E;&#x43C;</span>
<span class="hljs-keyword">let</span> friend = {
    __proto__: person
};
<span class="hljs-built_in">console</span>.log(friend.getGreeting());                      <span class="hljs-comment">// &quot;Hello&quot;</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.getPrototypeOf(friend) === person);  <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(friend.__proto__ === person);               <span class="hljs-comment">// true</span>

<span class="hljs-comment">// &#x432;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x44E;&#x454;&#x43C;&#x43E; dog &#x432; &#x44F;&#x43A;&#x43E;&#x441;&#x442;&#x456; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x442;&#x438;&#x43F;&#x430;</span>
friend.__proto__ = dog;
<span class="hljs-built_in">console</span>.log(friend.getGreeting());                      <span class="hljs-comment">// &quot;Woof&quot;</span>
<span class="hljs-built_in">console</span>.log(friend.__proto__ === dog);                  <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(<span class="hljs-built_in">Object</span>.getPrototypeOf(friend) === dog);     <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A;&#x443; <code>Object.create()</code> &#x434;&#x43B;&#x44F; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x430; <code>friend</code>, &#x446;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x44E;&#x454; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x43D;&#x438;&#x439; &#x43B;&#x456;&#x442;&#x435;&#x440;&#x430;&#x43B;, &#x44F;&#x43A;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456; <code>__proto__</code>. &#x417; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x431;&#x43E;&#x43A;&#x443;, &#x43F;&#x440;&#x438; &#x441;&#x442;&#x432;&#x43E;&#x440;&#x435;&#x43D;&#x43D;&#x456; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Object.create()</code>, &#x432;&#x430;&#x43C; &#x431;&#x438; &#x434;&#x43E;&#x432;&#x435;&#x43B;&#x43E;&#x441;&#x44C; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x432;&#x43D;&#x456; &#x434;&#x435;&#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x43E;&#x440;&#x438; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x436;&#x43D;&#x43E;&#x457; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x43E;&#x457; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x456;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="13-Modules.html" class="navigation navigation-prev " aria-label="Previous page: Глава 13: Інкапсуляція коду через модулі">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="B-ECMAScript-7.html" class="navigation navigation-next " aria-label="Next page: Додаток Б: Розуміння ECMAScript 7 (2016)">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Додаток А: Дрібніші зміни у ECMAScript 6","level":"1.16","depth":1,"next":{"title":"Додаток Б: Розуміння ECMAScript 7 (2016)","level":"1.17","depth":1,"path":"manuscript/B-ECMAScript-7.md","ref":"manuscript/B-ECMAScript-7.md","articles":[]},"previous":{"title":"Глава 13: Інкапсуляція коду через модулі","level":"1.15","depth":1,"path":"manuscript/13-Modules.md","ref":"manuscript/13-Modules.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","ga","rss","github-buttons"],"pluginsConfig":{"github":{"url":"https://github.com/LambdaBooks/understandinges6ua"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Рoзуміння ECMAScript 6","description":"Український переклад книги «Understanding ES6».","author":"Denys Dovhan","site_url":"http://understandinges6.denysdovhan.com/","feed_url":"http://understandinges6.denysdovhan.com/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"github-buttons":{"repo":"LambdaBooks/understandinges6ua","types":["star"],"size":"small"},"ga":{"configuration":"auto","token":"UA-40496885-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/LambdaBooks/understandinges6ua/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"manuscript/A-Other-Changes.md","mtime":"2017-04-16T13:01:32.623Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-04-16T13:02:47.551Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

