
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Додаток Б: Розуміння ECMAScript 7 (2016) · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="A-Other-Changes.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"denysdovhan/understandinges6ua","types":["star"],"size":"small"};
    </script>

    <link href="http://understandinges6.denysdovhan.com/rss.xml" title="Рoзуміння ECMAScript 6" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Рoзуміння ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00-Introduction.html">
            
                <a href="00-Introduction.html">
            
                    
                    Вступ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01-Block-Bindings.html">
            
                <a href="01-Block-Bindings.html">
            
                    
                    Глава 1: Блочне зв’язування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02-Strings-and-Regular-Expressions.html">
            
                <a href="02-Strings-and-Regular-Expressions.html">
            
                    
                    Глава 2: Рядки та регулярні вирази
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03-Functions.html">
            
                <a href="03-Functions.html">
            
                    
                    Глава 3: Функції
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="04-Objects.html">
            
                <a href="04-Objects.html">
            
                    
                    Глава 4: Розширена функціональність об’єктів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="05-Destructuring.html">
            
                <a href="05-Destructuring.html">
            
                    
                    Глава 5: Деструктурування для легшого доступу до даних
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="06-Symbols.html">
            
                <a href="06-Symbols.html">
            
                    
                    Глава 6: Символи та їх властивості
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="07-Sets-And-Maps.html">
            
                <a href="07-Sets-And-Maps.html">
            
                    
                    Глава 7: Множини та мапи
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="08-Iterators-And-Generators.html">
            
                <a href="08-Iterators-And-Generators.html">
            
                    
                    Глава 8: Ітератори та генератори
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="09-Classes.html">
            
                <a href="09-Classes.html">
            
                    
                    Глава 9: Знайомство з класами у JavaScript
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10-Arrays.html">
            
                <a href="10-Arrays.html">
            
                    
                    Глава 10: Покращені можливості масивів
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11-Promises.html">
            
                <a href="11-Promises.html">
            
                    
                    Глава 11: Проміси та асинхронне програмування
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12-Proxies-and-Reflection.html">
            
                <a href="12-Proxies-and-Reflection.html">
            
                    
                    Глава 12: Проксі та АРІ рефлексії
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13-Modules.html">
            
                <a href="13-Modules.html">
            
                    
                    Глава 13: Інкапсуляція коду через модулі
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="A-Other-Changes.html">
            
                <a href="A-Other-Changes.html">
            
                    
                    Додаток А: Дрібніші зміни у ECMAScript 6
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.17" data-path="B-ECMAScript-7.html">
            
                <a href="B-ECMAScript-7.html">
            
                    
                    Додаток Б: Розуміння ECMAScript 7 (2016)
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Додаток Б: Розуміння ECMAScript 7 (2016)</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F;-ecmascript-7-2016">&#x420;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F; ECMAScript 7 (2016)</h1>
<p>&#x420;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43A;&#x430; ECMAScript 6 &#x437;&#x430;&#x439;&#x43D;&#x44F;&#x43B;&#x430; &#x431;&#x43B;&#x438;&#x437;&#x44C;&#x43A;&#x43E; &#x447;&#x43E;&#x442;&#x438;&#x440;&#x44C;&#x43E;&#x445; &#x440;&#x43E;&#x43A;&#x456;&#x432;, &#x456; &#x43F;&#x456;&#x43B;&#x441;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, TC-39 &#x432;&#x438;&#x440;&#x456;&#x448;&#x438;&#x432;, &#x449;&#x43E; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x434;&#x43E;&#x432;&#x433;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43A;&#x438; &#x454; &#x43D;&#x435;&#x43F;&#x440;&#x438;&#x439;&#x43D;&#x44F;&#x442;&#x43D;&#x438;&#x43C;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E;, &#x432;&#x43E;&#x43D;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x448;&#x43B;&#x438; &#x434;&#x43E; &#x449;&#x43E;&#x440;&#x456;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x43B;&#x456;&#x437;&#x43D;&#x43E;&#x433;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x443;, &#x449;&#x43E;&#x431; &#x437;&#x430;&#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x438;&#x442;&#x438; &#x448;&#x432;&#x438;&#x434;&#x448;&#x435; &#x43D;&#x430;&#x434;&#x445;&#x43E;&#x434;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x44C; &#x43C;&#x43E;&#x432;&#x438; &#x443; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43A;&#x443;.</p>
<p>&#x411;&#x456;&#x43B;&#x44C;&#x448; &#x447;&#x430;&#x441;&#x442;&#x456; &#x440;&#x435;&#x43B;&#x456;&#x437;&#x438; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x44E;&#x442;&#x44C;, &#x449;&#x43E; &#x43A;&#x43E;&#x436;&#x43D;&#x430; &#x43D;&#x43E;&#x432;&#x430; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x446;&#x456;&#x44F; ECMAScript &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; &#x43C;&#x435;&#x43D;&#x448;&#x443; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x456;&#x441;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x44C; &#x43D;&#x456;&#x436; ECMAScript 6. &#x429;&#x43E;&#x431; &#x43F;&#x456;&#x434;&#x43A;&#x440;&#x435;&#x441;&#x43B;&#x438;&#x442;&#x438; &#x446;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x443;, &#x43D;&#x43E;&#x432;&#x456; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x435; &#x430;&#x43A;&#x446;&#x435;&#x43D;&#x442;&#x443;&#x44E;&#x442;&#x44C; &#x443;&#x432;&#x430;&#x433;&#x443; &#x43D;&#x430; &#x43D;&#x43E;&#x43C;&#x435;&#x440;&#x456; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x446;&#x456;&#x457;. &#x417;&#x430;&#x43C;&#x456;&#x441;&#x442;&#x44C; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43D;&#x43E;&#x432;&#x456; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; &#x43F;&#x43E;&#x441;&#x438;&#x43B;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x440;&#x456;&#x43A; &#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457;. &#x412; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x456;, ECMAScript 6 &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x432;&#x456;&#x434;&#x43E;&#x43C;&#x438;&#x439; &#x44F;&#x43A; ECMAScript 2015, &#x430; ECMAScript 7 &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x432;&#x456;&#x434;&#x43E;&#x43C;&#x438;&#x439; &#x44F;&#x43A; ECMAScript 2016. TC-39 &#x437;&#x431;&#x438;&#x440;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x443; &#x456;&#x43C;&#x435;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x438;&#x432;&#x2019;&#x44F;&#x437;&#x430;&#x43D;&#x443; &#x434;&#x43E; &#x440;&#x43E;&#x43A;&#x443; &#x43F;&#x443;&#x431;&#x43B;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x457; &#x434;&#x43B;&#x44F; &#x43C;&#x430;&#x439;&#x431;&#x443;&#x442;&#x43D;&#x456;&#x445; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x446;&#x456;&#x439; ECMAScript.</p>
<p>ECMAScript 2016 &#x431;&#x443;&#x432; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x438;&#x439; &#x443; &#x431;&#x435;&#x440;&#x435;&#x437;&#x43D;&#x456; 2016 &#x456; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43B;&#x438;&#x448;&#x435; &#x442;&#x440;&#x438; &#x440;&#x43E;&#x437;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x43E;&#x432;&#x438;: &#x43C;&#x430;&#x442;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x43D;&#x43E;&#x432;&#x438;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x442;&#x430; &#x43D;&#x43E;&#x432;&#x443; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x443; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;. &#x41F;&#x440;&#x43E; &#x43D;&#x438;&#x445; &#x456;&#x442;&#x438;&#x43C;&#x435;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x43A;&#x443;.</p>
<h2 id="&#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439;-&#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;">&#x415;&#x43A;&#x441;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;</h2>
<p>&#x404;&#x434;&#x438;&#x43D;&#x43E;&#x44E; &#x437;&#x43C;&#x456;&#x43D;&#x43E;&#x44E; &#x443; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441;&#x456; JavaScript, &#x44F;&#x43A;&#x430; &#x432;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; ECMAScript 2016, &#x454; <em>&#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; (exponentiation operator)</em>, &#x44F;&#x43A;&#x438;&#x439; &#x454; &#x43C;&#x430;&#x442;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x43E;&#x44E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44E; &#x43F;&#x456;&#x434;&#x43D;&#x435;&#x441;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43E; &#x441;&#x442;&#x435;&#x43F;&#x435;&#x43D;&#x44F;. JavaScript &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x432; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Math.pow()</code> &#x434;&#x43B;&#x44F; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x43D;&#x43D;&#x44F; &#x446;&#x456;&#x454;&#x457; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457;, &#x43F;&#x440;&#x43E;&#x442;&#x435; JavaScript &#x431;&#x443;&#x432; &#x43E;&#x434;&#x43D;&#x456;&#x454;&#x44E; &#x437; &#x43D;&#x435;&#x431;&#x430;&#x433;&#x430;&#x442;&#x44C;&#x43E;&#x445; &#x43C;&#x43E;&#x432;, &#x44F;&#x43A;&#x456; &#x432;&#x438;&#x43C;&#x430;&#x433;&#x430;&#x43B;&#x438; &#x434;&#x43B;&#x44F; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;, &#x430; &#x43D;&#x435; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;. (&#x406; &#x434;&#x435;&#x44F;&#x43A;&#x456; &#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x438; &#x432;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x442;&#x44C; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x430; &#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43D;&#x43D;&#x44F;.)</p>
<p>&#x415;&#x43A;&#x441;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x43C; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x454; &#x434;&#x432;&#x456; &#x437;&#x456;&#x440;&#x43E;&#x447;&#x43A;&#x438; (<code>**</code>), &#x434;&#x435; &#x43B;&#x456;&#x432;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x43D;&#x434; &#x454; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43E;&#x44E;, &#x430; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x439; &#x2014; &#x441;&#x442;&#x435;&#x43F;&#x435;&#x43D;&#x435;&#x43C;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> result = <span class="hljs-number">5</span> ** <span class="hljs-number">2</span>;

<span class="hljs-built_in">console</span>.log(result);                        <span class="hljs-comment">// 25</span>
<span class="hljs-built_in">console</span>.log(result === <span class="hljs-built_in">Math</span>.pow(<span class="hljs-number">5</span>, <span class="hljs-number">2</span>));     <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x426;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x454; 5^2^, &#x449;&#x43E; &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454; 25. &#x412;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>Math.pow()</code> &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x43D;&#x44F; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x436; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443;.</p>
<h3 id="&#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A;-&#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439;">&#x41F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439;</h3>
<p>&#x415;&#x43A;&#x441;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43C;&#x430;&#x454; &#x43D;&#x430;&#x439;&#x432;&#x438;&#x449;&#x438;&#x439; &#x43F;&#x440;&#x456;&#x43E;&#x440;&#x438;&#x442;&#x435;&#x442; &#x437; &#x443;&#x441;&#x456;&#x445; &#x431;&#x456;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x445; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432; &#x443; JavaScript (&#x443;&#x43D;&#x430;&#x440;&#x43D;&#x456; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x432;&#x438;&#x449;&#x438;&#x439; &#x43F;&#x440;&#x456;&#x43E;&#x440;&#x438;&#x442;&#x435;&#x442; &#x43D;&#x456;&#x436; <code>**</code>). &#x426;&#x435; &#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x454;, &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x448;&#x438;&#x43C; &#x443; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x435;&#x43D;&#x438;&#x445; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F;&#x445;, &#x44F;&#x43A; &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> result = <span class="hljs-number">2</span> * <span class="hljs-number">5</span> ** <span class="hljs-number">2</span>;
<span class="hljs-built_in">console</span>.log(result);        <span class="hljs-comment">// 50</span>
</code></pre>
<p>&#x421;&#x43F;&#x435;&#x440;&#x448;&#x443; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; 5^2^. &#x41E;&#x442;&#x440;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x439; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43C;&#x43D;&#x43E;&#x436;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; 2 &#x456; &#x43E;&#x442;&#x440;&#x438;&#x43C;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x438;&#x439; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; 50.</p>
<h3 id="&#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F;-&#x43E;&#x43F;&#x435;&#x440;&#x430;&#x43D;&#x434;&#x456;&#x432;">&#x41E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x43D;&#x434;&#x456;&#x432;</h3>
<p>&#x415;&#x43A;&#x441;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43C;&#x430;&#x454; &#x43E;&#x434;&#x43D;&#x435; &#x43D;&#x435;&#x437;&#x432;&#x438;&#x447;&#x430;&#x439;&#x43D;&#x435; &#x43E;&#x431;&#x43C;&#x435;&#x436;&#x435;&#x43D;&#x43D;&#x44F;, &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x443; &#x456;&#x43D;&#x448;&#x438;&#x445; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x456;&#x432;. &#x41B;&#x456;&#x432;&#x43E;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x438;&#x439; &#x443;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x439; &#x432;&#x438;&#x440;&#x430;&#x437;, &#x43E;&#x43A;&#x440;&#x456;&#x43C; <code>++</code> &#x430;&#x431;&#x43E; <code>--</code>. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x442;&#x430;&#x43A;&#x438;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; &#x43D;&#x435; &#x454; &#x432;&#x430;&#x43B;&#x456;&#x434;&#x43D;&#x438;&#x43C;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;</span>
<span class="hljs-keyword">let</span> result = <span class="hljs-number">-5</span> ** <span class="hljs-number">2</span>;
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456; <code>-5</code> &#x454; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x43E;&#x44E; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x43E;&#x44E;, &#x431;&#x43E; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x439; &#x454; &#x43D;&#x435;&#x43E;&#x434;&#x43D;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x43D;&#x438;&#x43C;. &#x427;&#x438; &#x43C;&#x430;&#x454; <code>-</code> &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x43E; <code>5</code>, &#x447;&#x438; &#x434;&#x43E; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443; <code>5 ** 2</code>? &#x417;&#x430;&#x431;&#x43E;&#x440;&#x43E;&#x43D;&#x430; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x443;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x445; &#x432;&#x438;&#x440;&#x430;&#x437;&#x456;&#x432; &#x443; &#x43B;&#x456;&#x432;&#x456;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x456; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x432;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x454; &#x446;&#x44E; &#x43D;&#x435;&#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x456;&#x441;&#x442;&#x44C;. &#x414;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E;&#x431; &#x447;&#x456;&#x442;&#x43A;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x438; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x43A;&#x440;&#x443;&#x433;&#x43B;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x434;&#x43E;&#x432;&#x43A;&#x43E;&#x43B;&#x430; <code>-5</code> &#x430;&#x431;&#x43E; &#x434;&#x43E;&#x432;&#x43A;&#x43E;&#x43B;&#x430; <code>5 ** 2</code>, &#x43E;&#x441;&#x44C; &#x442;&#x430;&#x43A;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x434;&#x43E;&#x431;&#x440;&#x435;</span>
<span class="hljs-keyword">let</span> result1 = -(<span class="hljs-number">5</span> ** <span class="hljs-number">2</span>);    <span class="hljs-comment">// &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454; -25</span>

<span class="hljs-comment">// &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x434;&#x43E;&#x431;&#x440;&#x435;</span>
<span class="hljs-keyword">let</span> result2 = (<span class="hljs-number">-5</span>) ** <span class="hljs-number">2</span>;    <span class="hljs-comment">// &#x434;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44E;&#x454; 25</span>
</code></pre>
<p>&#x42F;&#x43A;&#x449;&#x43E; &#x432;&#x438; &#x434;&#x43E;&#x434;&#x430;&#x441;&#x442;&#x435; &#x43A;&#x440;&#x443;&#x433;&#x43B;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x434;&#x43E;&#x432;&#x43A;&#x43E;&#x43B;&#x430; &#x432;&#x438;&#x440;&#x430;&#x437;&#x443;, <code>-</code> &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x443;. &#x41A;&#x43E;&#x43B;&#x438; &#x436; &#x432;&#x438; &#x43E;&#x431;&#x435;&#x440;&#x43D;&#x435;&#x442;&#x435; &#x443; &#x43A;&#x440;&#x443;&#x433;&#x43B;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; <code>-5</code>, &#x431;&#x443;&#x434;&#x435; &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x43B;&#x43E;, &#x449;&#x43E; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x43F;&#x456;&#x434;&#x43D;&#x435;&#x441;&#x442;&#x438; -5 &#x434;&#x43E; &#x43A;&#x432;&#x430;&#x434;&#x440;&#x430;&#x442;&#x443;.</p>
<p>&#x412;&#x430;&#x43C; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x456; &#x43A;&#x440;&#x443;&#x433;&#x43B;&#x456; &#x434;&#x443;&#x436;&#x43A;&#x438; &#x43F;&#x440;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456; <code>++</code> &#x442;&#x430; <code>--</code> &#x443; &#x43B;&#x456;&#x432;&#x456;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x456; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438; &#x43C;&#x430;&#x44E;&#x442;&#x44C; &#x447;&#x456;&#x442;&#x43A;&#x43E; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x443; &#x43D;&#x430;&#x434; &#x441;&#x432;&#x43E;&#x457;&#x43C;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x43D;&#x434;&#x430;&#x43C;&#x438;. &#x41F;&#x440;&#x435;&#x444;&#x456;&#x43A;&#x441; <code>++</code> &#x430;&#x431;&#x43E; <code>--</code> &#x437;&#x43C;&#x456;&#x43D;&#x44E;&#x44E;&#x442;&#x44C; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x43D;&#x434; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x443;&#x434;&#x44C;&#x2013;&#x44F;&#x43A;&#x430; &#x456;&#x43D;&#x448;&#x430; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x44F;, &#x43F;&#x43E;&#x441;&#x442;&#x444;&#x456;&#x43A;&#x441;&#x43D;&#x456; &#x432;&#x435;&#x440;&#x441;&#x456;&#x457; &#x43D;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x43D;&#x430;&#x44E;&#x442;&#x44C; &#x436;&#x43E;&#x434;&#x43D;&#x438;&#x445; &#x437;&#x43C;&#x456;&#x43D;, &#x434;&#x43E;&#x43A;&#x438; &#x432;&#x435;&#x441;&#x44C; &#x432;&#x438;&#x440;&#x430;&#x437; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435; &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43E;. &#x41E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x438; &#x454; &#x431;&#x435;&#x437;&#x43F;&#x435;&#x447;&#x43D;&#x438;&#x43C;&#x438; &#x443; &#x43B;&#x456;&#x432;&#x456;&#x439; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x456; &#x446;&#x44C;&#x43E;&#x433;&#x43E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;, &#x456; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434; &#x446;&#x435; &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x454;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> num1 = <span class="hljs-number">2</span>,
    num2 = <span class="hljs-number">2</span>;

<span class="hljs-built_in">console</span>.log(++num1 ** <span class="hljs-number">2</span>);       <span class="hljs-comment">// 9</span>
<span class="hljs-built_in">console</span>.log(num1);              <span class="hljs-comment">// 3</span>

<span class="hljs-built_in">console</span>.log(num2-- ** <span class="hljs-number">2</span>);       <span class="hljs-comment">// 4</span>
<span class="hljs-built_in">console</span>.log(num2);              <span class="hljs-comment">// 1</span>
</code></pre>
<p>&#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;, <code>num1</code> &#x437;&#x431;&#x456;&#x43B;&#x44C;&#x448;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; &#x437;&#x430;&#x441;&#x442;&#x43E;&#x441;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;, &#x442;&#x43E;&#x43C;&#x443; <code>num1</code> &#x441;&#x442;&#x430;&#x454; 3, &#x430; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x456;&#x457; &#x454; 9. &#x414;&#x43B;&#x44F; <code>num2</code>, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430;&#x43B;&#x438;&#x448;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; 2 &#x434;&#x43B;&#x44F; &#x435;&#x43A;&#x441;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x446;&#x456;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;, &#x430; &#x43F;&#x43E;&#x442;&#x456;&#x43C; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x437;&#x43C;&#x435;&#x43D;&#x448;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; 1.</p>
<h2 id="&#x43C;&#x435;&#x442;&#x43E;&#x434;-arrayprototypeincludes">&#x41C;&#x435;&#x442;&#x43E;&#x434; Array.prototype.includes()</h2>
<p>&#x412;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x43F;&#x430;&#x43C;&#x2019;&#x44F;&#x442;&#x430;&#x442;&#x438;, &#x449;&#x43E; ECMAScript 6 &#x434;&#x43E;&#x434;&#x430;&#x432; <code>String.prototype.includes()</code> &#x434;&#x43B;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x43A;&#x438; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x438; &#x43F;&#x456;&#x434;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x454; &#x447;&#x430;&#x441;&#x442;&#x438;&#x43D;&#x43E;&#x44E; &#x434;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x44F;&#x434;&#x43A;&#x430;. &#x41F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x43E;, ECMAScript 6 &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x430;&#x432; &#x434;&#x43E;&#x434;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>Array.prototype.includes()</code>, &#x449;&#x43E;&#x431; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x432;&#x436;&#x438;&#x442;&#x438; &#x442;&#x435;&#x43D;&#x434;&#x435;&#x43D;&#x446;&#x456;&#x44E; &#x434;&#x43E; &#x442;&#x440;&#x430;&#x43A;&#x442;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x440;&#x44F;&#x434;&#x43A;&#x456;&#x432; &#x442;&#x430; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;&#x432; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438;&#x43C; &#x447;&#x438;&#x43D;&#x43E;&#x43C;. &#x41F;&#x440;&#x43E;&#x442;&#x435; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F; &#x434;&#x43B;&#x44F; <code>Array.prototype.includes()</code> &#x43D;&#x435; &#x431;&#x443;&#x43B;&#x430; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x43E;&#x44E; &#x432;&#x447;&#x430;&#x441;&#x43D;&#x43E;, &#x456; &#x442;&#x43E;&#x43C;&#x443; <code>Array.prototype.includes()</code> &#x437;&#x2019;&#x44F;&#x432;&#x43B;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x435; &#x432; ECMAScript 2016.</p>
<h3 id="&#x44F;&#x43A;-&#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438;-arrayprototypeincludes">&#x42F;&#x43A; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; Array.prototype.includes()</h3>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>Array.prototype.includes()</code> &#x43F;&#x440;&#x438;&#x439;&#x43C;&#x430;&#x454; &#x434;&#x432;&#x430; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;: &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x448;&#x443;&#x43A;&#x443; &#x456; &#x43D;&#x435;&#x43E;&#x431;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x43A;&#x43E;&#x432;&#x438;&#x439; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441; &#x437; &#x44F;&#x43A;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x448;&#x443;&#x43A;. &#x42F;&#x43A;&#x449;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;, <code>includes()</code> &#x43F;&#x43E;&#x447;&#x43D;&#x435; &#x448;&#x443;&#x43A;&#x430;&#x442;&#x438; &#x441;&#x43F;&#x456;&#x432;&#x43F;&#x430;&#x434;&#x456;&#x43D;&#x43D;&#x44F; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; &#x432;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E;&#x433;&#x43E; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x430;. (&#x417;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x43F;&#x43E;&#x447;&#x430;&#x442;&#x43A;&#x43E;&#x432;&#x438;&#x43C; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x43E;&#x43C; &#x454; <code>0</code>.) &#x420;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C; &#x454; <code>true</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x43E; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;, &#x456; <code>false</code>, &#x44F;&#x43A;&#x449;&#x43E; &#x43D;&#x456;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> values = [<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>];

<span class="hljs-built_in">console</span>.log(values.includes(<span class="hljs-number">1</span>));        <span class="hljs-comment">// true</span>
<span class="hljs-built_in">console</span>.log(values.includes(<span class="hljs-number">0</span>));        <span class="hljs-comment">// false</span>

<span class="hljs-comment">// &#x448;&#x443;&#x43A;&#x430;&#x454;&#x43C;&#x43E;, &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x447;&#x438; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; 2</span>
<span class="hljs-built_in">console</span>.log(values.includes(<span class="hljs-number">1</span>, <span class="hljs-number">2</span>));     <span class="hljs-comment">// false</span>
</code></pre>
<p>&#x422;&#x443;&#x442; &#x432;&#x438;&#x43A;&#x43B;&#x438;&#x43A; <code>values.includes()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>true</code> &#x434;&#x43B;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>1</code> &#x442;&#x430; <code>false</code> &#x434;&#x43B;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; <code>0</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; <code>0</code> &#x43D;&#x435;&#x43C;&#x430;&#x454; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;. &#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x440;&#x443;&#x433;&#x438;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;, &#x449;&#x43E;&#x431; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x430;&#x442;&#x438; &#x43F;&#x43E;&#x448;&#x443;&#x43A; &#x437; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x443; 2 (&#x44F;&#x43A;&#x438;&#x439; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;  <code>3</code>), &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>values.includes()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>false</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x447;&#x438;&#x441;&#x43B;&#x43E; <code>1</code> &#x43D;&#x435; &#x437;&#x43D;&#x430;&#x439;&#x434;&#x435;&#x43D;&#x43E; &#x43F;&#x43E;&#x43C;&#x456;&#x436; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x43E;&#x43C; 2 &#x442;&#x430; &#x43A;&#x456;&#x43D;&#x446;&#x435;&#x43C; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x443;.</p>
<h3 id="&#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x43D;&#x43D;&#x44F;-&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;">&#x41F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;</h3>
<p>&#x41F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C;, &#x44F;&#x43A;&#x435; &#x432;&#x456;&#x434;&#x431;&#x443;&#x432;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x456; <code>includes()</code>, &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>===</code> &#x437; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x432;&#x438;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;: <code>NaN</code> &#x432;&#x432;&#x430;&#x436;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x440;&#x456;&#x432;&#x43D;&#x438;&#x43C; <code>NaN</code>, &#x43D;&#x435; &#x434;&#x438;&#x432;&#x43B;&#x44F;&#x447;&#x438;&#x441;&#x44C; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; <code>NaN === NaN</code> &#x43E;&#x431;&#x447;&#x438;&#x441;&#x43B;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; <code>false</code>. &#x426;&#x44F; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x443; <code>indexOf()</code>, &#x44F;&#x43A;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x43D;&#x43D;&#x44F; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; <code>===</code>. &#x429;&#x43E;&#x431; &#x43F;&#x43E;&#x431;&#x430;&#x447;&#x438;&#x442;&#x438; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> values = [<span class="hljs-number">1</span>, <span class="hljs-literal">NaN</span>, <span class="hljs-number">2</span>];

<span class="hljs-built_in">console</span>.log(values.indexOf(<span class="hljs-literal">NaN</span>));       <span class="hljs-comment">// -1</span>
<span class="hljs-built_in">console</span>.log(values.includes(<span class="hljs-literal">NaN</span>));      <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x41C;&#x435;&#x442;&#x43E;&#x434; <code>values.indexOf()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>-1</code> &#x434;&#x43B;&#x44F; <code>NaN</code>, &#x43D;&#x435;&#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x442;&#x435;, &#x449;&#x43E; <code>NaN</code> &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; <code>values</code>. &#x417; &#x456;&#x43D;&#x448;&#x43E;&#x433;&#x43E; &#x431;&#x43E;&#x43A;&#x443;, <code>values.includes()</code> &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x442;&#x430;&#x454; <code>true</code> &#x434;&#x43B;&#x44F; <code>NaN</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x456;&#x43D; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x454; &#x456;&#x43D;&#x448;&#x438;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; &#x43F;&#x43E;&#x440;&#x456;&#x432;&#x43D;&#x44F;&#x43D;&#x43D;&#x44F;.</p>
<p>W&gt; &#x41A;&#x43E;&#x43B;&#x438; &#x432;&#x438; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x456;&#x440;&#x438;&#x442;&#x438; &#x456;&#x441;&#x43D;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456; &#x456; &#x432;&#x430;&#x43C; &#x43D;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x434;&#x456;&#x437;&#x43D;&#x430;&#x432;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x439;&#x43E;&#x433;&#x43E; &#x456;&#x43D;&#x434;&#x435;&#x43A;&#x441;, &#x44F; &#x440;&#x430;&#x434;&#x436;&#x443; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>includes()</code>, &#x447;&#x435;&#x440;&#x435;&#x437; &#x432;&#x456;&#x434;&#x43C;&#x456;&#x43D;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x442;&#x43E;&#x433;&#x43E;, &#x44F;&#x43A; <code>NaN</code> &#x442;&#x440;&#x430;&#x43A;&#x442;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x445; <code>includes()</code> &#x442;&#x430; <code>indexOf()</code>. &#x42F;&#x43A;&#x449;&#x43E; &#x436; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x456;&#x431;&#x43D;&#x43E; &#x434;&#x456;&#x437;&#x43D;&#x430;&#x442;&#x438;&#x441;&#x44C; &#x434;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x456;&#x441;&#x43D;&#x443;&#x454; &#x443; &#x43C;&#x430;&#x441;&#x438;&#x432;&#x456;, &#x442;&#x43E;&#x434;&#x456; &#x432;&#x438; &#x43C;&#x430;&#x454;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>indexOf()</code>.</p>
<p>&#x406;&#x43D;&#x448;&#x43E;&#x44E; &#x43F;&#x456;&#x434;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x456;&#x441;&#x442;&#x44E; &#x446;&#x456;&#x454;&#x457; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x457; &#x454; &#x442;&#x435;, &#x449;&#x43E; <code>+0</code> &#x442;&#x430; <code>-0</code> &#x432;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438;&#x43C;&#x438;. &#x423; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443;, &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x430; <code>indexOf()</code> &#x442;&#x430; <code>includes()</code> &#x454; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x43E;&#x44E;:</p>
<pre><code class="lang-js"><span class="hljs-keyword">let</span> values = [<span class="hljs-number">1</span>, +<span class="hljs-number">0</span>, <span class="hljs-number">2</span>];

<span class="hljs-built_in">console</span>.log(values.indexOf(<span class="hljs-number">-0</span>));        <span class="hljs-comment">// 1</span>
<span class="hljs-built_in">console</span>.log(values.includes(<span class="hljs-number">-0</span>));       <span class="hljs-comment">// true</span>
</code></pre>
<p>&#x422;&#x443;&#x442;, &#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>indexOf()</code>, &#x456; &#x43C;&#x435;&#x442;&#x43E;&#x434; <code>includes()</code> &#x437;&#x43D;&#x430;&#x445;&#x43E;&#x434;&#x44F;&#x442;&#x44C; <code>+0</code>, &#x43A;&#x43E;&#x43B;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x454;&#x442;&#x44C;&#x441;&#x44F; <code>-0</code>, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x43E;&#x431;&#x438;&#x434;&#x432;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x432;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x434;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x438;&#x43C;&#x438;. &#x417;&#x430;&#x443;&#x432;&#x430;&#x436;&#x442;&#x435;, &#x449;&#x43E; &#x446;&#x435; &#x432;&#x456;&#x434;&#x440;&#x456;&#x437;&#x43D;&#x44F;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x456;&#x434; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x456;&#x43D;&#x43A;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430; <code>Object.is()</code>, &#x44F;&#x43A;&#x438;&#x439; &#x432;&#x432;&#x430;&#x436;&#x430;&#x454; <code>+0</code> &#x442;&#x430; <code>-0</code> &#x440;&#x456;&#x437;&#x43D;&#x438;&#x43C;&#x438; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438;.</p>
<h2 id="&#x437;&#x43C;&#x456;&#x43D;&#x438;-&#x443;-&#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443;-&#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;-&#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457;-&#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456;-&#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;">&#x417;&#x43C;&#x456;&#x43D;&#x438; &#x443; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x457; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456;</h2>
<p>&#x41A;&#x43E;&#x43B;&#x438; ECMAScript 5 &#x432;&#x432;&#x456;&#x432; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C;, &#x43C;&#x43E;&#x432;&#x430; &#x431;&#x443;&#x43B;&#x430; &#x434;&#x435;&#x449;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x456;&#x448;&#x43E;&#x44E; &#x43D;&#x456;&#x436; &#x432;&#x43E;&#x43D;&#x430; &#x441;&#x442;&#x430;&#x43B;&#x430; &#x443; ECMAScript 6. &#x41D;&#x435;&#x437;&#x432;&#x430;&#x436;&#x430;&#x44E;&#x447;&#x438; &#x43D;&#x430; &#x446;&#x435;, ECMAScript 6 &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x432; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43C; &#x447;&#x435;&#x440;&#x435;&#x437; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x438; <code>&quot;use strict&quot;</code> &#x443; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; (&#x449;&#x43E; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43B;&#x43E; &#x431; &#x432;&#x435;&#x441;&#x44C; &#x43A;&#x43E;&#x434; &#x443; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;) &#x430;&#x431;&#x43E; &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x456;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x456; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x456; (&#x442;&#x430;&#x43A;, &#x449;&#x43E;&#x431; &#x43B;&#x438;&#x448;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x43B;&#x430;&#x441;&#x44C; &#x443; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;). &#x41E;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x456;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x456;&#x431; &#x431;&#x443;&#x432; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x43D;&#x438;&#x43C; &#x443; ECMAScript 6 &#x447;&#x435;&#x440;&#x435;&#x437; &#x431;&#x456;&#x43B;&#x44C;&#x448; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x456; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x438; &#x432;&#x438;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;, &#x437; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x429;&#x43E;&#x431; &#x437;&#x440;&#x43E;&#x437;&#x443;&#x43C;&#x456;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443;, &#x440;&#x43E;&#x437;&#x433;&#x43B;&#x44F;&#x43D;&#x44C;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x434;:</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">doSomething</span>(<span class="hljs-params">first = this</span>) </span>{
<span class="hljs-meta">    &quot;use strict&quot;</span>;

    <span class="hljs-keyword">return</span> first;
}
</code></pre>
<p>&#x422;&#x443;&#x442; &#x456;&#x43C;&#x435;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x43E;&#x43C;&#x443; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x443; <code>first</code> &#x43F;&#x440;&#x438;&#x441;&#x432;&#x43E;&#x44E;&#x454;&#x442;&#x44C;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; <code>this</code>. &#x42F;&#x43A;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x43C;&#x430;&#x442;&#x438;&#x43C;&#x435; <code>first</code>? &#x421;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x456;&#x43A;&#x430;&#x446;&#x456;&#x44F; ECMAScript 6 &#x432;&#x43A;&#x430;&#x437;&#x443;&#x454; &#x440;&#x443;&#x448;&#x456;&#x454;&#x432;&#x456; JavaScript &#x442;&#x440;&#x430;&#x43A;&#x442;&#x443;&#x432;&#x430;&#x442;&#x438; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438;, &#x443; &#x446;&#x44C;&#x43E;&#x43C;&#x443; &#x432;&#x438;&#x43F;&#x430;&#x434;&#x43A;&#x443; &#x442;&#x430;&#x43A;, &#x44F;&#x43A; &#x43F;&#x456;&#x434; &#x447;&#x430;&#x441; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x443; &#x443; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;, &#x442;&#x43E;&#x43C;&#x443; <code>this</code> &#x43C;&#x430;&#x454; &#x431;&#x443;&#x442;&#x438; &#x440;&#x456;&#x432;&#x43D;&#x438;&#x43C; <code>undefined</code>. &#x41E;&#x434;&#x43D;&#x430;&#x43A;, &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432;, &#x44F;&#x43A;&#x456; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x44E;&#x442;&#x44C;&#x441;&#x44F; &#x443; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E;&#x43C;&#x443; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x456;, &#x43A;&#x43E;&#x43B;&#x438; &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x43F;&#x440;&#x438;&#x441;&#x443;&#x442;&#x43D;&#x44F; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x430; <code>&quot;use strict&quot;</code>, &#x441;&#x442;&#x430;&#x454; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;&#x44E; &#x447;&#x435;&#x440;&#x435;&#x437; &#x442;&#x435;, &#x449;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C; &#x442;&#x430;&#x43A;&#x43E;&#x436; &#x43C;&#x43E;&#x436;&#x435; &#x431;&#x443;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;. &#x426;&#x44F; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x456;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x437;&#x432;&#x435;&#x43B;&#x430; &#x434;&#x43E; &#x442;&#x43E;&#x433;&#x43E;, &#x449;&#x43E; &#x431;&#x456;&#x43B;&#x44C;&#x448;&#x456;&#x441;&#x442;&#x44C; &#x440;&#x443;&#x448;&#x456;&#x457;&#x432; JavaScript &#x43D;&#x435; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x443;&#x44E;&#x442;&#x44C; &#x446;&#x435; &#x43D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x43D;&#x44F; (&#x442;&#x43E;&#x43C;&#x443; <code>this</code> &#x431;&#x443;&#x432; &#x431;&#x438; &#x440;&#x456;&#x432;&#x43D;&#x438;&#x43C; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C;&#x443; &#x43E;&#x431;&#x2019;&#x454;&#x43A;&#x442;&#x443;).</p>
<p>&#x412;&#x43D;&#x430;&#x441;&#x43B;&#x456;&#x434;&#x43E;&#x43A; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;&#x449;&#x456;&#x432;, &#x43F;&#x43E;&#x432;&#x2019;&#x44F;&#x437;&#x430;&#x43D;&#x438;&#x445; &#x437; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x454;&#x44E;, ECMAScript 2016 &#x437;&#x430;&#x431;&#x43E;&#x440;&#x43E;&#x43D;&#x44F;&#x454; &#x43C;&#x430;&#x442;&#x438; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x443; <code>&quot;use strict&quot;</code> &#x432;&#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x456; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457;, &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x438; &#x44F;&#x43A;&#x43E;&#x457; &#x43C;&#x456;&#x441;&#x442;&#x44F;&#x442;&#x44C; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x41B;&#x438;&#x448;&#x435; <em>&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x439; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432;</em>, &#x44F;&#x43A;&#x438;&#x439; &#x43D;&#x435; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x434;&#x435;&#x43A;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F; &#x430;&#x431;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x44C; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;, &#x434;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x43A;&#x43E;&#x43B;&#x438; &#x442;&#x456;&#x43B;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x43C;&#x456;&#x441;&#x442;&#x438;&#x442;&#x44C; <code>&quot;use strict&quot;</code>. &#x41E;&#x441;&#x44C; &#x43A;&#x456;&#x43B;&#x44C;&#x43A;&#x430; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x456;&#x432;:</p>
<pre><code class="lang-js"><span class="hljs-comment">// &#x434;&#x43E;&#x431;&#x440;&#x435; - &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x430;&#x43D;&#x43D;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x433;&#x43E; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x443; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432;</span>
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">okay</span>(<span class="hljs-params">first, second</span>) </span>{
<span class="hljs-meta">    &quot;use strict&quot;</span>;

    <span class="hljs-keyword">return</span> first;
}

<span class="hljs-comment">// &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;</span>
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">notOkay1</span>(<span class="hljs-params">first, second=first</span>) </span>{
<span class="hljs-meta">    &quot;use strict&quot;</span>;

    <span class="hljs-keyword">return</span> first;
}

<span class="hljs-comment">// &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x430; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x430;</span>
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">notOkay2</span>(<span class="hljs-params">{ first, second }</span>) </span>{
<span class="hljs-meta">    &quot;use strict&quot;</span>;

    <span class="hljs-keyword">return</span> first;
}
</code></pre>
<p>&#x412;&#x438; &#x434;&#x43E;&#x441;&#x456; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>&quot;use strict&quot;</code> &#x437; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x43C; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x43E;&#x43C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432;, &#x43E;&#x441;&#x44C; &#x447;&#x43E;&#x43C;&#x443; <code>okay()</code> &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x454; &#x442;&#x430;&#x43A;, &#x44F;&#x43A; &#x456; &#x43E;&#x447;&#x456;&#x43A;&#x443;&#x454;&#x442;&#x44C;&#x441;&#x44F; (&#x442;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x44F;&#x43A; &#x431;&#x438; &#x432;&#x456;&#x43D; &#x43F;&#x440;&#x430;&#x446;&#x44E;&#x432;&#x430;&#x432; &#x443;  ECMAScript 5). &#x424;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>notOkay1()</code> &#x43C;&#x430;&#x454; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x443; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x442;&#x43E;&#x43C;&#x443; &#x449;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>&quot;use strict&quot;</code> &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F;&#x445; &#x437;&#x456; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x43D;&#x44F;&#x43C;&#x438; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x456;&#x432; &#x437;&#x430; &#x437;&#x430;&#x43C;&#x43E;&#x432;&#x447;&#x443;&#x432;&#x430;&#x43D;&#x43D;&#x44F;&#x43C;. &#x422;&#x430;&#x43A; &#x441;&#x430;&#x43C;&#x43E;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x44F; <code>notOkay2()</code> &#x43C;&#x430;&#x454; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x447;&#x43D;&#x443; &#x43F;&#x43E;&#x43C;&#x438;&#x43B;&#x43A;&#x443;, &#x431;&#x43E; &#x432;&#x438; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x432;&#x438;&#x43A;&#x43E;&#x440;&#x438;&#x441;&#x442;&#x43E;&#x432;&#x443;&#x432;&#x430;&#x442;&#x438; <code>&quot;use strict&quot;</code> &#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x456;&#x457; &#x437; &#x434;&#x435;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x438;&#x43C; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C;.</p>
<p>&#x417;&#x440;&#x435;&#x448;&#x442;&#x43E;&#x44E;, &#x446;&#x44F; &#x437;&#x43C;&#x456;&#x43D;&#x430; &#x437;&#x432;&#x456;&#x43B;&#x44C;&#x43D;&#x44F;&#x454; &#x44F;&#x43A; &#x456; JavaScript&#x2013;&#x440;&#x43E;&#x437;&#x440;&#x43E;&#x431;&#x43D;&#x438;&#x43A;&#x456;&#x432; &#x432;&#x456;&#x434; &#x43F;&#x43B;&#x443;&#x442;&#x430;&#x43D;&#x438;&#x43D;&#x438;, &#x442;&#x430;&#x43A; &#x456; &#x440;&#x443;&#x448;&#x456;&#x457; JavaScript &#x432;&#x456;&#x434; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x438; &#x437; &#x456;&#x43C;&#x43F;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x456;&#x454;&#x44E;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="A-Other-Changes.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Додаток А: Дрібніші зміни у ECMAScript 6">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Додаток Б: Розуміння ECMAScript 7 (2016)","level":"1.17","depth":1,"previous":{"title":"Додаток А: Дрібніші зміни у ECMAScript 6","level":"1.16","depth":1,"path":"manuscript/A-Other-Changes.md","ref":"manuscript/A-Other-Changes.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"3.x.x","theme":"default","variables":{},"plugins":["edit-link","github","yametrika","ga","rss","github-buttons"],"pluginsConfig":{"yametrika":{"number":"41711034"},"github":{"url":"https://github.com/denysdovhan/understandinges6ua"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["frontend","js","javascript","es6","es2015","ecmascript"],"title":"Рoзуміння ECMAScript 6","description":"Український переклад книги «Understanding ES6».","author":"Denys Dovhan and Terry Sahaidak","site_url":"http://understandinges6.denysdovhan.com/","feed_url":"http://understandinges6.denysdovhan.com/rss.xml","managingEditor":"email@denysdovhan.com (Denys Dovhan)","webMaster":"email@denysdovhan.com (Denys Dovhan)"},"highlight":{},"github-buttons":{"repo":"denysdovhan/understandinges6ua","types":["star"],"size":"small"},"ga":{"configuration":"auto","token":"UA-40496885-6"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Редагувати","base":"https://github.com/denysdovhan/understandinges6ua/tree/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"manuscript/B-ECMAScript-7.md","mtime":"2017-01-22T12:39:19.406Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-01-22T12:40:55.954Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-yametrika/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

